[
    "/specializations/programming-python-java",
    {
       "Url":"/learn/python-programming-intro?specialization=programming-python-java",
       "name":"Introduction to Python Programming",
       "Rating":"Introduction to Python Programming\n4.1\nstars\n214 ratings\n•\n80 reviews\n\nThis course provides an introduction to programming and the Python language.  Students are introduced to core programming concepts like data structures, conditionals, loops, variables, and functions.  This course includes an overview of the various tools available for writing and running Python, and gets students coding quickly.  It also provides hands-on coding exercises using commonly used data structures, writing custom functions, and reading and writing to files. This course may be more robust than some other introductory python courses, as it delves deeper into certain essential programming topics.\n\nSHOW ALL ABOUT INTRODUCTION TO PYTHON PROGRAMMING\nSHOW ALL"
    },
    {
       "Url":"/learn/data-analysis-python?specialization=programming-python-java",
       "name":"Data Analysis Using Python",
       "Rating":"Data Analysis Using Python\n4.5\nstars\n87 ratings\n•\n31 reviews\n\nThis course provides an introduction to basic data science techniques using Python.  Students are introduced to core concepts like Data Frames and joining data, and learn how to use data analysis libraries like pandas, numpy, and matplotlib.  This course provides an overview of loading, inspecting, and querying real-world data, and how to answer basic questions about that data.  Students will gain skills in data aggregation and summarization, as well as basic data visualization.\n\nSHOW ALL ABOUT DATA ANALYSIS USING PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/java-object-oriented-programming?specialization=programming-python-java",
       "name":"Introduction to Java and Object-Oriented Programming",
       "Rating":"Introduction to Java and Object-Oriented Programming\n4.1\nstars\n51 ratings\n•\n17 reviews\n\nThis course provides an introduction to the Java language and object-oriented programming, including an overview of Java syntax and how it differs from a language like Python.  Students will learn how to write custom Java classes and methods, and how to test their code using unit testing and test-driven development.  Topics include basic data structures like Arrays and ArrayLists and overloading methods.\n\nSHOW ALL ABOUT INTRODUCTION TO JAVA AND OBJECT-ORIENTED PROGRAMMING\nSHOW ALL"
    },
    {
       "Url":"/learn/java-inheritance-data-structures?specialization=programming-python-java",
       "name":"Inheritance and Data Structures in Java",
       "Rating":"Inheritance and Data Structures in Java\n4.4\nstars\n17 ratings\n•\n9 reviews\n\nThis course provides a comprehensive look at Java inheritance, including access modifiers and overriding methods.  Students are introduced to abstract classes, and will learn how to read and write to files, use regular expressions for parsing text, and how to leverage complex data structures like collections and maps.  \n\nAdditionally, this course offers strategies for catching errors and debugging code, including an overview of Eclipse’s debugging tool.\n\nSHOW ALL ABOUT INHERITANCE AND DATA STRUCTURES IN JAVA\nSHOW ALL"
    },
    "/specializations/music-production",
    {
       "Url":"/learn/producing-music?specialization=music-production",
       "name":"The Art of Music Production",
       "Rating":"The Art of Music Production\n4.8\nstars\n1,747 ratings\n•\n539 reviews\n\nExplore the art of record production and how to make recordings that other people will love listening to. This course will teach you how to make emotionally moving recordings on almost any recording equipment, including your phone or laptop. The emphasis is on mastering tangible artistic concepts; the gear you use is up to you. You will learn to develop the most important tool in the recording studio: your ears. You will learn to enhance every aspect of your own productions, both sonically and musically, by employing deeper listening skills. \n\nAssignments will include posting your own recordings for peer review, and reviewing your classmates’ work by employing specific tools and strategies. If you use a digital audio workstation to record and mix, that’s great, but as long as you can record into your computer and post an MP3, you can complete the assignments. \n\nAs you learn about the art of record production in this 4-week course, you will also learn about yourself and who you are as an artist and producer. It is not necessary that you read music or play an instrument to take this course.\n\nSHOW ALL ABOUT THE ART OF MUSIC PRODUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/technology-of-music-production?specialization=music-production",
       "name":"The Technology of Music Production",
       "Rating":"The Technology of Music Production\n4.8\nstars\n862 ratings\n•\n275 reviews\n\nLearn about the music production process—including recording, editing, and mixing—and the tools available to you to create contemporary music on your computer.\n\nWith the recent introduction of high-quality-low-cost software and hardware, the tools of music production are now available to the masses. Albums are made in bedrooms as well as studios. On the surface this is liberating. Anyone can make an album for the low cost of a couple pieces of gear and a software package. But, if you dig deeper, you will find that it is not so easy. Producing music requires knowledge, dedication, and creativity.\n    \nKnowledge is where this course comes in. No matter what kind of music you are making, there is a large set of tools that you will need to use.  Each lesson of this course will demonstrate a different set of music production tools, loosely following along the music production process of recording, editing, and mixing. \n\nWe will start with some background on the nature of sound and how we perceive it. We will then examine the components necessary to record audio into a computer, so that you understand the devices that sound must travel through in a music production process. \n    \nOnce recorded, sound must be organized along a timeline, a process known as editing. It allows us to give the impression of perfect performances and create many of the sounds we hear in contemporary music. The contemporary editing tool is the Digital Audio Workstation (DAW),  a piece of software that stores and organizes all the assets of a musical project. We will focus on the editing tools that are essential in contemporary music production and that all DAWs provide. \n\nAfter editing, sounds must be combined or mixed together, so we look to the mixing board—a very creative place if you know how to use it. We will explore the basic functionality of both hardware and software mixing boards, including volume, pan, mute, solo, busses, inserts, sends, and submixes. The mixing process, however, includes more tools than the mixing board provides on its own. Sound must also be processed, modified from its recorded state to fit the context of the music. We will look at compression, equalization, and delay, and examine the many audio effects that are offshoots of these devices and how they are used in a musical context.\n    \nIn the end, the music production process relies on your creativity. Creativity is a product of the mind and will stay there, unexpressed, until the right tools are used in the right way to share it with the world. If you have an idea in your head, it will take numerous steps, each with an important tool, to reach your audience. You bring the dedication and creativity, and this course will bring you the knowledge to make that happen.\n\nSHOW ALL ABOUT THE TECHNOLOGY OF MUSIC PRODUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/protools?specialization=music-production",
       "name":"Pro Tools Basics",
       "Rating":"Pro Tools Basics\n4.7\nstars\n528 ratings\n•\n191 reviews\n\nProducing music is an incredibly creative process, and knowing the tools of the trade is essential in order to transmit the musical ideas in your head into the DAW in a creative and uninhibited way.  Whether you have used a computer to create music before, or you have been curious about production for years, this 4-week course will give you an introductory look into the world of Avid Pro Tools and Pro Tools First.\n\nSHOW ALL ABOUT PRO TOOLS BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/music-production-capstone?specialization=music-production",
       "name":"Music Production Capstone",
       "Rating":"Music Production Capstone\n4.8\nstars\n100 ratings\n•\n38 reviews\n\nAfter successfully completing the three prior courses of the Music Production Specialization, this capstone experience is your chance to use your talent and accumulated knowledge to create and submit a finished, fully produced song. As you go through milestones, you will work on your own or with other musicians to develop a song and vision for the finished product. You will then plan and execute its production, including recording, editing, mixing, and posting the finished product. All along the way, you will receive feedback from the peer review process, allowing you to tweak and refine your finished song.\n\nSHOW ALL ABOUT MUSIC PRODUCTION CAPSTONE\nSHOW ALL"
    },
    "/specializations/construction-management",
    {
       "Url":"/learn/construction-project-management?specialization=construction-management",
       "name":"Construction Project Management",
       "Rating":"Construction Project Management\n4.8\nstars\n4,523 ratings\n•\n1,112 reviews\n\nConstruction Project Management introduces you to Project Initiation and Planning. Industry experts join Columbia University professor, Ibrahim Odeh, to give an overview of the construction industry. \n\nProfessor Odeh teaches the fundamentals of the Project Development Cycle while guest lecturers discuss Lean Project Delivery method and Lean Design Behaviors. \n\nTechnological advances, such as Building Information Modeling, will be introduced with real world examples of the uses of BIM during the Lifecycle of the Project. The course concludes with Professor Odeh discussing the importance of project planning and scheduling and an opportunity to develop a Work Breakdown Structure.\n\nSHOW ALL ABOUT CONSTRUCTION PROJECT MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/construction-scheduling?specialization=construction-management",
       "name":"Construction Scheduling",
       "Rating":"Construction Scheduling\n4.8\nstars\n1,585 ratings\n•\n300 reviews\n\nLearners will discover the key project scheduling techniques and procedures including; how to create a network diagram, how to define the importance of the critical path in a project network, and defining project activities float. Also covered are the fundamentals of Bar Charts, Precedence Diagrams, Activity on Arrow, PERT, Range Estimating, and linear project operations and the line of balance.\n\nSHOW ALL ABOUT CONSTRUCTION SCHEDULING\nSHOW ALL"
    },
    {
       "Url":"/learn/construction-cost-estimating?specialization=construction-management",
       "name":"Construction Cost Estimating and Cost Control",
       "Rating":"Construction Cost Estimating and Cost Control\n4.7\nstars\n1,451 ratings\n•\n298 reviews\n\nThis course introduces the types of cost estimation from the conceptual design phase through the more detailed design phase of a construction project. In addition, the course highlights the importance of controlling costs and how to monitor project cash flow. Students will work on a break-even analysis of construction tasks in a project.\n\nSHOW ALL ABOUT CONSTRUCTION COST ESTIMATING AND COST CONTROL\nSHOW ALL"
    },
    {
       "Url":"/learn/construction-finance?specialization=construction-management",
       "name":"Construction Finance",
       "Rating":"Construction Finance\n4.7\nstars\n831 ratings\n•\n150 reviews\n\nThe final course of the specialization expands the knowledge of a construction project manager to include an understanding of economics and the mathematics of money, an essential component of every construction project.  Topics covered include the time value of money, the definition and calculation of the types of interest rates, and the importance of Cash Flow Diagrams.\n\nSHOW ALL ABOUT CONSTRUCTION FINANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/construction-industry-forward?specialization=construction-management",
       "name":"The Construction Industry: The Way Forward",
       "Rating":"The Construction Industry: The Way Forward\n4.7\nstars\n75 ratings\n•\n10 reviews\n\nThis course provides an introduction on types of the construction projects as well as the main concern of the productivity challenge in the construction industry. Through case studies, you will learn the industry characteristics and its unique environment that led to such productivity performance as well as touch base on other several examples of challenges we are facing internally in the industry.\n\nIn the 2nd part of the course, Professor Odeh will give an overview of 10 mega trends that are making us change the way we think about construction. Furthermore, Professor Odeh will discuss the main role of three levels on what needs to be done: an industry collaborative effort and role; a government role; and last but not least a company role. In this discussion, Professor Odeh will also touch base on several technological and innovative trends that are rising in our construction industry.\n\nSHOW ALL ABOUT THE CONSTRUCTION INDUSTRY: THE WAY FORWARD\nSHOW ALL"
    },
    "/specializations/financialtechnology",
    {
       "Url":"/learn/paytech?specialization=financialtechnology",
       "name":"The Future of Payment Technologies",
       "Rating":"The Future of Payment Technologies\n4.7\nstars\n1,057 ratings\n•\n243 reviews\n\nDiscover the future of payment technology, from mobile payments to tokenization.\n\nIn this course, you will learn new ways of making payments from consumer-to-business (C2B), from consumer-to-consumer (C2C), and from business-to-business (B2B).\n\nYou will explore current payment system technologies to examine their strengths and weaknesses, and understand the ways technological innovation is changing these traditional systems.\n\nYou’ll learn about new front-end innovations like digital wallets and mobile payments and also discover back-end innovations like tokenization, mobile money, and new payment infrastructure.\n\nSHOW ALL ABOUT THE FUTURE OF PAYMENT TECHNOLOGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/crypto-finance?specialization=financialtechnology",
       "name":"Blockchain and Cryptocurrency Explained",
       "Rating":"Blockchain and Cryptocurrency Explained\n4.7\nstars\n538 ratings\n•\n118 reviews\n\nThe sudden rise in the value of Bitcoin and other cryptocurrencies, and its subsequent decline, focused the world’s attention on cryptocurrencies as a means of payment. Blockchain technology powers Bitcoin and has been hyped as the next new, transformative technology.\n\nIn this course, we first discuss the technical underpinnings of blockchain and review key concepts such as decentralization and consensus algorithms.\n\nWe then examine blockchain as an asset and review the dynamics of the cryptocurrency markets.\n\nFinally, we examine blockchain as a business solution, with a focus on understanding business cases in which blockchain does and does not make sense.\n\nSHOW ALL ABOUT BLOCKCHAIN AND CRYPTOCURRENCY EXPLAINED\nSHOW ALL"
    },
    {
       "Url":"/learn/credit-tech?specialization=financialtechnology",
       "name":"Raising Capital: Credit Tech, Coin Offerings, and Crowdfunding",
       "Rating":"Raising Capital: Credit Tech, Coin Offerings, and Crowdfunding\n4.7\nstars\n203 ratings\n•\n41 reviews\n\nConsider the benefits and challenges of disruptive capital-raising technology.\n\nAdvances in technology have both systematized and democratized consumers’ and business’ access to capital. In this course, you will explore the ways in which technology has transformed access to consumer credit and access to seed capital for business projects.\n\nYou will examine disruptive technologies in credit scoring, raising capital through tokenization, and the evolution of crowdfunding for both debt and equity financing.\n\nYou will also learn how to differentiate between crypto-based capital-raising models.\n\nSHOW ALL ABOUT RAISING CAPITAL: CREDIT TECH, COIN OFFERINGS, AND CROWDFUNDING\nSHOW ALL"
    },
    {
       "Url":"/learn/invest-tech?specialization=financialtechnology",
       "name":"Innovations in Investment Technology: Artificial Intelligence",
       "Rating":"Innovations in Investment Technology: Artificial Intelligence\n4.7\nstars\n250 ratings\n•\n41 reviews\n\nExplore the evolution of AI investing and online wealth management.\n\nInvesting and managing your wealth online has never been easier, but how does AI investing work and what are the challenges?\n\nOn this course, you’ll explore how technology has changed the way we invest money. You’ll consider the evolution of AI-driven online wealth management platforms, robo-advisors, and learn how they work and why they’re successful.\n\nMoving from human-based data-driven investing strategies to neural networks, you’ll assess the ability of artificial intelligence to make investment decisions and discover the role of AI and machine learning in making trading decisions.\n\nSHOW ALL ABOUT INNOVATIONS IN INVESTMENT TECHNOLOGY: ARTIFICIAL INTELLIGENCE\nSHOW ALL"
    },
    "/specializations/six-sigma-fundamentals",
    {
       "Url":"/learn/six-sigma-principles?specialization=six-sigma-fundamentals",
       "name":"Six Sigma Principles",
       "Rating":"Six Sigma Principles\n4.6\nstars\n5,756 ratings\n•\n1,394 reviews\n\nThis course is for you if you are looking to learn more about Six Sigma or refresh your knowledge of the basic components of Six Sigma and Lean. Six Sigma skills are widely sought by employers both nationally and internationally. These skills have been proven to help improve business processes and performance. This course will introduce you to the purpose of Six Sigma and its value to an organization. You will learn about the basic principles of Six Sigma and Lean. Your instructors will introduce you to, and have you apply, some of the tools and metrics that are critical components of Six Sigma. This course will provide you with the basic knowledge of the principles, roles, and responsibilities of Six Sigma and Lean. \n\nEvery module will include readings, videos, and a quiz to help make sure you understand the material and concepts that are studied. You will also have the opportunity to participate in discussions and peer review exercises to give you the opportunity to apply the material to your daily life.\n\nOur applied curriculum is built around the latest handbook The Certified Six Sigma Handbook (2nd edition) and students will develop /learn the fundamentals of Six Sigma. Registration includes online access to course content, projects, and resources but does not include the companion text The Certified Six Sigma Handbook (2nd edition). The companion text is not required to complete the assignments. However, the text is a recognized handbook used by professionals in the field. Also, it is a highly recommended text for those wishing to move forward in Six Sigma and eventually gain certification from professional agencies such as American Society for Quality (ASQ).\n\nSHOW ALL ABOUT SIX SIGMA PRINCIPLES \nSHOW ALL"
    },
    {
       "Url":"/learn/six-sigma-tools-define-measure?specialization=six-sigma-fundamentals",
       "name":"Six Sigma Tools for Define and Measure",
       "Rating":"Six Sigma Tools for Define and Measure\n4.6\nstars\n1,893 ratings\n•\n286 reviews\n\nThis course is for you if you are looking to learn more about Six Sigma or refresh your knowledge of the basic components of Six Sigma and Lean. Six Sigma skills are widely sought by employers both nationally and internationally. These skills have been proven to help improve business processes and performance. This course will cover the Define phase and introduce you to the Measure phase of the DMAIC (Define, Measure, Analyze, Improve, and Control) process. You will learn about Six Sigma project development and implementation, you will become familiar with project management tools, you will be introduced to statistics and understand its significance to Six Sigma, and finally you will learn about data collection and its importance to an organization.\n\nEvery module will include readings, videos, and a quiz to help make sure you understand the material and concepts that are studied. You will also have the opportunity to participate in peer review exercises to give you the opportunity to apply the material to your daily life.\n\nOur applied curriculum is built around the latest handbook The Certified Six Sigma Handbook (2nd edition) and students will develop /learn the fundamentals of Six Sigma. Registration includes online access to course content, projects, and resources but does not include the companion text The Certified Six Sigma Handbook (2nd edition). The companion text is not required to complete the assignments. However, the text is a recognized handbook used by professionals in the field. Also, it is a highly recommended text for those wishing to move forward in Six Sigma and eventually gain certification from professional agencies such as American Society for Quality (ASQ).\n\nSHOW ALL ABOUT SIX SIGMA TOOLS FOR DEFINE AND MEASURE\nSHOW ALL"
    },
    {
       "Url":"/learn/six-sigma-analyze?specialization=six-sigma-fundamentals",
       "name":"Six Sigma Tools for Analyze",
       "Rating":"Six Sigma Tools for Analyze\n4.7\nstars\n1,437 ratings\n•\n186 reviews\n\nThis course will cover the Measure phase and portions of the Analyze phase of the Six Sigma DMAIC (Define, Measure, Analyze, Improve, and Control) process. You will learn about lean tools for process analysis, failure mode and effects analysis (FMEA), measurement system analysis (MSA) and gauge repeatability and reproducibility (GR&R), and you will be introduced to basic statistics. This course will outline useful measure and analysis phase tools and will give you an overview of statistics as they are related to the Six Sigma process. \n\nThe statistics module will provide you with an overview of the concepts and you will be given multiple example problems to see how to apply these concepts. Every module will include readings, discussions, lecture videos, and quizzes to help make sure you understand the material and concepts that are studied.\n\nOur applied curriculum is built around the latest handbook The Certified Six Sigma Handbook (2nd edition) and students will develop /learn the fundamentals of Six Sigma. Registration includes online access to course content, projects, and resources but does not include the companion text The Certified Six Sigma Handbook (2nd edition). The companion text is not required to complete the assignments. However, the text is a recognized handbook used by professionals in the field. Also, it is a highly recommended text for those wishing to move forward in Six Sigma and eventually gain certification from professional agencies such as American Society for Quality (ASQ).\n\nSHOW ALL ABOUT SIX SIGMA TOOLS FOR ANALYZE\nSHOW ALL"
    },
    {
       "Url":"/learn/six-sigma-improve-control?specialization=six-sigma-fundamentals",
       "name":"Six Sigma Tools for Improve and Control",
       "Rating":"Six Sigma Tools for Improve and Control\n4.8\nstars\n879 ratings\n•\n154 reviews\n\nThis course will provide you will the tools necessary to complete the final components of the analyze phase as well as the  improve and control phases of the Six Sigma DMAIC (Define, Measure, Analyze, Improve, and Control) process. This course is the final course in the Six Sigma Yellow Belt Specialization. You will learn about relationships from data using correlation and regression as well as the different hypothesis terms in hypothesis testing. This course will provide you with tools and techniques for improvement. You will also understand the importance of a control plan, as well as its key characteristics, for maintaining process improvements. Every module will include readings, discussions, lecture videos, and quizzes to help make sure you understand the material and concepts that are studied.\n\nOur applied curriculum is built around the latest handbook The Certified Six Sigma Handbook (2nd edition) and students will develop /learn the fundamentals of Six Sigma. Registration includes online access to course content, projects, and resources but does not include the companion text The Certified Six Sigma Handbook (2nd edition). The companion text is not required to complete the assignments. However, the text is a recognized handbook used by professionals in the field. Also, it is a highly recommended text for those wishing to move forward in Six Sigma and eventually gain certification from professional agencies such as American Society for Quality (ASQ).\n\nSHOW ALL ABOUT SIX SIGMA TOOLS FOR IMPROVE AND CONTROL\nSHOW ALL"
    },
    "/specializations/discrete-mathematics",
    {
       "Url":"/learn/what-is-a-proof?specialization=discrete-mathematics",
       "name":"Mathematical Thinking in Computer Science",
       "Rating":"Mathematical Thinking in Computer Science\n4.4\nstars\n1,925 ratings\n•\n450 reviews\n\nMathematical thinking is crucial in all areas of computer science: algorithms, bioinformatics, computer graphics, data science, machine learning, etc. In this course, we will learn the most important tools used in discrete mathematics: induction, recursion, logic, invariants, examples, optimality. We will use these tools to answer typical programming questions like: How can we be certain a solution exists? Am I sure my program computes the optimal answer? Do each of these objects meet the given requirements?\n\nIn the course, we use a try-this-before-we-explain-everything approach: you will be solving many interactive (and mobile friendly) puzzles that were carefully designed to allow you to invent many of the important ideas and concepts yourself.\n\nPrerequisites: \n1. We assume only basic math (e.g., we expect you to know what is a square or how to add fractions), common sense and curiosity. \n2. Basic programming knowledge is necessary as some quizzes require programming in Python.\n\nSHOW ALL ABOUT MATHEMATICAL THINKING IN COMPUTER SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/combinatorics?specialization=discrete-mathematics",
       "name":"Combinatorics and Probability",
       "Rating":"Combinatorics and Probability\n4.6\nstars\n762 ratings\n•\n168 reviews\n\nCounting is one of the basic mathematically related tasks we encounter on a day to day basis. The main question here is the following. If we need to count something, can we do anything better than just counting all objects one by one? Do we need to create a list of all phone numbers to ensure that there are enough phone numbers for everyone? Is there a way to tell that our algorithm will run in a reasonable time before implementing and actually running it? All these questions are addressed by a mathematical field called Combinatorics.\n\nIn this course we discuss most standard combinatorial settings that can help to answer questions of this type. We will especially concentrate on developing the ability to distinguish these settings in real life and algorithmic problems. This will help the learner to actually implement new knowledge. Apart from that we will discuss recursive technique for counting that is important for algorithmic implementations.\n\nOne of the main `consumers’ of Combinatorics is Probability Theory. This area is connected with numerous sides of life, on one hand being an important concept in everyday life and on the other hand being an indispensable tool in such modern and important fields as Statistics and Machine Learning. In this course we will concentrate on providing the working knowledge of basics of probability and a good intuition in this area. The practice shows that such an intuition is not easy to develop.\n\nIn the end of the course we will create a program that successfully plays a tricky and very counterintuitive dice game.\n\nAs prerequisites we assume only basic math (e.g., we expect you to know what is a square or how to add fractions), basic programming in python (functions, loops, recursion), common sense and curiosity. Our intended audience are all people that work or plan to work in IT, starting from motivated high school students.\n\nSHOW ALL ABOUT COMBINATORICS AND PROBABILITY\nSHOW ALL"
    },
    {
       "Url":"/learn/graphs?specialization=discrete-mathematics",
       "name":"Introduction to Graph Theory",
       "Rating":"Introduction to Graph Theory\n4.5\nstars\n850 ratings\n•\n190 reviews\n\nWe invite you to a fascinating journey into Graph Theory — an area which connects the elegance of painting and the rigor of mathematics;  is simple, but not unsophisticated. Graph Theory gives us, both an easy way to pictorially represent many major mathematical results, and insights into the deep theories behind them. \n\nIn this course, among other intriguing applications, we will see how GPS systems find shortest routes, how engineers design integrated circuits, how biologists assemble genomes, why a political map can always be colored using a few colors. We will study Ramsey Theory which proves that in a large system, complete disorder is impossible! \n\nBy the end of the course, we will implement an algorithm which finds an optimal assignment of students to schools. This algorithm, developed by David Gale and Lloyd S. Shapley, was later recognized by the conferral of Nobel Prize in Economics.\n\nAs prerequisites we assume only basic math (e.g., we expect you to know what is a square or how to add fractions), basic programming in python (functions, loops, recursion), common sense and curiosity. Our intended audience are all people that work or plan to work in IT, starting from motivated high school students.\n\nSHOW ALL ABOUT INTRODUCTION TO GRAPH THEORY\nSHOW ALL"
    },
    {
       "Url":"/learn/number-theory-cryptography?specialization=discrete-mathematics",
       "name":"Number Theory and Cryptography",
       "Rating":"Number Theory and Cryptography\n4.5\nstars\n506 ratings\n•\n110 reviews\n\nWe all learn numbers from the childhood. Some of us like to count, others hate it, but any person uses numbers everyday to buy things, pay for services, estimated time and necessary resources. People have been wondering about numbers’ properties for thousands of years. And for thousands of years it was more or less just a game that was only interesting for pure mathematicians. Famous 20th century mathematician G.H. Hardy once said “The Theory of Numbers has always been regarded as one of the most obviously useless branches of Pure Mathematics”. Just 30 years after his death, an algorithm for encryption of secret messages was developed using achievements of number theory. It was called RSA after the names of its authors, and its implementation is probably the most frequently used computer program in the word nowadays. Without it, nobody would be able to make secure payments over the internet, or even log in securely to e-mail and other personal services. In this short course, we will make the whole journey from the foundation to RSA in 4 weeks. By the end, you will be able to apply the basics of the number theory to encrypt and decrypt messages, and to break the code if one applies RSA carelessly. You will even pass a cryptographic quest!\n\nAs prerequisites we assume only basic math (e.g., we expect you to know what is a square or how to add fractions), basic programming in python (functions, loops, recursion), common sense and curiosity. Our intended audience are all people that work or plan to work in IT, starting from motivated high school students.\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT NUMBER THEORY AND CRYPTOGRAPHY\nSHOW ALL"
    },
    {
       "Url":"/learn/delivery-problem?specialization=discrete-mathematics",
       "name":"Delivery Problem",
       "Rating":"Delivery Problem\n4.7\nstars\n345 ratings\n•\n46 reviews\n\nWe’ll implement (in Python) together efficient programs for a problem needed by delivery companies all over the world millions times per day — the travelling salesman problem. The goal in this problem is to visit all the given places as quickly as possible. How to find an optimal solution to this problem quickly? We still don’t have provably efficient algorithms for this difficult computational problem and this is the essence of the P versus NP problem, the most important open question in Computer Science. Still, we’ll implement several solutions for real world instances of the travelling salesman problem. While designing these solutions, we will rely heavily on the material learned in the courses of the specialization: proof techniques, combinatorics, probability, graph theory. We’ll see several examples of using discrete mathematics ideas to get more and more efficient solutions.\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT DELIVERY PROBLEM\nSHOW ALL"
    },
    "/specializations/self-driving-cars",
    {
       "Url":"/learn/intro-self-driving-cars?specialization=self-driving-cars",
       "name":"Introduction to Self-Driving Cars",
       "Rating":"Introduction to Self-Driving Cars\n4.7\nstars\n2,283 ratings\n•\n466 reviews\n\nWelcome to Introduction to Self-Driving Cars, the first course in University of Toronto’s Self-Driving Cars Specialization. \n\nThis course will introduce you to the terminology, design considerations and safety assessment of self-driving cars.  By the end of this course, you will be able to: \n- Understand commonly used hardware used for self-driving cars\n- Identify the main components of the self-driving software stack\n- Program vehicle modelling and control  \n- Analyze the safety frameworks and current industry practices for vehicle development\n\nFor the final project in this course, you will develop control code to navigate a self-driving car around a racetrack in the CARLA simulation environment. You will construct longitudinal and lateral dynamic models for a vehicle and create controllers that regulate speed and path tracking performance using Python. You’ll test the limits of your control design and learn the challenges inherent in driving at the limit of vehicle performance.\n\nThis is an advanced course, intended for learners with a background in mechanical engineering, computer and electrical engineering, or robotics. To succeed in this course, you should have programming experience in Python 3.0, familiarity with Linear Algebra (matrices, vectors, matrix multiplication, rank, Eigenvalues and vectors and inverses), Statistics (Gaussian probability distributions), Calculus and Physics (forces, moments, inertia, Newton's Laws).\n\nYou will also need certain hardware and software specifications in order to effectively run the CARLA simulator: Windows 7 64-bit (or later) or Ubuntu 16.04 (or later), Quad-core Intel or AMD processor (2.5 GHz or faster), NVIDIA GeForce 470 GTX or AMD Radeon 6870 HD series card or higher, 8 GB RAM, and OpenGL 3 or greater (for Linux computers).\n\nSHOW ALL ABOUT INTRODUCTION TO SELF-DRIVING CARS\nSHOW ALL"
    },
    {
       "Url":"/learn/state-estimation-localization-self-driving-cars?specialization=self-driving-cars",
       "name":"State Estimation and Localization for Self-Driving Cars",
       "Rating":"State Estimation and Localization for Self-Driving Cars\n4.7\nstars\n691 ratings\n•\n112 reviews\n\nWelcome to State Estimation and Localization for Self-Driving Cars, the second course in University of Toronto’s Self-Driving Cars Specialization. We recommend you take the first course in the Specialization prior to taking this course. \n\nThis course will introduce you to the different sensors and how we can use them for state estimation and localization in a self-driving car. By the end of this course, you will be able to:\n- Understand the key methods for parameter and state estimation used for autonomous driving, such as the method of least-squares\n- Develop a model for typical vehicle localization sensors, including GPS and IMUs\n- Apply extended and unscented Kalman Filters to a vehicle state estimation problem\n- Understand LIDAR scan matching and the Iterative Closest Point algorithm \n- Apply these tools to fuse multiple sensor streams into a single state estimate for a self-driving car \n\nFor the final project in this course, you will implement the Error-State Extended Kalman Filter (ES-EKF) to localize a vehicle using data from the CARLA simulator. \n\nThis is an advanced course, intended for learners with a background in mechanical engineering, computer and electrical engineering, or robotics. To succeed in this course, you should have programming experience in Python 3.0, familiarity with Linear Algebra (matrices, vectors, matrix multiplication, rank, Eigenvalues and vectors and inverses), Statistics (Gaussian probability distributions), Calculus and Physics (forces, moments, inertia, Newton's Laws).\n\nSHOW ALL ABOUT STATE ESTIMATION AND LOCALIZATION FOR SELF-DRIVING CARS\nSHOW ALL"
    },
    {
       "Url":"/learn/visual-perception-self-driving-cars?specialization=self-driving-cars",
       "name":"Visual Perception for Self-Driving Cars",
       "Rating":"Visual Perception for Self-Driving Cars\n4.7\nstars\n463 ratings\n•\n62 reviews\n\nWelcome to Visual Perception for Self-Driving Cars, the third course in University of Toronto’s Self-Driving Cars Specialization.\n\nThis course will introduce you to the main perception tasks in autonomous driving, static and dynamic object detection, and will survey common computer vision methods for robotic perception.  By the end of this course, you will be able to work with the pinhole camera model, perform intrinsic and extrinsic camera calibration, detect, describe and match image features and design your own convolutional neural networks.  You'll apply these methods to visual odometry, object detection and tracking, and semantic segmentation for drivable surface estimation. These techniques represent the main building blocks of the perception system for self-driving cars.\n\nFor the final project in this course, you will develop algorithms that identify bounding boxes for objects in the scene, and define the boundaries of the drivable surface.  You'll work with synthetic and real image data, and evaluate your performance on a realistic dataset.\n\nThis is an advanced course, intended for learners with a background in computer vision and deep learning. To succeed in this course, you should have programming experience in Python 3.0, and familiarity with Linear Algebra (matrices, vectors, matrix multiplication, rank, Eigenvalues and vectors and inverses).\n\nSHOW ALL ABOUT VISUAL PERCEPTION FOR SELF-DRIVING CARS\nSHOW ALL"
    },
    {
       "Url":"/learn/motion-planning-self-driving-cars?specialization=self-driving-cars",
       "name":"Motion Planning for Self-Driving Cars",
       "Rating":"Motion Planning for Self-Driving Cars\n4.8\nstars\n377 ratings\n•\n71 reviews\n\nWelcome to Motion Planning for Self-Driving Cars, the fourth course in University of Toronto’s Self-Driving Cars Specialization.\n\nThis course will introduce you to the main planning tasks in autonomous driving, including mission planning, behavior planning and local planning.   By the end of this course, you will be able to find the shortest path over a graph or road network using Dijkstra's and the A* algorithm, use finite state machines to select safe behaviors to execute, and design optimal, smooth paths and velocity profiles to navigate safely around obstacles while obeying traffic laws.  You'll also build occupancy grid maps of static elements in the environment and learn how to use them for efficient collision checking. This course will give you the ability to construct a full self-driving planning solution, to take you from home to work while behaving like a typical driving and keeping the vehicle safe at all times.\n\nFor the final project in this course, you will implement a hierarchical motion planner to navigate through a sequence of scenarios in the CARLA simulator, including avoiding a vehicle parked in your lane, following a lead vehicle and safely navigating an intersection.  You'll face real-world randomness and need to work to ensure your solution is robust to changes in the environment.\n\nThis is an intermediate course, intended for learners with some background in robotics, and it builds on the models and controllers devised in Course 1 of this specialization. To succeed in this course, you should have programming experience in Python 3.0, and familiarity with Linear Algebra (matrices, vectors, matrix multiplication, rank, Eigenvalues and vectors and inverses) and calculus (ordinary differential equations, integration).\n\nSHOW ALL ABOUT MOTION PLANNING FOR SELF-DRIVING CARS\nSHOW ALL"
    },
    "/specializations/project-management-success",
    {
       "Url":"/learn/project-planning?specialization=project-management-success",
       "name":"Initiating and Planning Projects",
       "Rating":"Initiating and Planning Projects\n4.7\nstars\n19,946 ratings\n•\n3,792 reviews\n\nThe courses in the Introduction to Project Management Principles and Practices Specialization are a recommended precursor to UCI's Applied Project Management Certificate. \n\nSuccessful projects require careful upfront planning. In this course, you’ll learn the key roles and responsibilities of the project manager and project team. You’ll also learn to answer some key questions upfront to help you meet project objectives: What will this project accomplish? Why is this project important? Who benefits from this project? How will we plan for successful outcomes?\n\nUpon completing this course, you will be able to:\n1.       Identify the key characteristics of a project\n2.       Identify primary project constraints\n3.       Define the role and responsibilities of the project manager\n4.       Identify Project Organizational Structures\n5.       Understand the definition of a Project Stakeholder\n6.       Identify project stakeholders\n7.       Identify information needs of the project stakeholders\n8.       Define responsibility for managing stakeholder and controlling stakeholder engagement\n9.       Define the purpose of using a project charter\n10.     Summarize the key elements of a project plan\n11.     Identify common sources of conflict within a project environment\n12.     Describe the difference between authority and influence\n\nSHOW ALL ABOUT INITIATING AND PLANNING PROJECTS\nSHOW ALL"
    },
    {
       "Url":"/learn/project-risk-management?specialization=project-management-success",
       "name":"Managing Project Risks and Changes",
       "Rating":"Managing Project Risks and Changes\n4.7\nstars\n8,099 ratings\n•\n1,051 reviews\n\nThis course will help you manage project risk effectively by identifying, analyzing, and communicating inevitable changes to project scope and objectives. You will understand and practice the elements needed to measure and report on project scope, schedule, and cost performance. You will be equipped with the tools to manage change in the least disruptive way possible for your team and other project stakeholders.\n\nUpon completing this course, you will be able to:\n1.       Define components of a communications management plan\n2.       Understand the importance of communications channels\n3.       Define the key elements needed to measure and report on project scope, schedule, and cost performance\n4.       Identify project risk events\n5.       Prioritize identified risks\n6.       Develop responses for a high priority risk\n7.       Identify and analyze changes to project scope\n8.       Describe causes and effects of project changes\n9.       Define the purpose of conducting a lessons learned session\n\nSHOW ALL ABOUT MANAGING PROJECT RISKS AND CHANGES\nSHOW ALL"
    },
    {
       "Url":"/learn/business-writing?specialization=project-management-success",
       "name":"High-Impact Business Writing",
       "Rating":"High-Impact Business Writing\n4.5\nstars\n3,289 ratings\n•\n587 reviews\n\nEffective writing is a powerful tool in the business environment. Learn how to articulate your thoughts in a clear and concise manner that will allow your ideas to be better understood by your readers. Improve your business writing skill by learning to select and use appropriate formats for your audience, use the correct medium and adjust your writing style accordingly, as well as identify your objective and communicate it clearly. You'll also learn to spot, correct and avoid the most common writing pitfalls, and gain valuable experience analyzing, writing and revising a wide spectrum of business documents. From a simple interoffice memo to a twenty-page business proposal, learn how to put good business writing to work for you.\n\nUpon completing this course, you will be able to:\n1.       Write effective business communications, including bad news, good news, persuasive writing, presentations, emails, memos, business reports and press releases\n2.       Learn how to edit and proofread business documents\n3.       Learn how to write for a global market\n\nSHOW ALL ABOUT HIGH-IMPACT BUSINESS WRITING\nSHOW ALL"
    },
    {
       "Url":"/learn/art-of-negotiation?specialization=project-management-success",
       "name":"The Art of Negotiation",
       "Rating":"The Art of Negotiation\n4.5\nstars\n2,645 ratings\n•\n429 reviews\n\nThe art of negotiation comes into play daily in the life of employees at all levels and in every position. Participants explore how current approaches to negotiation strategy and tactics are used, what negotiation entails, types of negotiation relationships that exist from hard bargain to win-win, to fully partnered relationships and personal ones. The course explores the personal and behavioral characteristics of an effective negotiator. Participants discuss how empowerment, power, and authority affect the negotiation process and outcome. Topics include how important it is to plan and prepare for a negotiation session.\n\nUpon completing this course, you will be able to:\n1.       Learn about the nature of negotiation and how it differs from selling\n2.       Gain awareness of the basic doctrines of negotiation and barriers to effective negotiation\n3.       Explain the role of authority and how to address it in negotiations\n4.       Explain the role of power in negotiations and how to address power inequities\n5.       Explain the positive and negative influences of empowerment\n6.       Learn the different “stances” or negotiation styles negotiators might adopt\n7.       Demonstrate the factors that influence which negotiation style is implemented\n8.       Describe the personal and behavioral characteristics of an effective negotiator\n9.       Demonstrate your grasp of emotional intelligence and how it impacts the effectiveness of a negotiator\n10.     Assess your own values and personal style and how they affect the negotiation process\n11.     Learn about the critical importance of planning and preparation in the negotiation process\n\nSHOW ALL ABOUT THE ART OF NEGOTIATION\nSHOW ALL"
    },
    {
       "Url":"/learn/problem-solving?specialization=project-management-success",
       "name":"Effective Problem-Solving and Decision-Making",
       "Rating":"Effective Problem-Solving and Decision-Making\n4.5\nstars\n4,749 ratings\n•\n796 reviews\n\nCritical thinking – the application of scientific methods and logical reasoning to problems and decisions – is the foundation of effective problem solving and decision making. Critical thinking enables us to avoid common obstacles, test our beliefs and assumptions, and correct distortions in our thought processes. Gain confidence in assessing problems accurately, evaluating alternative solutions, and anticipating likely risks. Learn how to use analysis, synthesis, and positive inquiry to address individual and organizational problems and develop the critical thinking skills needed in today’s turbulent times. Using case studies and situations encountered by class members, explore successful models and proven methods that are readily transferable on-the-job.\n\nUpon completing this course, you will be able to:\n1.       Choose and apply appropriate problem solving and decision making processes and methods\n2.       Identify common obstacles to effective problem solving and decision making\n3.       Recognize the human variable in problem solving and decision making\n4.       Assess major conceptual blocks and significant situational challenges\n5.       Apply concepts to enhancing personal development and organizational performance\n6.       Explain the key elements of problem solving and decision making and the barriers associated with them\n\nSHOW ALL ABOUT EFFECTIVE PROBLEM-SOLVING AND DECISION-MAKING\nSHOW ALL"
    },
    "/specializations/web-design",
    {
       "Url":"/learn/html?specialization=web-design",
       "name":"Introduction to HTML5",
       "Rating":"Introduction to HTML5\n4.7\nstars\n24,312 ratings\n•\n6,511 reviews\n\nThanks to a growing number of software programs, it seems as if anyone can make a webpage. But what if you actually want to understand how the page was created? There are great textbooks and online resources for learning web design, but most of those resources require some background knowledge. This course is designed to help the novice who wants to gain confidence and knowledge. We will explore the theory (what actually happens when you click on a link on a webpage?), the practical (what do I need to know to make my own page?), and the overlooked (I have a page, what do I do now?). Throughout the course there will be a strong emphasis on adhering to syntactic standards for validation and semantic standards to promote wide accessibility for users with disabilities.  The textbook we use is available online, “The Missing Link: An Introduction to Web Development and Programming” by Michael Mendez from www.opensuny.org. \n\nThis course will appeal to a wide variety of people, but specifically those who would like a step-by-step description of the basics. There are no prerequisites for this course and it is assumed that students have no prior programming skills or IT experience. The course will culminate in a small final project that will require the completion of a very simple page with links and images. The focus of this course is on the basics, not appearance. You can see a sample final page at http://intro-webdesign.com/html5-plain.html.  \n\nThis is the first course in the Web Design For Everybody specialization. Subsequent courses focus on the marketable skills of styling the page with CSS3, adding interactivity with JavaScript and enhancing the styling with responsive design. You can see a sample site for the capstone course at http://intro-webdesign.com/\n\nSHOW ALL ABOUT INTRODUCTION TO HTML5\nSHOW ALL"
    },
    {
       "Url":"/learn/introcss?specialization=web-design",
       "name":"Introduction to CSS3",
       "Rating":"Introduction to CSS3\n4.8\nstars\n8,581 ratings\n•\n1,763 reviews\n\nThe web today is almost unrecognizable from the early days of white pages with lists of blue links.  Now, sites are designed with complex layouts, unique fonts, and customized color schemes.   This course will show you the basics of Cascading Style Sheets (CSS3).  The emphasis will be on learning how to write CSS rules, how to test code, and how to establish good programming habits.     \n\nWhen done correctly, the styling of a webpage can take enhance your page.   When done incorrectly the result can be worse than no styling at all.    To ensure that your sites do not put up  barriers for people with cognitive and/or physical disabilities, you will learn how to evaluate pages using the standardized POUR accessibility guidelines.    Upon completion of the course, learners will be able to sketch a design for a given HTML page.  Using that design they will use CSS to implement the design by adding fonts, colors, and  layouts.    \n\nThis is the second course in the Web Design For Everybody specialization.   Subsequent courses focus on adding interaction with JavaScript and enhancing the styling with responsive design.\n\nIt will be difficult to complete this course if you do not have access to a laptop or desktop computer for the homework.\n\nSHOW ALL ABOUT INTRODUCTION TO CSS3\nSHOW ALL"
    },
    {
       "Url":"/learn/javascript?specialization=web-design",
       "name":"Interactivity with JavaScript",
       "Rating":"Interactivity with JavaScript\n4.7\nstars\n6,569 ratings\n•\n1,342 reviews\n\nIf you want to take your website to the next level, the ability to incorporate interactivity is a must.    But adding some of these types of capabilities requires a stronger programming language than HTML5 or CSS3, and JavaScript can provide just what you need.  With just a basic understanding of the language, you can create a page that will react to common events such as page loads, mouse clicks & movements, and even keyboard input.      \n\nThis course will introduce you to the basics of the JavaScript language.  We will cover concepts such as variables, looping, functions, and even a little bit about debugging tools.  You will understand how the Document Object Model (DOM) is used by JavaScript to identify and modify specific parts of your page.  After the course, learners will be able to react to DOM Events and dynamically alter the contents and style of their page.   The class will culminate in a  final project - the creation of an interactive HTML5 form that accepts and verifies input.\n\nThis is the third course in the Web Design For Everybody specialization.  A basic understanding of HTML and CSS is expected when you enroll in this class.    Additional courses focus on enhancing the styling with responsive design and completing a capstone project.\n\nSHOW ALL ABOUT INTERACTIVITY WITH JAVASCRIPT\nSHOW ALL"
    },
    {
       "Url":"/learn/responsivedesign?specialization=web-design",
       "name":"Advanced Styling with Responsive Design",
       "Rating":"Advanced Styling with Responsive Design\n4.7\nstars\n4,017 ratings\n•\n737 reviews\n\nIt used to be the case that everyone viewed webpages on about the same size screen.  But with the explosion of the use of smartphones to access the Internet, the landscape of design has completely changed.  People viewing your site will now expect that it will perform regardless of the platform (smartphone, tablet, laptop, or desktop computer).  This ability to respond to any platform is called responsive design.\n\nThis course will expand upon the basic knowledge of CSS3 to include topics such as wireframes, fluid design, media queries, and the use of existing styling paradigms such as Bootstrap.  After the course, learners will be able to:\n** Explain the mobile-first paradigm and the importance of wireframes in the design phase\n** Create sites that behave across a range of platforms\n** Utilize existing design frameworks such as Bootstrap\n\nThis is the fourth course in the Web Design For Everybody specialization.  A basic understanding of HTML and CSS is expected when you enroll in this class. Additional courses focus on adding interactivity with the JavaScript Programming Language and completing a capstone project.\n\nSHOW ALL ABOUT ADVANCED STYLING WITH RESPONSIVE DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/web-design-project?specialization=web-design",
       "name":"Web Design for Everybody Capstone",
       "Rating":"Web Design for Everybody Capstone\n4.8\nstars\n1,305 ratings\n•\n331 reviews\n\nThe capstone will develop a professional-quality web portfolio.  Students will demonstrate the ability to design and implement a responsive site for a minimum of three platforms.  Adherence to validation and accessibility standards will be required. The evolving student implementations will be reviewed each week by capstone peers and teaching assistants to make sure that the student keeps up with the agenda of the course. \n\nUpon completion of this course students will feel comfortable creating and/or updating existing front-end sites, utilizing existing frameworks, and testing sites for accessibility compliance.\n\nThis course is only open to students who have completed the first four courses in the Web Design for Everybody specialization: Introduction to HTML5, Introduction to CSS3, Interactivity with JavaScript, and Advanced Styling with Responsive Design.\n\nSHOW ALL ABOUT WEB DESIGN FOR EVERYBODY CAPSTONE\nSHOW ALL"
    },
    "/specializations/foundations-management",
    {
       "Url":"/learn/financial-accounting?specialization=foundations-management",
       "name":"Accounting: Principles of Financial Accounting",
       "Rating":"Accounting: Principles of Financial Accounting\n4.8\nstars\n2,460 ratings\n•\n711 reviews\n\nFinancial Accounting is often called the language of business; it is the language that managers use to communicate the firm's financial and economic information to external parties such as shareholders and creditors. Nobody working in business can afford financial illiteracy. Whether you run your own business, work as a manager or are just starting your career, you want to understand financial information and be able to interact with accountants, controllers, and financial managers. You want to talk business! \n\nThis course will provide you with the accounting language's essentials. Upon completion, you should be able to read and interpret financial statements for business diagnosis and decision-making. More importantly, you will possess the conceptual base to keep learning more sophisticated accounting and finance on your own. Do not forget that, as with any other language, becoming proficient with accounting requires constant practice.\n\nSHOW ALL ABOUT ACCOUNTING: PRINCIPLES OF FINANCIAL ACCOUNTING\nSHOW ALL"
    },
    {
       "Url":"/learn/operational-finance?specialization=foundations-management",
       "name":"Finance for Managers",
       "Rating":"Finance for Managers\n4.8\nstars\n746 ratings\n•\n233 reviews\n\nWhen it comes to numbers, there is always more than meets the eye.  In operational finance, you will learn how to read the “story” that the balance sheet and income statement tells about the company’s operations. The insights you gain from this “financial story” will then become a tool for short-term decision-making at the top management level relating to current assets, current liabilities and the management of working capital. Finally, by the end of the course you will understand the financial consequences of managerial decisions on operations, marketing, etc.\n\nSHOW ALL ABOUT FINANCE FOR MANAGERS\nSHOW ALL"
    },
    {
       "Url":"/learn/marketing-customers?specialization=foundations-management",
       "name":"Marketing: Customer Needs and Wants",
       "Rating":"Marketing: Customer Needs and Wants\n4.4\nstars\n359 ratings\n•\n84 reviews\n\nUnderstanding who your customers are and what they need and want is at the heart of successful marketing strategies. In this course you will explore how to identify and classify customers and the different methods that marketing professionals use to shed light on how they make purchase decisions.\n\nThe course will cover the following:\n1. Marketing Fundamentals\n2. Product, Pricing and Channel Decisions \n3. Building Strong Brands \n4. Communication Strategy\n\nSHOW ALL ABOUT MARKETING: CUSTOMER NEEDS AND WANTS\nSHOW ALL"
    },
    {
       "Url":"/learn/managing-people-iese?specialization=foundations-management",
       "name":"Organizational Behavior: How to Manage People",
       "Rating":"Organizational Behavior: How to Manage People\n4.7\nstars\n856 ratings\n•\n197 reviews\n\nPeter Drucker, a pioneer in the field of management, once said that people have a perverse tendency to behave like human beings. Of course, we are not machines, and certainly not programmable. But through the study of organizational behavior, we can gain insights into what makes people tick within a work context. Increasing your understanding of your own behavior and that of your colleagues, teams and leaders, is an important first step to bringing positive change to how you and your organization work.\n\nThe objective of this course is therefore to provide insight into four key areas:\n •\tMotivation. In this course segment we will understand the concept of motivation and review various perspectives that will help you understand how we can motivate others. \n•\tLeadership. In this part of the course, we will analyze the concept of leadership and consider various perspectives and approaches to help shed light on leadership emergence and effectiveness.\n•\tTeamwork. Here we look at team functioning and effectiveness. Using the widely used input – process – output model of team effectiveness, we consider such topics as team diversity, team processes, and team outcomes.\n•\tCulture. Finally, we'll move to the level of the organization and consider the concept of organizational culture, also touching upon the concept of national culture. We look at the various ways in which culture is expressed, and discuss the implications of culture for people within organizations and cross-cultural collaborations.\n\nSHOW ALL ABOUT ORGANIZATIONAL BEHAVIOR: HOW TO MANAGE PEOPLE\nSHOW ALL"
    },
    {
       "Url":"/learn/analysis-business-problem-iese?specialization=foundations-management",
       "name":"Analysis of Business Problems",
       "Rating":"Analysis of Business Problems\n4.7\nstars\n127 ratings\n•\n30 reviews\n\nWhen does an opportunity to increase the bottom line become a liability for long-term brand sustainability and profitability? That is the question that GAS GAS, an off-road motorcycle manufacturer, is confronting. \n\nIn this culminating course, it’s time to use the business tools you have learned throughout the specialization to solve this real business problem. To help you as you develop a solution to the GAS GAS dilemma, in the Capstone you will also learn a six-step analysis of business problems methodology. By the end of the course, you will understand how to weave together considerations from accounting, finance, marketing and organizational behavior in order to arrive at a sound decision that will positively impact the firm’s future.\n\nSHOW ALL ABOUT ANALYSIS OF BUSINESS PROBLEMS\nSHOW ALL"
    },
    "/specializations/music-education",
    {
       "Url":"/learn/teaching-popular-music?specialization=music-education",
       "name":"Teaching Popular Music in the Classroom",
       "Rating":"Teaching Popular Music in the Classroom\n4.7\nstars\n63 ratings\n•\n26 reviews\n\nTeaching Popular Music in the Classroom explores approaches to teaching popular music from culturally rich communities in the United States. Students in the course will learn teaching methods that engage youth with the basics of improvisation, technology, songwriting, arranging film score, and writing to the strengths of small bands. The course models how to integrate principles of authentic cultural relevance and positive youth development with contemporary music instruction, while providing tools for assessing and documenting learning and program progress.  \n\nStudents in the course will refine their own pedagogical skills, applying principles of contemporary music instruction. Content and approaches are intended for secondary music programs, but can be adapted for elementary grade levels. All lessons are based in core standards for music education with recommendations for assessments.\n\nSHOW ALL ABOUT TEACHING POPULAR MUSIC IN THE CLASSROOM\nSHOW ALL"
    },
    {
       "Url":"/learn/jazz-improvisation?specialization=music-education",
       "name":"Jazz Improvisation",
       "Rating":"Jazz Improvisation\n4.8\nstars\n757 ratings\n•\n264 reviews\n\nLearn the basic concepts of improvisation from Gary Burton, one of the most renowned improvisers in the jazz world, including the mental, melodic, and harmonic processes that contribute to the instinctive skills that an improviser puts to use when taking a solo.\n\nWhile many people are fans of jazz and understand that musicians are often “making up” the notes they are playing during a performance, most people—often including musicians, themselves, who are beginning to learn improvising—aren’t clear about what exact processes take place to enable this to happen. The purpose of this course is to introduce the basic concepts of modern improvisation and how to go about mastering the different musical and mental skills involved. \n\nCourse author Gary Burton codifies a sought-after approach to improvisation that has been at the core of Berklee College of Music's curriculum for decades. Students who complete this course will know what to practice and how to practice the various aspects of improvising, in addition to understanding how the improviser spontaneously communicates to the listeners through their musical creations.\n\nSHOW ALL ABOUT JAZZ IMPROVISATION\nSHOW ALL"
    },
    {
       "Url":"/learn/arranging-for-songwriters?specialization=music-education",
       "name":"Arranging for Songwriters",
       "Rating":"Arranging for Songwriters\n4.4\nstars\n53 ratings\n•\n24 reviews\n\nYou've created a song. You wrote the lyrics, decided on the melody, and maybe even recorded a simple demo. Now what? If you have a basic knowledge of how to use a digital audio workstation (DAW) and are passionate about being a songwriter, this course will help you take your song from a simple recording on your phone to a fully arranged song ready for the recording studio.\n\nYou will be learning from two Berklee College of Music Songwriting professors, Bonnie Hayes and Sarah Brindell. They will show you how to arrange original songs in a digital audio workstation. You will learn tools to heighten the emotional response of your listeners and you'll broaden your understanding of instrumentation and how to add sounds to your song without distracting the listener from the most important aspect: the vocalist.\n\nSHOW ALL ABOUT ARRANGING FOR SONGWRITERS\nSHOW ALL"
    },
    {
       "Url":"/learn/producing-music?specialization=music-education",
       "name":"The Art of Music Production",
       "Rating":"The Art of Music Production\n4.8\nstars\n1,747 ratings\n•\n539 reviews\n\nExplore the art of record production and how to make recordings that other people will love listening to. This course will teach you how to make emotionally moving recordings on almost any recording equipment, including your phone or laptop. The emphasis is on mastering tangible artistic concepts; the gear you use is up to you. You will learn to develop the most important tool in the recording studio: your ears. You will learn to enhance every aspect of your own productions, both sonically and musically, by employing deeper listening skills. \n\nAssignments will include posting your own recordings for peer review, and reviewing your classmates’ work by employing specific tools and strategies. If you use a digital audio workstation to record and mix, that’s great, but as long as you can record into your computer and post an MP3, you can complete the assignments. \n\nAs you learn about the art of record production in this 4-week course, you will also learn about yourself and who you are as an artist and producer. It is not necessary that you read music or play an instrument to take this course.\n\nSHOW ALL ABOUT THE ART OF MUSIC PRODUCTION\nSHOW ALL"
    },
    "/specializations/singer-songwriter",
    {
       "Url":"/learn/guitar?specialization=singer-songwriter",
       "name":"Guitar for Beginners",
       "Rating":"Guitar for Beginners\n4.8\nstars\n2,119 ratings\n•\n612 reviews\n\nGrasp the essentials needed to begin playing acoustic or electric guitar. You'll learn an easy approach to get you playing quickly, through a combination of exploring the instrument, performance technique, and basic music theory.\n\nFor students who have long thought about picking up the acoustic or electric guitar, this course will provide an easy-access foundation that will get you playing. When first learning guitar, it is important to have the material presented in stages, in an enjoyable way that allows you to grasp the basics of the instrument and music. The course begins simply with the parts of the guitar, the names of the strings, tuning, and technique—whether finger-style or pick. It then explores the basics of music theory with such topics as scales, triads, power chords, and fingering and shapes.\n\nAt the end of this course, students will understand the structure, parts, and accessories of the instrument, in addition to an understanding of its basic maintenance. Electric guitar players will learn the operation of their instrument along with basic options for amplification, effect pedals, and sounds. Students will also learn to develop correct technique and apply theory concepts to their playing. They will have the foundational knowledge necessary to pursue most intermediate guitar courses.\n\nSHOW ALL ABOUT GUITAR FOR BEGINNERS\nSHOW ALL"
    },
    {
       "Url":"/learn/singing-popular-music?specialization=singer-songwriter",
       "name":"Singing Popular Music",
       "Rating":"Singing Popular Music\n4.6\nstars\n115 ratings\n•\n42 reviews\n\nYou've been studying the greats, working on improving your vocal skills, and building vocal technique. Now it's time to take the next step in your singing career to shine as a vocalist. Singing Popular Music provides you with the essential skills to define your own unique vocal style and sing healthfully. The course begins with devices to support and alter your sound including vowel quality, tone production, and breathing techniques. From there, you will learn how to use techniques like mix voice and belting in contemporary singing styles. Then you'll take a cover song and make it your own. Upon successful completion of this course, you will be able to confidently and healthfully sing in your desired vocal style as well as understand how you can alter your singing to match other contemporary styles.\n\nSHOW ALL ABOUT SINGING POPULAR MUSIC\nSHOW ALL"
    },
    {
       "Url":"/learn/songwriting-lyrics?specialization=singer-songwriter",
       "name":"Songwriting: Writing the Lyrics",
       "Rating":"Songwriting: Writing the Lyrics\n4.8\nstars\n712 ratings\n•\n235 reviews\n\nThere’s a songwriter lurking somewhere inside you, peeking around corners, wondering if it’s safe to come out. Now it is. This course is an invitation to let your inner songwriter step into the sunlight. All it takes is a simple “yes” and you’ll be climbing that windy hill, marveling at the view.\n\nIf you haven’t written any or many songs, this course will show you an efficient, effective process for tailoring songs to express your ideas and emotions. If you have, you’ll look at your process differently, taking control of aspects of the process you may have not noticed.\n\nThe course will start by examining the tools available to you, all revolving around the essential concept of prosody. You’ll learn to use your tools to enhance your message—to work compositionally at the same time you’re developing your ideas.\n\nYou’ll be working both lyrically and musically, though musically it’s not necessary that you either read music or play an instrument. If you play, great, and you’ll be encouraged to play and record your musical responses to the assignments. If you don’t play, the course offers you a number of musical loops to work with. All you’ll have to do is sing your melodies over the loops.\n\nAssignments will ask you to post something for peer review—sometimes lyric lines or sections, sometimes melodies, sometimes both. None of it has to be polished. The course is about writing, not performing.\n\nMost important, you’ll have a lot of fun.\n\nSHOW ALL ABOUT SONGWRITING: WRITING THE LYRICS\nSHOW ALL"
    },
    {
       "Url":"/learn/ableton-live?specialization=singer-songwriter",
       "name":"Introduction to Ableton Live",
       "Rating":"Introduction to Ableton Live\n4.8\nstars\n1,046 ratings\n•\n327 reviews\n\nThe new version of Introduction to Ableton Live featuring Ableton Live 10 will launch on April 20!\n\nIn the past, Digital Audio Workstations (DAWs) were programs used only by audio engineers with a highly specific knowledge base, on machines inaccessible to most people. But over the past 10-15 years, DAWs and the act of recording music have evolved from being a luxury of the few to being available to the masses. Ableton Live is one such application. Used by an extremely broad range of music creators, Ableton Live not only facilitates the work of engineers, producers, and writers in professional, home, and mobile studio settings, but it is also a powerful platform for musicians on stage, in the DJ booth, and elsewhere.\n\nIn this Ableton Certified Training Center course developed by Berklee Online, you will explore some of Live’s most powerful and useful functionality: MIDI programming, audio recording, warping and processing, looping editing, mixing, performing, file management, and troubleshooting. Meant to be a springboard for those who are new to Ableton Live and/or DAWs in general, this three-week course will provide you with a strong knowledge base for using Live to take your musical ideas from conception to final recording. The course breaks down the many barriers of entry into music technology and encourages all those who wish, to create fearlessly.\n\nNote: If you do not own Ableton Live 10, you can download the free, fully featured Ableton Live Trial. The trial version will allow you to save and export your work for 30 days. If you use the trial version, do not download it until the course is scheduled to begin.\n\nSHOW ALL ABOUT INTRODUCTION TO ABLETON LIVE\nSHOW ALL"
    },
    "/specializations/creative-writing",
    {
       "Url":"/learn/craft-of-plot?specialization=creative-writing",
       "name":"Creative Writing: The Craft of Plot",
       "Rating":"Creative Writing: The Craft of Plot\n4.7\nstars\n3,986 ratings\n•\n1,341 reviews\n\nIn this course aspiring writers will be introduced to perhaps the most elemental and often the most challenging element of story: plot.  We will learn what keeps it moving, how it manipulates our feelings, expectations, and desires.  We will examine the choices storytellers make to snag our imaginations, drag them into a fictional world, and keep them there. We will learn how to outline and structure a plot, discuss narrative arc, pacing and reversals and reveal the inevitable surprise: connecting the beginning, middle and end.\n\nSHOW ALL ABOUT CREATIVE WRITING: THE CRAFT OF PLOT\nSHOW ALL"
    },
    {
       "Url":"/learn/craft-of-character?specialization=creative-writing",
       "name":"Creative Writing: The Craft of Character",
       "Rating":"Creative Writing: The Craft of Character\n4.5\nstars\n1,664 ratings\n•\n481 reviews\n\nAt the center of a good story are the characters in it. In this course aspiring writers will discover how to build and bring to life complex, vivid and unforgettable characters. We will study the choices a writer makes to bring all characters to life on the page, and we will perform written exercises in order to develop a variety of writing and pre-writing techniques, in order to create a variety of characters. We will learn how to use our own life experiences, and the people we know (and how not to!). We will develop inner (thoughts and feelings) and outer (appearance, habits, behavior) lives for our characters and see how that can lead us to richer and more interesting stories. We will breathe life into our characters and let them surprise us.\n\nSHOW ALL ABOUT CREATIVE WRITING: THE CRAFT OF CHARACTER\nSHOW ALL"
    },
    {
       "Url":"/learn/craft-of-setting-and-description?specialization=creative-writing",
       "name":"Creative Writing: The Craft of Setting and Description",
       "Rating":"Creative Writing: The Craft of Setting and Description\n4.7\nstars\n1,195 ratings\n•\n379 reviews\n\nIn this course aspiring writers will be introduced to the techniques that masters of fiction use to ground a story in a concrete world.  From the most realist settings to the most fantastical, writers will learn how to describe the physical world in sharp, sensory detail.  We will also learn how to build credibility through research, and to use creative meditation exercises to deepen our own understanding of our story worlds, so that our readers can see all that we imagine.\n\nSHOW ALL ABOUT CREATIVE WRITING: THE CRAFT OF SETTING AND DESCRIPTION\nSHOW ALL"
    },
    {
       "Url":"/learn/craft-of-style?specialization=creative-writing",
       "name":"Creative Writing: The Craft of Style",
       "Rating":"Creative Writing: The Craft of Style\n4.7\nstars\n1,004 ratings\n•\n285 reviews\n\nYour style is as unique and distinctive as your face, your voice, except that you can choose it, you can can work on it, enhance it. In this course we will introduce aspiring writers to the art of putting pressure on written language.  We will study the use of metaphor and imagery, and demonstrate how clarity, grace, and inventiveness in word choice are imperative to a story’s success.  Writers will emerge with the revision skills essential to all writers of good stories and good prose.\n\nSHOW ALL ABOUT CREATIVE WRITING: THE CRAFT OF STYLE\nSHOW ALL"
    },
    {
       "Url":"/learn/story-writing-project?specialization=creative-writing",
       "name":"Capstone: Your Story",
       "Rating":"Capstone: Your Story\n4.6\nstars\n325 ratings\n•\n130 reviews\n\nEverything comes together in the Capstone.  You will draft a complete story, narrative essay, or memoir of 8–15 pages.  With the advice of your peer readers, you will revise, rewrite, and complete it. The skills you’ve learned of plotting, setting, physical description, characterization, and stylistic clarity and innovation will culminate in an original work of art all your own.  We’ll discuss the steps that professional writers take to bring their work into the public world.  Along the way you’ll learn the patient habits of revision that make up the writer’s life.\n\nSHOW ALL ABOUT CAPSTONE: YOUR STORY\nSHOW ALL"
    },
    "/specializations/algorithms-for-battery-management-systems",
    {
       "Url":"/learn/battery-management-systems?specialization=algorithms-for-battery-management-systems",
       "name":"Introduction to battery-management systems",
       "Rating":"Introduction to battery-management systems\n4.8\nstars\n1,316 ratings\n•\n358 reviews\n\nThis course can also be taken for academic credit as ECEA 5730, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis course will provide you with a firm foundation in lithium-ion cell terminology and function and in battery-management-system requirements as needed by the remainder of the specialization. After completing this course, you will be able to:\n-\tList the major functions provided by a battery-management system and state their purpose\n-\tMatch battery terminology to a list of definitions\n-\tIdentify the major components of a lithium-ion cell and their purpose\n-\tUnderstand how a battery-management system “measures” current, temperature, and isolation, and how it controls contactors\n-\tIdentify electronic components that can provide protection and specify a minimum set of protections needed\n-\tCompute stored energy in a battery pack\n-\tList the manufacturing steps of different types of lithium-ion cells and possible failure modes\n\nSHOW ALL ABOUT INTRODUCTION TO BATTERY-MANAGEMENT SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/equivalent-circuit-cell-model-simulation?specialization=algorithms-for-battery-management-systems",
       "name":"Equivalent Circuit Cell Model Simulation",
       "Rating":"Equivalent Circuit Cell Model Simulation\n4.7\nstars\n270 ratings\n•\n63 reviews\n\nThis course can also be taken for academic credit as ECEA 5731, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nIn this course, you will learn the purpose of each component in an equivalent-circuit model of a lithium-ion battery cell, how to determine their parameter values from lab-test data, and how to use them to simulate cell behaviors under different load profiles. By the end of the course, you will be able to:\n-\tState the purpose for each component in an equivalent-circuit model\n-\tCompute approximate parameter values for a circuit model using data from a simple lab test\n-\tDetermine coulombic efficiency of a cell from lab-test data \n-\tUse provided Octave/MATLAB script to compute open-circuit-voltage relationship for a cell from lab-test data\n-\tUse provided Octave/MATLAB script to compute optimized values for dynamic parameters in model\n-\tSimulate an electric vehicle to yield estimates of range and to specify drivetrain components\n-\tSimulate battery packs to understand and predict behaviors when there is cell-to-cell variation in parameter values\n\nSHOW ALL ABOUT EQUIVALENT CIRCUIT CELL MODEL SIMULATION\nSHOW ALL"
    },
    {
       "Url":"/learn/battery-state-of-charge?specialization=algorithms-for-battery-management-systems",
       "name":"Battery State-of-Charge (SOC) Estimation",
       "Rating":"Battery State-of-Charge (SOC) Estimation\n4.8\nstars\n132 ratings\n•\n28 reviews\n\nThis course can also be taken for academic credit as ECEA 5732, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nIn this course, you will learn how to implement different state-of-charge estimation methods and to evaluate their relative merits. By the end of the course, you will be able to:\n\n-\tImplement simple voltage-based and current-based state-of-charge estimators and understand their limitations\n-\tExplain the purpose of each step in the sequential-probabilistic-inference solution\n-\tExecute provided Octave/MATLAB script for a linear Kalman filter and evaluate results\n-\tExecute provided Octave/MATLAB script for state-of-charge estimation using an extended Kalman filter on lab-test data and evaluate results\n-\tExecute provided Octave/MATLAB script for state-of-charge estimation using a sigma-point Kalman filter on lab-test data and evaluate results\n-\tImplement method to detect and discard faulty voltage-sensor measurements\n\nSHOW ALL ABOUT BATTERY STATE-OF-CHARGE (SOC) ESTIMATION\nSHOW ALL"
    },
    {
       "Url":"/learn/battery-state-of-health?specialization=algorithms-for-battery-management-systems",
       "name":"Battery State-of-Health (SOH) Estimation",
       "Rating":"Battery State-of-Health (SOH) Estimation\n4.7\nstars\n80 ratings\n•\n17 reviews\n\nThis course can also be taken for academic credit as ECEA 5733, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nIn this course, you will learn how to implement different state-of-health estimation methods and to evaluate their relative merits. By the end of the course, you will be able to:\n-\tIdentify the primary degradation mechanisms that occur in lithium-ion cells and understand how they work\n-\tExecute provided Octave/MATLAB script to estimate total capacity using WLS, WTLS, and AWTLS methods and lab-test data, and to evaluate results\n-\tCompute confidence intervals on total-capacity estimates \n-\tCompute estimates of a cell’s equivalent-series resistance using lab-test data\n-\tSpecify the tradeoffs between joint and dual estimation of state and parameters, and steps that must be taken to ensure robust estimates (honors)\n\nSHOW ALL ABOUT BATTERY STATE-OF-HEALTH (SOH) ESTIMATION\nSHOW ALL"
    },
    {
       "Url":"/learn/battery-pack-balancing-power-estimation?specialization=algorithms-for-battery-management-systems",
       "name":"Battery Pack Balancing and Power Estimation",
       "Rating":"Battery Pack Balancing and Power Estimation\n4.9\nstars\n70 ratings\n•\n14 reviews\n\nThis course can also be taken for academic credit as ECEA 5734, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nIn this course, you will learn how to design balancing systems and to compute remaining energy and available power for a battery pack. By the end of the course, you will be able to:\n-\tEvaluate different design choices for cell balancing and articulate their relative merits\n-\tDesign component values for a simple passive balancing circuit\n-\tUse provided Octave/MATLAB simulation tools to evaluate how quickly a battery pack must be balanced\n-\tCompute remaining energy and available power using a simple cell model\n-\tUse provided Octave/MATLAB script to compute available power using a comprehensive equivalent-circuit cell model\n\nSHOW ALL ABOUT BATTERY PACK BALANCING AND POWER ESTIMATION\nSHOW ALL"
    },
    "/specializations/learnquest-certified-scrum-master",
    {
       "Url":"/learn/introduction-to-certified-scrum-master?specialization=learnquest-certified-scrum-master",
       "name":"Introduction to Scrum Master Training",
       "Rating":"Introduction to Scrum Master Training\n4.6\nstars\n69 ratings\n•\n17 reviews\n\nThis course is designed to help Scrum beginners learn the foundational knowledge to become proficient with Agile Scrum. Throughout the course, learners will explore Agile methodologies and benefits of building incrementally. They will also learn about the roles within Scrum teams, events that happen during a Sprint, Agile artifacts, and the Definition of Done for a Sprint.\n\nSHOW ALL ABOUT INTRODUCTION TO SCRUM MASTER TRAINING\nSHOW ALL"
    },
    {
       "Url":"/learn/csm-practice-process-management?specialization=learnquest-certified-scrum-master",
       "name":"Scrum Master Certification: Scrum Methodologies",
       "Rating":"Scrum Master Certification: Scrum Methodologies\n4.7\nstars\n31 ratings\n•\n6 reviews\n\nThis course is designed to help Scrum beginners learn the foundational knowledge to become proficient with Agile Scrum. Throughout the course, learners will explore User Stories and how they are prioritized in Agile, Velocity, Backlog Refinement, and Market Actions. Learners will also learn about different Scrum Reports and methods of managing risks.\n\nSHOW ALL ABOUT SCRUM MASTER CERTIFICATION: SCRUM METHODOLOGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/scaling-agile-and-the-team-of-teams?specialization=learnquest-certified-scrum-master",
       "name":"Scrum Master Certification: Scaling Agile and the Team-of-Teams",
       "Rating":"Scrum Master Certification: Scaling Agile and the Team-of-Teams\n4.6\nstars\n16 ratings\n•\n5 reviews\n\nPrior to starting this course, we recommend that you complete the first two courses in this specialization: Introduction to Scrum Master Training and Scrum Methodology.\n\nThis is the third course in the Certified Scrum Master specialization: Scaling Agile and the Team-of-Teams.\n\nSHOW ALL ABOUT SCRUM MASTER CERTIFICATION: SCALING AGILE AND THE TEAM-OF-TEAMS\nSHOW ALL"
    },
    {
       "Url":"/learn/combining-scrum-with-other-methodologies?specialization=learnquest-certified-scrum-master",
       "name":"Combining Scrum with Other Agile Methodologies",
       "Rating":"Combining Scrum with Other Agile Methodologies\n4.6\nstars\n14 ratings\n•\n2 reviews\n\nThis course is designed to help Scrum beginners become more proficient with Agile Scrum. This course explores layering other Agile methodologies on top of Scrum.\n\nThis is the fourth course in the Certified Scrum Master specialization. We recommend completing the first three courses before beginning this one.\n\nSHOW ALL ABOUT COMBINING SCRUM WITH OTHER AGILE METHODOLOGIES\nSHOW ALL"
    },
    "/specializations/statistics",
    {
       "Url":"/learn/probability-intro?specialization=statistics",
       "name":"Introduction to Probability and Data with R",
       "Rating":"Introduction to Probability and Data with R\n4.7\nstars\n4,917 ratings\n•\n1,180 reviews\n\nThis course introduces you to sampling and exploring data, as well as basic probability theory and Bayes' rule. You will examine various types of sampling methods, and discuss how such methods can impact the scope of inference. A variety of exploratory data analysis techniques will be covered, including numeric summary statistics and basic data visualization. You will be guided through installing and using R and RStudio (free statistical software), and will use this software for lab exercises and a final project. The concepts and techniques in this course will serve as building blocks for the inference and modeling courses in the Specialization.\n\nSHOW ALL ABOUT INTRODUCTION TO PROBABILITY AND DATA WITH R\nSHOW ALL"
    },
    {
       "Url":"/learn/inferential-statistics-intro?specialization=statistics",
       "name":"Inferential Statistics",
       "Rating":"Inferential Statistics\n4.8\nstars\n2,204 ratings\n•\n412 reviews\n\nThis course covers commonly used statistical inference methods for numerical and categorical data. You will learn how to set up and perform hypothesis tests, interpret p-values, and report the results of your analysis in a way that is interpretable for clients or the public. Using numerous data examples, you will learn to report estimates of quantities in a way that expresses the uncertainty of the quantity of interest. You will be guided through installing and using R and RStudio (free statistical software), and will use this software for lab exercises and a final project. The course introduces practical tools for performing data analysis and explores the fundamental concepts necessary to interpret and report results for both categorical and numerical data\n\nSHOW ALL ABOUT INFERENTIAL STATISTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/linear-regression-model?specialization=statistics",
       "name":"Linear Regression and Modeling",
       "Rating":"Linear Regression and Modeling\n4.7\nstars\n1,541 ratings\n•\n284 reviews\n\nThis course introduces simple and multiple linear regression models. These models allow you to assess the relationship between variables in a data set and a continuous response variable. Is there a relationship between the physical attractiveness of a professor and their student evaluation scores? Can we predict the test score for a child based on certain characteristics of his or her mother? In this course, you will learn the fundamental theory behind linear regression and, through data examples, learn to fit, examine, and utilize regression models to examine relationships between multiple variables, using the free statistical software R and RStudio.\n\nSHOW ALL ABOUT LINEAR REGRESSION AND MODELING \nSHOW ALL"
    },
    {
       "Url":"/learn/bayesian?specialization=statistics",
       "name":"Bayesian Statistics",
       "Rating":"Bayesian Statistics\n3.8\nstars\n758 ratings\n•\n246 reviews\n\nThis course describes Bayesian statistics, in which one's inferences about parameters or hypotheses are updated as evidence accumulates. You will learn to use Bayes’ rule to transform prior probabilities into posterior probabilities, and be introduced to the underlying theory and perspective of the Bayesian paradigm. The course will apply Bayesian methods to several practical problems, to show end-to-end Bayesian analyses that move from framing the question to building models to eliciting prior probabilities to implementing in R (free statistical software) the final posterior distribution. Additionally, the course will introduce credible regions, Bayesian comparisons of means and proportions, Bayesian regression and inference using multiple models, and discussion of Bayesian prediction.\n\nWe assume learners in this course have background knowledge equivalent to what is covered in the earlier three courses in this specialization: \"Introduction to Probability and Data,\" \"Inferential Statistics,\" and \"Linear Regression and Modeling.\"\n\nSHOW ALL ABOUT BAYESIAN STATISTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/statistics-project?specialization=statistics",
       "name":"Statistics with R Capstone",
       "Rating":"Statistics with R Capstone\n4.6\nstars\n202 ratings\n•\n51 reviews\n\nThe capstone project will be an analysis using R that answers a specific scientific/business question provided by the course team. A large and complex dataset will be provided to learners and the analysis will require the application of a variety of methods and techniques introduced in the previous courses, including exploratory data analysis through data visualization and numerical summaries, statistical inference, and modeling as well as interpretations of these results in the context of the data and the research question. The analysis will implement both frequentist and Bayesian techniques and discuss in context of the data how these two approaches are similar and different, and what these differences mean for conclusions that can be drawn from the data.\n\nA sampling of the final projects will be featured on the Duke Statistical Science department website.\n\nNote: Only learners who have passed the four previous courses in the specialization are eligible to take the Capstone.\n\nSHOW ALL ABOUT STATISTICS WITH R CAPSTONE\nSHOW ALL"
    },
    "/specializations/investment-management-python-machine-learning",
    {
       "Url":"/learn/introduction-portfolio-construction-python?specialization=investment-management-python-machine-learning",
       "name":"Introduction to Portfolio Construction and Analysis with Python",
       "Rating":"Introduction to Portfolio Construction and Analysis with Python\n4.8\nstars\n1,045 ratings\n•\n305 reviews\n\nThe practice of investment management has been transformed in recent years by computational methods. This course provides an introduction to the underlying science, with the aim of giving you a thorough understanding of that scientific basis. However, instead of merely explaining the science, we help you build on that foundation in a practical manner, with an emphasis on the hands-on implementation of those ideas in the Python programming language. \n\nThis course is the first in a four course specialization in Data Science and Machine Learning in Asset Management but can be taken independently. In this course, we cover the basics of Investment Science, and we'll build practical implementations of each of the concepts along the way. We'll start with the very basics of risk and return and quickly progress to cover a range of topics including several Nobel Prize winning concepts. We'll cover some of the most popular practical techniques in modern, state of the art investment management and portfolio construction. \n\nAs we cover the theory and math in lecture videos, we'll also implement the concepts in Python, and you'll be able to code along with us so that you have a deep and practical understanding of how those methods work. By the time you are done, not only will you have a foundational understanding of modern computational methods in investment management, you'll have practical mastery in the implementation of those methods.\n\nSHOW ALL ABOUT INTRODUCTION TO PORTFOLIO CONSTRUCTION AND ANALYSIS WITH PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-portfolio-construction-python?specialization=investment-management-python-machine-learning",
       "name":"Advanced Portfolio Construction and Analysis with Python",
       "Rating":"Advanced Portfolio Construction and Analysis with Python\n4.8\nstars\n399 ratings\n•\n110 reviews\n\nThe practice of investment management has been transformed in recent years by computational methods. Instead of merely explaining the science, we help you build on that foundation in a practical manner, with an emphasis on the hands-on implementation of those ideas in the Python programming language. In this course, we cover the estimation, of risk and return parameters for meaningful portfolio decisions, and also introduce a variety of state-of-the-art portfolio construction techniques that have proven popular in investment management and portfolio construction due to their enhanced robustness.\n\nAs we cover the theory and math in lecture videos, we'll also implement the concepts in Python, and you'll be able to code along with us so that you have a deep and practical understanding of how those methods work. By the time you are done, not only will you have a foundational understanding of modern computational methods in investment management, you'll have practical mastery in the implementation of those methods. If you follow along and implement all the lab exercises, you will complete the course with a powerful toolkit that you will be able to use to perform your own analysis and build your own implementations and perhaps even use your newly acquired knowledge to improve on current methods.\n\nSHOW ALL ABOUT ADVANCED PORTFOLIO CONSTRUCTION AND ANALYSIS WITH PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/python-machine-learning-for-investment-management?specialization=investment-management-python-machine-learning",
       "name":"Python and Machine Learning for Asset Management",
       "Rating":"Python and Machine Learning for Asset Management\n3.1\nstars\n259 ratings\n•\n107 reviews\n\nThis course will enable you mastering machine-learning approaches in the area of investment management. It has been designed by two thought leaders in their field, Lionel Martellini from EDHEC-Risk Institute and John Mulvey from Princeton University. Starting from the basics, they will help you build practical skills to understand data science so you can make the best portfolio decisions.\n\nThe course will start with an introduction to the fundamentals of machine learning, followed by an in-depth discussion of the application of these techniques to portfolio management decisions, including the design of more robust factor models, the construction of portfolios with improved diversification benefits, and the implementation of more efficient risk management models. \n\nWe have designed a 3-step learning process: first, we will introduce a meaningful investment problem and see how this problem can be addressed using statistical techniques. Then, we will see how this new insight from Machine learning can complete and improve the relevance of the analysis.\n\nYou will have the opportunity to capitalize on videos and recommended readings to level up your financial expertise, and to use the quizzes and Jupiter notebooks to ensure grasp of concept.\n\nAt the end of this course, you will master the various machine learning techniques in investment management.\n\nSHOW ALL ABOUT PYTHON AND MACHINE LEARNING FOR ASSET MANAGEMENT \nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-asset-management-alternative-data?specialization=investment-management-python-machine-learning",
       "name":"Python and Machine-Learning for Asset Management with Alternative Data Sets",
       "Rating":"Python and Machine-Learning for Asset Management with Alternative Data Sets\n4.4\nstars\n198 ratings\n•\n51 reviews\n\nOver-utilization of market and accounting data over the last few decades has led to portfolio crowding, mediocre performance and systemic risks, incentivizing financial institutions which are looking for an edge to quickly adopt alternative data as a substitute to traditional data. This course introduces the core concepts around alternative data, the most recent research in this area, as well as practical portfolio examples and actual applications. The approach of this course is somewhat unique because while the theory covered is still a main component, practical lab sessions and examples of working with alternative datasets are also key. This course is fo you if you are aiming at carreers prospects as a data scientist in financial markets, are looking to enhance your analytics skillsets to the financial markets, or if you are interested in cutting-edge technology and research as  they apply to big data. The required background is: Python programming, Investment theory , and Statistics. This course will enable you to learn new data and research techniques applied to the financial markets while strengthening data science and python skills.\n\nSHOW ALL ABOUT PYTHON AND MACHINE-LEARNING FOR ASSET MANAGEMENT WITH ALTERNATIVE DATA SETS\nSHOW ALL"
    },
    "/specializations/thinklikeacfo",
    {
       "Url":"/learn/financial-accounting?specialization=thinklikeacfo",
       "name":"Accounting: Principles of Financial Accounting",
       "Rating":"Accounting: Principles of Financial Accounting\n4.8\nstars\n2,460 ratings\n•\n711 reviews\n\nFinancial Accounting is often called the language of business; it is the language that managers use to communicate the firm's financial and economic information to external parties such as shareholders and creditors. Nobody working in business can afford financial illiteracy. Whether you run your own business, work as a manager or are just starting your career, you want to understand financial information and be able to interact with accountants, controllers, and financial managers. You want to talk business! \n\nThis course will provide you with the accounting language's essentials. Upon completion, you should be able to read and interpret financial statements for business diagnosis and decision-making. More importantly, you will possess the conceptual base to keep learning more sophisticated accounting and finance on your own. Do not forget that, as with any other language, becoming proficient with accounting requires constant practice.\n\nSHOW ALL ABOUT ACCOUNTING: PRINCIPLES OF FINANCIAL ACCOUNTING\nSHOW ALL"
    },
    {
       "Url":"/learn/operational-finance?specialization=thinklikeacfo",
       "name":"Finance for Managers",
       "Rating":"Finance for Managers\n4.8\nstars\n746 ratings\n•\n233 reviews\n\nWhen it comes to numbers, there is always more than meets the eye.  In operational finance, you will learn how to read the “story” that the balance sheet and income statement tells about the company’s operations. The insights you gain from this “financial story” will then become a tool for short-term decision-making at the top management level relating to current assets, current liabilities and the management of working capital. Finally, by the end of the course you will understand the financial consequences of managerial decisions on operations, marketing, etc.\n\nSHOW ALL ABOUT FINANCE FOR MANAGERS\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-finance-essentials?specialization=thinklikeacfo",
       "name":"Corporate Finance Essentials",
       "Rating":"Corporate Finance Essentials\n4.8\nstars\n2,238 ratings\n•\n645 reviews\n\nCorporate Finance Essentials will enable you to understand key financial issues related to companies, investors, and the interaction between them in the capital markets. By the end of this course you should be able to understand most of what you read in the financial press and use the essential financial vocabulary of companies and finance professionals.\n\nSHOW ALL ABOUT CORPORATE FINANCE ESSENTIALS\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-finance-essentials-ii?specialization=thinklikeacfo",
       "name":"Corporate Finance Essentials II",
       "Rating":"Corporate Finance Essentials II\n4.8\nstars\n47 ratings\n•\n15 reviews\n\nThis course picks up where Corporate Finance Essentials left, addressing other corporate\n\nfinance issues not addressed in the previous course, such as market efficiency, bonds, stocks,\ncapital structure, and dividend policy.\n\nThis course will help you to: \n\n●\tUnderstanding the concept of market efficiency. \n●\tGet an overview in issues related to bonds, such as type of bonds, their return (yield to maturity) and default risk \n●\tGetting to know the valuation of stocks through the method of relative valuation (multiples)\n●\tKnowing what are the sources that financial companies use to obtain capital for their projects\n●\tUnderstanding two of the most critical decisions companies need to make: whether to pay dividends and if so, how much.\n\nSHOW ALL ABOUT CORPORATE FINANCE ESSENTIALS II\nSHOW ALL"
    },
    "/specializations/academic-english",
    {
       "Url":"/learn/grammar-punctuation?specialization=academic-english",
       "name":"Grammar and Punctuation",
       "Rating":"Grammar and Punctuation\n4.7\nstars\n17,436 ratings\n•\n5,330 reviews\n\nCourse 1: Grammar and Punctuation\n\nDo you need to review English grammar? Have you forgotten the grammar you once studied? If so, this course is perfect for you.\n\nThe first course in this specialization is a refresher on some tools needed for good writing. It will help prepare you for the other courses. You will need about 10 hours to complete this first course. Writing is a skill and to learn a skill well, you need to practice. In this course, you will watch short video lectures and then practice and discuss what you have learned. Make sure you take good notes and use the peer discussions to ask questions. Then you'll be able to remember the rules you learn in this course when you start writing essays in the next course.\n\nAfter completing this course, you will be able to:\n - identify the correct verb tenses to use\n - use commas effectively\n - utilize several different sentence types\n - write more effectively in English\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.\n\nSHOW ALL ABOUT GRAMMAR AND PUNCTUATION\nSHOW ALL"
    },
    {
       "Url":"/learn/getting-started-with-essay-writing?specialization=academic-english",
       "name":"Getting Started with Essay Writing",
       "Rating":"Getting Started with Essay Writing\n4.7\nstars\n2,877 ratings\n•\n784 reviews\n\nCourse 2: Getting Started with Essay Writing\n\nThis is the second course in the Academic English: Writing specialization.  By introducing you to three types of academic essays, this course will especially help prepare you for work in college classes, but anyone who wants to improve his or her writing skills can benefit from this course.\n\nAfter completing this course, you will be able to:\n - create effective thesis statements for your essays\n - plan and write compare/contrast, cause/effect, and argument essays\n - write well-developed body paragraphs\n\nNote: The lectures and practice activities are available for free, but you must upgrade to the pay version in order to take the quizzes and get feedback on writing assignments.\n\nSHOW ALL ABOUT GETTING STARTED WITH ESSAY WRITING\nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-writing?specialization=academic-english",
       "name":"Advanced Writing",
       "Rating":"Advanced Writing\n4.7\nstars\n1,678 ratings\n•\n415 reviews\n\nCourse 3: Advanced Writing\n\nThis is the third course in the Academic English: Writing specialization.  By raising your level of academic writing, this course helps prepare you for college-level work.\n\nAfter completing this course, you will be able to: \n - plan and write a more sophisticated argument essay\n - identify plagiarism and explain how to prevent it\n - read and analyze several articles to form your own opinion on a topic\n - make connections between several articles\n - form thesis statements from your readings\n - use sources effectively when writing an essay\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.\n\nSHOW ALL ABOUT ADVANCED WRITING\nSHOW ALL"
    },
    {
       "Url":"/learn/introduction-to-research-for-essay-writing?specialization=academic-english",
       "name":"Introduction to Research for Essay Writing",
       "Rating":"Introduction to Research for Essay Writing\n4.7\nstars\n891 ratings\n•\n226 reviews\n\nCourse 4: Introduction to Research for Essay Writing\n\nThis is the last course in the Academic Writing specialization before the capstone project. By the end of this course, you will be able to complete all the steps in planning a research paper.\n\nAfter completing this course, you will be able to:\n - choose appropriate research topics for college classes\n - write detailed outlines for research papers\n - find source material for research papers\n - take and organize good notes for research\n - use appropriate academic tone and language\n - document sources by creating a Works Cited list in MLA format\n - avoid plagiarizing your sources\n\nSHOW ALL ABOUT INTRODUCTION TO RESEARCH FOR ESSAY WRITING\nSHOW ALL"
    },
    {
       "Url":"/learn/academic-writing-capstone?specialization=academic-english",
       "name":"Project: Writing a Research Paper",
       "Rating":"Project: Writing a Research Paper\n4.8\nstars\n257 ratings\n•\n59 reviews\n\nWelcome to the capstone project for the Academic English: Writing Specialization! This project lets you apply everything you’ve learned and gives you the practice you need for college classes by having you write a research paper.  You'll have several due dates throughout the capstone to help you stay on schedule.\n\nIn this capstone project, you will:\n - conduct research on an academic topic of your choice\n - create an outline to plan out your essay\n - write a short annotated bibliography to help you evaluate your sources\n - write a 7-8 page research paper\n - use source material correctly with MLA format\n\nSHOW ALL ABOUT PROJECT: WRITING A RESEARCH PAPER\nSHOW ALL"
    },
    "/specializations/uva-darden-bcg-pricing-strategy",
    {
       "Url":"/learn/uva-darden-bcg-pricing-strategy-cost-economics?specialization=uva-darden-bcg-pricing-strategy",
       "name":"Cost and Economics in Pricing Strategy",
       "Rating":"Cost and Economics in Pricing Strategy\n4.8\nstars\n586 ratings\n•\n135 reviews\n\nHow much should you charge for your products and services? Traditionally, businesses have answered this question based on the cost to produce or provide their goods and services. This course shows you the economic factors behind pricing based on cost and the pros and cons of a cost-based pricing approach. Developed at the Darden School of Business at the University of Virginia, and led by top-ranked Darden faculty and Boston Consulting Group global pricing experts, the course provides the practical and research-based models and methods you need to set prices that maximize your profits. \n\nBy the end of this course, you’ll be able to:\n--Apply knowledge of basic economics to make better pricing decisions\n--Recognize opportunities for price discrimination—selling the same product at different prices to different buyers—and recommend strategies to maximize sales and profits\n--Calculate three types of price elasticities to determine the impact of price on demand\n--Analyze and apply different pricing models\n  -Cost-plus pricing\n  -Marginal cost-plus pricing\n  -Peak-load pricing\n  -Index-based pricing\n--Evaluate the impact of channel intermediaries and customer lifetime value on pricing\n\nSHOW ALL ABOUT COST AND ECONOMICS IN PRICING STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-bcg-pricing-strategy-customer-value?specialization=uva-darden-bcg-pricing-strategy",
       "name":"Customer Value in Pricing Strategy",
       "Rating":"Customer Value in Pricing Strategy\n4.8\nstars\n299 ratings\n•\n52 reviews\n\nThe traditional approach to pricing based on costs works to pay the bills, but it leaves revenue on the table. You can, in fact, price your products in a way that increases sales--if you know what your customers are willing to pay and can leverage psychology to create better deal and discount plans. In this course, we'll show you how to price a product based on how your customers value it and the psychology behind their purchase decisions. Developed at the Darden School of Business at the University of Virginia, and led by top-ranked Darden faculty and Boston Consulting Group global pricing experts, this course provides an in-depth understanding of value-based pricing and how to use it to capture more revenue.\n\nBy the end of this course, you'll be able to...\n-- Apply knowledge of customer value to price products\n-- Leverage core value-based pricing techniques to inform pricing decisions\n-- Measure customer willingness to pay using models (surveys, conjoint analysis, other data)\n-- Use knowledge of consumer psychology to set prices beneficial to both consumers and sellers\n\nSHOW ALL ABOUT CUSTOMER VALUE IN PRICING STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-bcg-pricing-strategy-market-competition?specialization=uva-darden-bcg-pricing-strategy",
       "name":"Market and Competition in Pricing Strategy",
       "Rating":"Market and Competition in Pricing Strategy\n4.8\nstars\n205 ratings\n•\n23 reviews\n\nIf you haven’t considered what the competition is charging, you may not be maximizing your revenue. Spend time analyzing the market and you can influence price and improve margins. In this course, we'll show you how to implement competitive pricing and avoid common legal pitfalls of market-based pricing. You will also learn how to predict, influence and respond to competitors’ pricing moves. Developed at the Darden School of Business at the University of Virginia, and led by top-ranked Darden faculty and Boston Consulting Group global pricing experts, this course provides an in-depth understanding of market-based pricing and how to use it to capture more revenue.\n\nSHOW ALL ABOUT MARKET AND COMPETITION IN PRICING STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-bcg-pricing-strategy-practice?specialization=uva-darden-bcg-pricing-strategy",
       "name":"Pricing Strategy in Practice",
       "Rating":"Pricing Strategy in Practice\n4.7\nstars\n144 ratings\n•\n23 reviews\n\nIn this project-centered course, Darden's Ron Wilcox and BCG's Thomas Kohler will walk you through a real-world case, from problem statement to detailed analyses. You'll use all three lenses (cost, customer value, and competition) to recommend an optimal price—and then adjust to market disruptions. Utilizing the concepts, tools and techniques taught in previous Specialization courses—from basic techniques of economics to knowledge of customer segments, willingness to pay, and customer decision making to analysis of market prices, share, and industry dynamics—you will practice setting profit maximizing prices to improve price realization. You'll finish the course with a portfolio-building project that demonstrates your pricing prowess from this Darden School of Business at the University of Virginia and Boston Consulting Group course.\n\nSHOW ALL ABOUT PRICING STRATEGY IN PRACTICE\nSHOW ALL"
    },
    "/specializations/accounting-fundamentals",
    {
       "Url":"/learn/financial-statements?specialization=accounting-fundamentals",
       "name":"Understanding Financial Statements: Company Position",
       "Rating":"Understanding Financial Statements: Company Position\n4.8\nstars\n1,030 ratings\n•\n252 reviews\n\nThis course is designed to provide a basic understanding of financial statements with an emphasis on the balance sheet. However, to understand accounting driven financial statements, it is important to recognize that accounting is less about counting and more about measuring. “What is it that is being measured?” Well, as the course unfolds, you will learn about the three measurement questions and how the balance sheet helps to answer the first two of these questions. By touring a real company and interviewing real business people, the course describes the basic content of financial statements in a simple yet relevant context. The goal of the course is to leave a lasting impression about what balance sheet consists of and what it reveals. The next course in the Fundamentals of Accounting Specialization completes the conversation by addressing the remaining measurement question.\n\nUpon successful completion of this course, you will be able to:\n•\tDescribe the purpose of a balance sheet.\n•\tDefine the three components of a balance sheet.\n•\tRecognize and understand the meaning of several items typically presented on a balance sheet. \n•\tExplain the broader purpose of financial statements and the role of accounting in producing the financial statements.\n•\tRead and, to some extent, interpret real-world balance sheets.\n\nIf you enjoy this business course and are interested in an MBA, consider applying to the iMBA, a flexible, fully-accredited online MBA at an incredibly competitive price offered by the University of Illinois. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\nSHOW ALL ABOUT UNDERSTANDING FINANCIAL STATEMENTS: COMPANY POSITION\nSHOW ALL"
    },
    {
       "Url":"/learn/income-statement?specialization=accounting-fundamentals",
       "name":"Understanding Financial Statements: Company Performance",
       "Rating":"Understanding Financial Statements: Company Performance\n4.7\nstars\n680 ratings\n•\n177 reviews\n\nThis course is designed to provide a basic understanding of financial statements with an emphasis on the income statement. Building on the foundation formed in the first course, you will learn about the third of our three measurement questions and how the income statement helps to answer this final measurement question. Returning to the real business people introduced in the first course, this second course describes the basic content of income statement in a simple yet relevant context. The course ends by summarizing many of the lessons learned in both courses to leave you with a lasting impression about what financial statements are and how accounting can work for you. We all know that accounting is “the language of business”; let’s make learning this language engaging, and perhaps even fun!\n\nUpon successful completion of this course, you will be able to:\n•\tDescribe the purpose of an income statement.\n•\tDefine the basic components of an income statement.\n•\tRecognize and understand the meaning of several items typically presented on an income statement. \n•\tExplain the broader purpose of financial statements and the role of accounting in producing the financial statements.\n•\tRead and, to some extent, interpret real-world income statements.\n\nIf you enjoy this business course and are interested in an MBA, consider applying to the iMBA, a flexible, fully-accredited online MBA at an incredibly competitive price offered by the University of Illinois. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\nSHOW ALL ABOUT UNDERSTANDING FINANCIAL STATEMENTS: COMPANY PERFORMANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/business-accounting?specialization=accounting-fundamentals",
       "name":"Accounting for Business Decision Making: Measurement and Operational Decisions",
       "Rating":"Accounting for Business Decision Making: Measurement and Operational Decisions\n4.0\nstars\n132 ratings\n•\n28 reviews\n\nAccounting information is the lifeblood of the organization as it facilitates and influences operational and strategic decisions intended to achieve organizational goals. Organizations benefit from three decision-oriented roles of accounting: measurement, control, and communication. \n\nThis course provides an introduction to accounting’s measurement role inside of an organization and how accountants communicate information that helps managers and employees make operational decisions. In particular, you will learn how cost information is created and organized to help managers and employees conduct profitability analyses, develop and choose products, make pricing decisions, and make common business decisions. \n\nUpon successful completion of this course, you will be able to:\n•\tIdentify the nature, purpose, and importance of different types of decision-useful accounting information.\n•\tCreate, organize, and communicate cost information to best suit common operational decisions. \n•\tUse accounting information to manage products, control costs, and leverage other drivers of operational success.\n\nIf you enjoy this business course and are interested in an MBA, consider applying to the iMBA, a flexible, fully-accredited online MBA at an incredibly competitive price offered by the University of Illinois. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\nSHOW ALL ABOUT ACCOUNTING FOR BUSINESS DECISION MAKING: MEASUREMENT AND OPERATIONAL DECISIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/business-assessment?specialization=accounting-fundamentals",
       "name":"Accounting for Business Decision Making: Strategy Assessment and Control",
       "Rating":"Accounting for Business Decision Making: Strategy Assessment and Control\n4.1\nstars\n95 ratings\n•\n25 reviews\n\nAccounting information is the lifeblood of the organization, as it facilitates and influences operational and strategic decisions intended to achieve organizational goals. Organizations benefit from three decision-oriented roles of accounting: measurement, control, and communication. \n\nThis course provides an introduction to accounting’s role in helping managers develop and implement, and improve the organization’s strategy. In particular, you will learn how non-financial and financial information is created, organized, and communicated to help managers make strategic decisions, as well as measure strategic success. This course also provides an introduction to accounting as a control function inside the organization, which helps influence the alignment of managers’ and employees’ decisions with organizational goals. You will learn about different types of controls, including process controls, budgets, and performance measurement and evaluation tools and techniques. \n\nUpon successful completion of this course, you will be able to:\n\n•\tCreate and communicate accounting information that facilitates strategic decisions.\n•\tUse accounting information to develop, implement, and improve organizational strategy. \n•\tImplement controls that align managers’ and employees’ decisions with organizational goals. \n•\tMeasure and evaluate manager and employee performance to control and motivate operational and strategic decision-making.\n\nIf you enjoy this business course and are interested in an MBA, consider applying to the iMBA, a flexible, fully-accredited online MBA at an incredibly competitive price offered by the University of Illinois. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\nSHOW ALL ABOUT ACCOUNTING FOR BUSINESS DECISION MAKING: STRATEGY ASSESSMENT AND CONTROL\nSHOW ALL"
    },
    {
       "Url":"/learn/accounting-fundamentals-project?specialization=accounting-fundamentals",
       "name":"Fundamentals of Accounting Capstone",
       "Rating":"Fundamentals of Accounting Capstone\n4.3\nstars\n10 ratings\n•\n3 reviews\n\n**You should complete all other courses in the Fundamentals of Accounting Specialization before beginning this course.**\n\nThe capstone project will be set in the context of a realistic small-business enterprise, and will require you to think deeply and apply the accounting concepts presented in the other courses in the Fundamentals of Accounting. While navigating the daily operations of the business, you will have an opportunity to consider the accounting implications of the economic events encountered, as well as how these economic events should be communicated to decision makers.\n\nIf you enjoy this business course and are interested in an MBA, consider applying to the iMBA, a flexible, fully-accredited online MBA at an incredibly competitive price offered by the University of Illinois. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\nSHOW ALL ABOUT FUNDAMENTALS OF ACCOUNTING CAPSTONE\nSHOW ALL"
    },
    "/specializations/financialengineering",
    {
       "Url":"/learn/financial-engineering-intro?specialization=financialengineering",
       "name":"Introduction to Financial Engineering and Risk Management",
       "Rating":"Introduction to Financial Engineering and Risk Management\n\nIntroduction to Financial Engineering and Risk Management course belongs to the Financial Engineering and Risk Management Specialization and it provides a fundamental introduction to fixed income securities, derivatives and the respective pricing models. The first module gives an overview of the prerequisite concepts and rules in probability and optimization. This will prepare learners with the mathematical fundamentals for the course. The second module includes concepts around fixed income securities and their derivative instruments. We will introduce present value (PV) computation on fixed income securities in an arbitrage free setting, followed by a brief discussion on term structure of interest rates. In the third module, learners will engage with swaps and options, and price them using the 1-period Binomial Model. The final module focuses on option pricing in a multi-period setting, using the Binomial and the Black-Scholes Models. Subsequently, the multi-period Binomial Model will be illustrated using American Options, Futures, Forwards and assets with dividends.\n\nSHOW ALL ABOUT INTRODUCTION TO FINANCIAL ENGINEERING AND RISK MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/financial-engineering-termstructure?specialization=financialengineering",
       "name":"Term-Structure and Credit Derivatives",
       "Rating":"Term-Structure and Credit Derivatives\n\nThis course will focus on capturing the evolution of interest rates and providing deep insight into credit derivatives. In the first module we discuss the term structure lattice models and cash account, and then analyze fixed income derivatives, such as Options, Futures, Caplets and Floorlets, Swaps and Swaptions. In the second module, we will examine model calibration in the context of fixed income securities and extend it to other asset classes and instruments. Learners will operate model calibration using Excel and apply it to price a payer swaption in a Black-Derman-Toy (BDT) model. The third module introduces credit derivatives and subsequently focuses on modeling and pricing the Credit Default Swaps. In the fourth module, learners would be introduced to the concept of securitization, specifically asset backed securities(ABS). The discussion progresses to Mortgage Backed Securities(MBS) and the associated mortgage mathematics. The final module delves into introducing and pricing Collateralized Mortgage Obligations(CMOs).\n\nSHOW ALL ABOUT TERM-STRUCTURE AND CREDIT DERIVATIVES \nSHOW ALL"
    },
    {
       "Url":"/learn/financial-engineering-optimizationmethods?specialization=financialengineering",
       "name":"Optimization Methods in Asset Management",
       "Rating":"Optimization Methods in Asset Management\n\nThis course focuses on applications of optimization methods in portfolio construction and risk management. The first module discusses portfolio construction via Mean-Variance Analysis and Capital Asset Pricing Model (CAPM) in an arbitrage-free setting. Next, it demonstrates the application of the security market line and sharpe optimal portfolio in the exercises. The second module involves the difficulties in implementing Mean-Variance techniques in a real-world setting and the potential methods to deal with it. We will introduce Value at Risk (VaR) and Conditional Value at Risk (CVaR) as risk measurements, and Exchange Traded Funds (ETFs), which play an important role in trading and asset management. Typical statistical biases, pitfalls, and their underlying reasons are also discussed, in order to achieve better results when completing  real statistical estimation. The final module looks directly at real-world transaction costs modeling. It includes the basic market micro-structures including order book, bid-ask spread, measurement of liquidity, and their effects on transaction costs. Then we enrich Mean-Variance portfolio strategies by considering transaction costs.\n\nSHOW ALL ABOUT  OPTIMIZATION METHODS IN ASSET MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/financial-engineering-advancedtopics?specialization=financialengineering",
       "name":"Advanced Topics in Derivative Pricing",
       "Rating":"Advanced Topics in Derivative Pricing\n\nThis course discusses topics in derivative pricing. The first module is designed to understand the Black-Scholes model and utilize it to derive Greeks, which measures the sensitivity of option value to variables such as underlying asset price, volatility, and time to maturity. Greeks are important in risk management and hedging and often used to measure portfolio value change. Then we will analyze risk management of derivatives portfolios from two perspectives—Greeks approach and scenario analysis. The second module reveals how option’s theoretical price links to real market price—by implied volatility. We will discuss pricing by volatility surface as well as explanations of volatility smile and skew, which are common in real markets. The third module involves topics in credit derivatives and structured products and focuses on Credit Debit Obligation (CDO), which played an important part in the past financial crisis starting from 2007. We will cover CDO’s definition, simple and synthetic versions of CDO, and CDO portfolios. The final module is the application of option pricing methodologies and takes natural gas and electricity related options as an example to introduce valuation methods such as dynamic programming in real options.\n\nSHOW ALL ABOUT  ADVANCED TOPICS IN DERIVATIVE PRICING\nSHOW ALL"
    },
    {
       "Url":"/learn/financial-engineering-computationalmethods?specialization=financialengineering",
       "name":"Computational Methods in Pricing and Model Calibration",
       "Rating":"Computational Methods in Pricing and Model Calibration\n\nThis course focuses on computational methods in option and interest rate, product’s pricing and model calibration. The first module will introduce different types of options in the market, followed by an in-depth discussion into numerical techniques helpful in pricing them, e.g. Fourier Transform (FT) and Fast Fourier Transform (FFT) methods. We will explain models like Black-Merton-Scholes (BMS), Heston, Variance Gamma (VG), which are central to understanding stock price evolution, through case studies and Python codes. The second module introduces concepts like bid-ask prices, implied volatility, and option surfaces, followed by a demonstration of model calibration for fitting market option prices using optimization routines like brute-force search, Nelder-Mead algorithm, and BFGS algorithm. The third module introduces interest rates and the financial products built around these instruments. We will bring in fundamental concepts like forward rates, spot rates, swap rates, and the term structure of interest rates, extending it further for creating, calibrating, and analyzing LIBOR and swap curves. We will also demonstrate the pricing of bonds, swaps, and other interest rate products through Python codes. The final module focuses on real-world model calibration techniques used by practitioners to estimate interest rate processes and derive prices of different financial products. We will illustrate several regression techniques used for interest rate model calibration and end the module by covering the Vasicek and CIR model for pricing fixed income instruments.\n\nSHOW ALL ABOUT COMPUTATIONAL METHODS IN PRICING AND MODEL CALIBRATION\nSHOW ALL"
    },
    "/specializations/nosql-big-data-and-spark-foundations",
    {
       "Url":"/learn/introduction-to-nosql-databases?specialization=nosql-big-data-and-spark-foundations",
       "name":"Introduction to NoSQL Databases",
       "Rating":"Introduction to NoSQL Databases\n\nThis course will provide you with technical hands-on knowledge of NoSQL databases and Database-as-a-Service (DaaS) offerings. With the advent of Big Data and agile development methodologies, NoSQL databases have gained a lot of relevance in the database landscape. Their main advantage is the ability to effectively handle scalability and flexibility issues raised by modern applications. \n\nYou will start by learning the history and the basics of NoSQL databases and discover their key characteristics and benefits. You will learn about the four categories of NoSQL databases and how they differ from each other. You will explore the architecture and features of several different implementations of NoSQL databases, namely MongoDB, Cassandra, and IBM Cloudant. You will then get hands-on experience using those NoSQL databases to perform standard database management tasks, such as creating and replicating databases, loading and querying data, modifying database permissions, indexing and aggregating data, and sharding (or partitioning) data.\n\nSHOW ALL ABOUT INTRODUCTION TO NOSQL DATABASES\nSHOW ALL"
    },
    {
       "Url":"/learn/introduction-to-big-data-with-spark-hadoop?specialization=nosql-big-data-and-spark-foundations",
       "name":"Introduction to Big Data with Spark and Hadoop",
       "Rating":"Introduction to Big Data with Spark and Hadoop\n\nBernard Marr defines Big Data as the digital trace that we are generating in this digital era. In this course, you will learn about the characteristics of Big Data and its application in Big Data Analytics. You will gain an understanding about the features, benefits, limitations, and applications of some of the Big Data processing tools. You’ll explore how Hadoop and Hive help leverage the benefits of Big Data while overcoming some of the challenges it poses. \n\nHadoop is an open-source framework that allows for the distributed processing of large data sets across clusters of computers using simple programming models. Hive, a data warehouse software, provides an SQL-like interface to efficiently query and manipulate large data sets residing in various databases and file systems that integrate with Hadoop.\n\nApache Spark is an open-source processing engine that provides users new ways to store and make use of big data. It is an open-source processing engine built around speed, ease of use, and analytics. In this course, you will discover how to leverage Spark to deliver reliable insights. The course provides an overview of the platform, going into the different components that make up Apache Spark. \n\nIn this course, you will also learn about Resilient Distributed Datasets, or RDDs, that enable parallel processing across the nodes of a Spark cluster.\n\nSHOW ALL ABOUT INTRODUCTION TO BIG DATA WITH SPARK AND HADOOP\nSHOW ALL"
    },
    {
       "Url":"/learn/data-engineering-and-machine-learning-using-spark?specialization=nosql-big-data-and-spark-foundations",
       "name":"Data Engineering and Machine Learning using Spark",
       "Rating":"Data Engineering and Machine Learning using Spark\n\nOrganizations need skilled, forward-thinking Big Data practitioners who can apply their business and technical skills to unstructured data such as tweets, posts, pictures, audio files, videos, sensor data, and satellite imagery and more to identify behaviors and preferences of prospects, clients, competitors, and others. \n\nIn this short course you'll gain practical skills when you learn how to work with Apache Spark for Data Engineering and Machine Learning (ML) applications. You will work hands-on with Spark MLlib, Spark Structured Streaming, and more to perform extract, transform and load (ETL) tasks as well as Regression, Classification, and Clustering.\n\nThe course culminates in a project where you will apply your Spark skills to an ETL for ML workflow use-case.\n\nNOTE: This course requires that you have foundational skills for working with Apache Spark and Jupyter Notebooks.  The Introduction to Big Data with Spark and Hadoop course from IBM will equip you with these skills and it is recommended that you have completed that course or similar prior to starting this one.\n\nSHOW ALL ABOUT DATA ENGINEERING AND MACHINE LEARNING USING SPARK\nSHOW ALL"
    },
    "/specializations/strategic-leadership",
    {
       "Url":"/learn/everyday-leadership-foundation?specialization=strategic-leadership",
       "name":"Foundations of Everyday Leadership",
       "Rating":"Foundations of Everyday Leadership\n4.8\nstars\n4,757 ratings\n•\n1,264 reviews\n\nIn this foundational course, you will learn about the “head and heart” of everyday leadership by exploring dynamics of individual and group decision making and the challenges of managing motivation. Central to the course is forming a nuanced understanding of why and how leadership skills are critical to an organization’s success.\n\nYou will be able to:\n- Articulate why and how leadership skills are so critical to organizational success \n- Use leadership skills to work more effectively with others and organize teams to work more effectively together\n- Apply the foundations of effective leadership skills to everyday situations \n\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT FOUNDATIONS OF EVERYDAY LEADERSHIP\nSHOW ALL"
    },
    {
       "Url":"/learn/everyday-leadership-application?specialization=strategic-leadership",
       "name":"Applications of Everyday Leadership",
       "Rating":"Applications of Everyday Leadership\n4.8\nstars\n1,958 ratings\n•\n384 reviews\n\nThis course builds upon a conceptual knowledge of leadership by considering applications for more effective negotiation, feedback and coaching, conflict management, and change leadership. By applying a leadership framework to these realistic situations faced by businesses, you will be prepared to lead teams towards solutions in your own business challenges. \n\nYou will be able to:\n-\tNegotiate effectively and influence others through effective leadership\n-\tProvide feedback and coaching that is strategically appropriate and influential\n-\tManage conflict and lead change in business \n\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT APPLICATIONS OF EVERYDAY LEADERSHIP\nSHOW ALL"
    },
    {
       "Url":"/learn/designing-organization?specialization=strategic-leadership",
       "name":"Designing the Organization",
       "Rating":"Designing the Organization\n4.6\nstars\n1,417 ratings\n•\n273 reviews\n\nOrganizations are complex and can be difficult to manage well, so managers need tools to help them better understand and deal with the many complexities and challenges associated with organizational life. In this course, you will learn theories, principles, and frameworks that will help you design more effective organizations. \n\nYou will be able to: \n-\tAnalyze organizations from multiple perspectives to better understand business challenges\n-\tStrategically plan for effective organizational governance\n-\tDevelop systems to plan for growth and change\n-\tUnderstand implications of the external environment on business and strategically respond to these factors\n\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT DESIGNING THE ORGANIZATION\nSHOW ALL"
    },
    {
       "Url":"/learn/managing-organization?specialization=strategic-leadership",
       "name":"Managing the Organization",
       "Rating":"Managing the Organization\n4.7\nstars\n1,205 ratings\n•\n240 reviews\n\nThis course is intended to help you become a better manager by helping you more fully understand and deal with the complexities and challenges associated with managerial life in organizations. You will learn theories, principles, and frameworks that will help you more effectively manage and lead your organizations.\n\nYou will be able to:\n-\tAnalyze common managerial challenges and develop solutions to these challenges\n-\tUse power effectively and strategically to implement organizational change \n-\tUnderstand the foundations of organizational culture and decision-making\n-\tNavigate common decision-making pitfalls and ethical challenges\n-\tApply principles of organization management to common challenges of management\n\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT MANAGING THE ORGANIZATION\nSHOW ALL"
    },
    {
       "Url":"/learn/strategy-business?specialization=strategic-leadership",
       "name":"Business Strategy",
       "Rating":"Business Strategy\n4.8\nstars\n1,641 ratings\n•\n381 reviews\n\nIn this course you will learn how organizations create, capture, and maintain value. In doing so, you’ll develop an understanding of how and why this process is fundamental for sustainable competitive advantage. You will be able to better understand value creation, and capture and learn the tools to analyze both competition and cooperation from a variety of perspectives, including the industry-level (e.g., five forces analysis) and the firm-level (e.g., business models and strategic positioning). \n\nYou will be able to:\n-\tUnderstand how managers coordinate different functional areas, resources, and systems inside a company and align them with the external environment to enhance overall performance \n-\tRecognize strategic management tools and frameworks and apply them to real business contexts \n-\tProcess diverse business and industry information to diagnose strategic issues, evaluate strategic alternatives, and formulate a coherent and actionable strategic plan \n\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT BUSINESS STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-strategy?specialization=strategic-leadership",
       "name":"Corporate Strategy",
       "Rating":"Corporate Strategy\n4.7\nstars\n942 ratings\n•\n174 reviews\n\nIn this course you will learn how corporations create, capture, and maintain value, going beyond the management of a single line of business. It is thus a complement to (and should typically follow) a course on Business Strategy, which focuses on developing and sustaining competitive advantage for a single business unit. Here, you will be able to better understand and learn the tools to analyze and manage decisions from a corporate-level perspective, which emphasizes the management of multiple businesses and multiple stakeholders. Examples of such decisions include vertical integration, diversification, mergers and acquisitions, strategic alliances, international expansion, global strategy, corporate governance and corporate social responsibility.\n\nYou will:\n•\tUnderstand how corporations create and capture value as multi-business enterprises.\n•\tLearn tools and frameworks to assess choices regarding corporate scope, corporate transactions and global strategy.\n•\tLearn to analyze complex business situations and develop coherent corporate strategies.\n•\tUnderstand the role of corporate governance and stakeholder management in modern companies.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\nSHOW ALL ABOUT CORPORATE STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/strategic-leadership-capstone?specialization=strategic-leadership",
       "name":"Strategic Leadership and Management Capstone",
       "Rating":"Strategic Leadership and Management Capstone\n4.7\nstars\n201 ratings\n•\n46 reviews\n\nThe capstone is a strategic leadership and management plan where you’ll apply what you will learn to an actual business situation with participation by one or more focal companies. The deliverable will be designed to create value from the perspective of potential employers while achieving pedagogical and experiential goals for learners.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\nSHOW ALL ABOUT STRATEGIC LEADERSHIP AND MANAGEMENT CAPSTONE\nSHOW ALL"
    },
    "/specializations/entrepreneurship-growing-your-business",
    {
       "Url":"/learn/uva-darden-financial-accounting?specialization=entrepreneurship-growing-your-business",
       "name":"Financial Accounting Fundamentals",
       "Rating":"Financial Accounting Fundamentals\n4.8\nstars\n1,922 ratings\n•\n545 reviews\n\nThis course, developed at the Darden School of Business at the University of Virginia and taught by top-ranked faculty, will teach you the tools you'll need to understand the fundamentals of financial accounting. Concise videos, the financial records of a small business, and \"your turn\" activities guide you through the three most commonly used financial statements: the Balance Sheet, the Income Statement, and the Statement of Cash Flows. Beyond recording transactions, you'll learn how to prepare these financial statements, and read and analyze them to draw basic conclusions about a company's financial health.\n\nBy the end of this course, you will be able to:\n- Use journal entries to record transactions\n- Prepare and use t-accounts to summarize transactions recorded during an accounting period\n- Describe the three most commonly used financial statements and how they fit together\n- Prepare these financial statements based on transactions recorded during an accounting period\n- Draw basic conclusions about a company's financial health\n\nSHOW ALL ABOUT FINANCIAL ACCOUNTING FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-giving-voice-to-values?specialization=entrepreneurship-growing-your-business",
       "name":"Ethical Leadership Through Giving Voice to Values",
       "Rating":"Ethical Leadership Through Giving Voice to Values\n4.7\nstars\n319 ratings\n•\n95 reviews\n\nThis course offers an action-oriented introduction to Giving Voice to Values (or GVV), an exciting new approach to values-driven leadership development in the workplace, in business education and in life. \n\nGVV is not about persuading people to be more ethical, but instead it starts from the premise that most of us already want to act on our values, but that we also want to feel that we have a reasonable chance of doing so effectively. Through positive, real life examples, pre-scripting, rehearsal and peer coaching, GVV builds the skill, the confidence and likelihood that we will act on our values more often and more successfully. Based on research and practice, with over 1,000 pilots in educational settings and companies on all seven continents, GVV helps answer the questions: “What if I were going to act on my values? What would I say and do? How could I be most effective?”\n\nThis course was developed at the Darden School of Business at the University of Virginia and is taught by top-ranked faculty. You will come away from GVV with an expanded toolkit, as well as practice, in a variety of methods and techniques for voicing and enacting your own values and principles. You will develop and practice leadership skills in \"peer coaching” with other learners. Through cases and stories based on recognizable workplace, classroom and life values conflicts, you will apply the GVV techniques and “re-frames”, expanding your repertoire for possible action as well as identifying and rehearsing responses that are likely to be most effective. Through this practice, you will gain greater confidence and competence in voicing and enacting your values effectively.\n\nSHOW ALL ABOUT ETHICAL LEADERSHIP THROUGH GIVING VOICE TO VALUES\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-business-society?specialization=entrepreneurship-growing-your-business",
       "name":"New Models of Business in Society",
       "Rating":"New Models of Business in Society\n4.7\nstars\n3,855 ratings\n•\n1,101 reviews\n\nIn this course, developed at the Darden School of Business at the University of Virginia and taught by top-ranked faculty, we will be discussing the emergence of a new story about business. This new story locates business within a societal framework. Almost every business creates or destroys value for customers, suppliers, employees, communities and society, in addition to shareholders and other financiers. A number of new models of business can be built on this idea such as corporate responsibility, philanthropy, shared value and sustainability. Profits and stakeholder value go together, and this course explains how. The final session explores the idea of how to become a stakeholder entrepreneur and create a business that makes money and makes the world a better place.\n\nSHOW ALL ABOUT NEW MODELS OF BUSINESS IN SOCIETY\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-innovation-business-model-canvas?specialization=entrepreneurship-growing-your-business",
       "name":"Innovating with the Business Model Canvas",
       "Rating":"Innovating with the Business Model Canvas\n4.6\nstars\n212 ratings\n•\n67 reviews\n\nHave you ever gotten really excited about reading or writing a business plan? You might have started out excited, but I’m going to bet you didn’t stay that way. Let’s be honest- business plans are boring and mostly ignored. \n\nThe beauty of the one-page Business Model Canvas is that it drives meaningful focus. It helps us organize our ideas and have better discussions by forcing specificity and bringing linkages between key business drivers to the foreground. Innovation requires one hand being very focused on a fundamental need or problem while the other hand quickly tests different solutions. For this, the Business Model Canvas is very innovation friendly: It's a lot easier to tweak the model and try things with something that's sitting on a single page\n\nIn this course, developed at the Darden School of Business at the University of Virginia and taught by top-ranked faculty, you’ll learn key tools from the worlds of design thinking and Lean Startup to approach the Canvas with thoughtfulness, focus, and above all a test-driven approach to business model innovation.\n\nSHOW ALL ABOUT INNOVATING WITH THE BUSINESS MODEL CANVAS\nSHOW ALL"
    },
    "/specializations/getting-started-with-google-workspace",
    {
       "Url":"/learn/gmail?specialization=getting-started-with-google-workspace",
       "name":"Gmail",
       "Rating":"Gmail\n4.9\nstars\n103 ratings\n•\n19 reviews\n\nGmail is Google’s cloud based email service that allows you to access your messages from any computer or device with just a web browser.\n\nIn this course, you’ll learn how to compose, send and reply to messages. You will also explore some of the common actions that can be applied to a Gmail message, and learn how to organize your mail using Gmail labels.\n\nYou will explore some common Gmail settings and features. For example, you will learn how to manage your own personal contacts and groups, customize your Gmail Inbox to suit your way of working, and create your own email signatures and templates.\n\nGoogle is famous for search. Gmail also includes powerful search and filtering. You will explore Gmail’s advanced search and learn how to filter messages automatically.\n\nSHOW ALL ABOUT GMAIL\nSHOW ALL"
    },
    {
       "Url":"/learn/google-calendar?specialization=getting-started-with-google-workspace",
       "name":"Google Calendar",
       "Rating":"Google Calendar\n4.8\nstars\n46 ratings\n•\n7 reviews\n\nWith Google Calendar, you can quickly schedule meetings and events and get reminders about upcoming activities, so you always know what’s next. Google Calendar is designed for teams, so it’s easy to share your schedule with others and create multiple calendars that you and your team can use together.\n\nIn this course, you’ll learn how to create and manage Google Calendar events.You will learn how to update an existing event, delete and restore events, and search your calendar.\n\nYou will understand when to apply different event types such as reminders, tasks, and appointment slots.\n\nYou will explore the Google Calendar settings that are available for you to customize Google Calendar to suit your way of working.\n\nDuring the course you will learn how to create additional calendars, share your calendars with others, and access other calendars in your organization.\n\nSHOW ALL ABOUT GOOGLE CALENDAR\nSHOW ALL"
    },
    {
       "Url":"/learn/google-drive?specialization=getting-started-with-google-workspace",
       "name":"Google Drive",
       "Rating":"Google Drive\n4.9\nstars\n36 ratings\n•\n7 reviews\n\nGoogle Drive is Google’s cloud-based file storage service. Google Drive lets you keep all your work in one place, view different file formats without the need for additional software, and access your files from any device.\n\nIn this course, you will learn how to navigate your Google Drive. You will learn how to upload files and folders and how to work across file types. You will also learn how you can easily view, arrange, organize, modify, and remove files in Google Drive. \n\nGoogle Drive includes shared drives. You can use shared drives to store, search, and access files with a team. You will learn how to create a new shared drive, add and manage members, and manage the shared drive content. \n\nGoogle Workspace is synonymous with collaboration and sharing. You will explore the sharing options available to you in Google Drive, and you will learn about the various collaborator roles and permissions that can be assigned.\n\nYou’ll also explore ways to ensure consistency and save time with templates.\n\nGoogle Drive has several tools and options available. This course discusses some of these options, including how to work offline, use Drive File Stream, and install apps from the Google Workspace Marketplace.\n\nSHOW ALL ABOUT GOOGLE DRIVE\nSHOW ALL"
    },
    {
       "Url":"/learn/google-docs?specialization=getting-started-with-google-workspace",
       "name":"Google Docs",
       "Rating":"Google Docs\n4.8\nstars\n32 ratings\n•\n9 reviews\n\nWith Google Docs, your documents are stored in the cloud, and you can access them from any computer or device. You create and edit documents right in your web browser; no special software is required. Even better, multiple people can work at the same time, you can see people’s changes as they make them, and every change is saved automatically.\n\nIn this course, you will learn how to open Google Docs, create and format a new document, and apply a template to a new document.\n\nYou will learn how to enhance your documents using a table of contents, headers and footers, tables, drawings, images, and more.\n\nYou will learn how to share your documents with others. We will discuss your sharing options and examine collaborator roles and permissions. You will learn how to manage versions of your documents.\n\nGoogle Docs allows you to work in real time with others on the same document. You will learn how to create and manage comments and action items in your documents.\n\nWe will review a few of the Google Docs tools. You will understand how to set your preferences to suit your own work style and explore how to use tools such as Google Explore to add value to your content.\n\nSHOW ALL ABOUT GOOGLE DOCS\nSHOW ALL"
    },
    {
       "Url":"/learn/google-sheets?specialization=getting-started-with-google-workspace",
       "name":"Google Sheets",
       "Rating":"Google Sheets\n4.9\nstars\n40 ratings\n•\n9 reviews\n\nIn this course we will introduce you to Google Sheets, Google’s cloud-based spreadsheet software, included with Google Workspace.\n\nWith Google Sheets, you can create and edit spreadsheets directly in your web browser—no special software is required. \n\nMultiple people can work simultaneously, you can see people’s changes as they make them, and every change is saved automatically.\n\nYou will learn how to open Google Sheets, create a blank spreadsheet, and create a spreadsheet from a template. You will add, import, sort, filter and format your data using Google Sheets and learn how to work across different file types.\n\nFormulas and functions allow you to make quick calculations and better use your data. We will look at creating a basic formula, using functions, and referencing data. You will also learn how to add a chart to your spreadsheet.\n\nGoogle Sheets spreadsheets are easy to share. We will look at the different ways you can share with others. We will also discuss how to track changes and manage versions of your Google Sheets spreadsheets.\n\nGoogle Workspace makes it easy to collaborate with your team, clients, and others wherever they are. We will look at some of the collaboration options available to you in Google Sheets. Examples include commenting, action items, and notifications.\n\nSHOW ALL ABOUT GOOGLE SHEETS\nSHOW ALL"
    },
    {
       "Url":"/learn/google-slides?specialization=getting-started-with-google-workspace",
       "name":"Google Slides",
       "Rating":"Google Slides\n4.9\nstars\n21 ratings\n•\n3 reviews\n\nWith Google Slides, you can create and present professional presentations for sales, projects, training modules, and much more. \n\nGoogle Slides presentations are stored safely in the cloud. You build presentations right in your web browser—no special software is required. Even better, multiple people can work on your slides at the same time, you can see people’s changes as they make them, and every change is automatically saved.\n\nYou will learn how to open Google Slides, create a blank presentation, and create a presentation from a template. You will explore themes, layout options, and how to add and format content, and speaker notes in your presentations.\n\nYou will learn how to enhance your slides by adding tables, images, charts, and more. You will also learn how to use slide transitions and object animations in your presentation for visual effects.\n\nWe will discuss how to organize slides and explore some of the options, including duplicating and ordering your slides, importing existing slides, copying slides, and hiding slides.\n\nYou will learn how to share your presentation with others and will also learn about collaborator permissions, tracking changes, and version management.\n\nGoogle Slides offers many features that make team collaboration easy. You will learn how to collaborate with your team using comments and action items. \n\nPresenting your slides is the ultimate goal so you will learn how to present your slides to others and explore the presentation tools available.\n\nSHOW ALL ABOUT GOOGLE SLIDES\nSHOW ALL"
    },
    {
       "Url":"/learn/google-meet-and-google-chat?specialization=getting-started-with-google-workspace",
       "name":"Google Meet and Google Chat",
       "Rating":"Google Meet and Google Chat\n5.0\nstars\n23 ratings\n\nIn this course we will introduce you to Google Meet and Google Chat, Google’s video conference and chat software included with Google Workspace. \n\nYou will learn how to create and manage video conference meetings using Google Meet. You will also explore how to use Google Chat for simple one-to-one and small group conversations, and how Chat rooms are used in Google Chat to better collaborate with others.\n\nYou will step into the Google Meet environment so that you become familiar with the different ways you can open Google Meet and add people to a video conference. We will also look at how to join a meeting from different sources such as a calendar event or meeting link.\n\nYou will learn how Google Meet can help you better communicate, exchange ideas, and share resources with your team wherever they are. \n\nWe will also discuss how to customize the Google Meet environment to fit your needs. We will talk about managing participants and how to effectively use chat messages during a video conference. We will explore the different ways to share resources, such as via calendar invites or attachments.\n\nWith Google Chat, you can use direct messaging to have a private conversation with a colleague or a small group of people. You will learn more about Google Chat’s unique features and how Google Chat can enhance your organization's ability to communicate and collaborate. \n\nDirect messages to a person or small group may be appropriate for impromptu conversations, but a chat room may be better suited for long-term conversations, particularly with a group that changes, or a large project team. You will explore the use of chat rooms in Google Chat.\n\nWe will look at some of the ways you can use Google Chat to effectively collaborate with others. We will look at how you can upload and share files with others from Google Chat.\n\nSHOW ALL ABOUT GOOGLE MEET AND GOOGLE CHAT\nSHOW ALL"
    },
    {
       "Url":"/learn/google-sheets---advanced-topics?specialization=getting-started-with-google-workspace",
       "name":"Google Sheets - Advanced Topics",
       "Rating":"Google Sheets - Advanced Topics\n4.7\nstars\n10 ratings\n\nThis course builds on some of the concepts covered in the earlier Google Sheets course.\n\nIn this course, you will learn how to apply and customize themes In Google Sheets, and explore conditional formatting options.\n\nYou will learn about some of Google Sheets’ advanced formulas and functions. You will explore how to create formulas using functions, and you will also learn how to reference and validate your data in a Google Sheet.\n\nSpreadsheets can hold millions of numbers, formulas, and text. Making sense of all of that data can be difficult without a summary or visualization. This course explores the data visualization options in Google Sheets, such as charts and pivot tables.\n\nGoogle Forms are online surveys used to collect data and provide the opportunity for quick data analysis. You will explore how Forms and Sheets work together by connecting collected Form data to a spreadsheet, or by creating a Form from an existing spreadsheet.\n\nSHOW ALL ABOUT GOOGLE SHEETS - ADVANCED TOPICS\nSHOW ALL"
    },
    "/specializations/leading-teams",
    {
       "Url":"/learn/motivate-people-teams?specialization=leading-teams",
       "name":"Inspiring and Motivating Individuals",
       "Rating":"Inspiring and Motivating Individuals\n4.8\nstars\n4,581 ratings\n•\n983 reviews\n\nIn this course, you will learn how to create a shared vision for your team and effectively communicate it to your teammates. You will also learn how to set effective goals and expectations in a way that best enables your team to attain the shared vision. Finally, you will understand the most important needs and drivers of performance across cultures, and will learn to align rewards with desired behaviors so that your teammates are motivated to attain the team’s objectives. \n\nMotivation represents a crucial challenge for contemporary organizations: A recent Gallup poll revealed that only 13% of workers worldwide exhibit high levels of engagement and motivation. We will show you why these motivation problems are not simply due to a “bad” or “unmotivated” team member. Rather, motivation is very much driven by what work conditions we create for our teammates, how we structure goals and objectives, and how we reward people for the accomplishment of those goals. This course will help you diagnose and solve motivation problems so that you can bring out the best in your people.\n\nSHOW ALL ABOUT INSPIRING AND MOTIVATING INDIVIDUALS\nSHOW ALL"
    },
    {
       "Url":"/learn/managing-talent?specialization=leading-teams",
       "name":"Managing Talent",
       "Rating":"Managing Talent\n4.6\nstars\n1,967 ratings\n•\n306 reviews\n\nIn this course, you will learn best practices for selecting, recruiting, and onboarding talent. You will also learn about the key approaches to measuring performance and evaluating your employees. In addition, you will learn how to develop and coach your talent so that they can realize their full potential at work. Altogether, you will gain a thorough understanding of the complete cycle of managing talent and creating a robust talent pipeline for your team and organization.\n\nManaging and developing talent is one of the top 3 issues on the minds of CEOs from around the world. In fact, CEOs cite managing and developing their leadership talent as the issue that is most important to the future success of their business but that their organizations are least capable of addressing effectively. This course will provide you with the insights, frameworks and tools to effectively manage and develop talent in your teams and organizations.\n\nSHOW ALL ABOUT MANAGING TALENT\nSHOW ALL"
    },
    {
       "Url":"/learn/influencing-people?specialization=leading-teams",
       "name":"Influencing People",
       "Rating":"Influencing People\n4.7\nstars\n3,559 ratings\n•\n705 reviews\n\nThis course will improve your ability to influence people in situations where you cannot use formal authority. You will learn about effective ways to build, develop, and sustain a power base in your organization. You will also learn influence tactics that enable you to be more persuasive and influential in working with your superiors, peers, and even subordinates. In addition, you will learn how to build and maintain high-quality relationships to further maximize your informal power and ability to influence others. Importantly, you will distinguish between influence and manipulation and learn how to protect yourself from the unwanted influence of others.\n\nThe influence strategies you learn in this course will make you a more confident and influential leader, presenter, and decision-maker. You will more effective in pitching business ideas to your superiors, influencing customers, and building coalitions across stakeholders. This course will not only give you strategic guidance on how to develop and maintain your network for influence and power, but we will also equip you with specific tactics and strategies that are proven to work for gaining power and influencing people.\n\nSHOW ALL ABOUT INFLUENCING PEOPLE\nSHOW ALL"
    },
    {
       "Url":"/learn/leading-teams?specialization=leading-teams",
       "name":"Leading Teams",
       "Rating":"Leading Teams\n4.8\nstars\n1,796 ratings\n•\n324 reviews\n\nIn this course, you will learn how to build your team, improve teamwork and collaboration, and sustain team performance through continuous learning and improvement. Specifically, you will learn best practices for composing a team and aligning individual and team goals. You will also learn how to establish roles, build structures, and manage decision making so that your team excels. This course will also help you manage critical team processes such as conflict resolution and building trust that have a profound impact on your team’s performance. You will discuss some of the best ways to harness the productive potential of teams while mitigating the risks and traps of teamwork.\n\nIn modern organization, most of work is done in teams, yet the results of teamwork are exceptionally mixed. Many teams are poorly designed and structured, fraught with dysfunctional conflict, experience coordination breakdowns and serious motivation challenges. As a result, many teams fail to realize their potential and frequently underperform even individuals working on similar tasks. After completing this course, you will acquire a set of tools and practices that enable you to effectively set up, run, evaluate, and continuously improve your team. Such insights will both make you a more effective team leader but also a standout contributor in team settings.\n\nSHOW ALL ABOUT LEADING TEAMS\nSHOW ALL"
    },
    {
       "Url":"/learn/leading-teams-project?specialization=leading-teams",
       "name":"Leading People and Teams Capstone",
       "Rating":"Leading People and Teams Capstone\n4.8\nstars\n360 ratings\n•\n65 reviews\n\nInterviews in organizations constitute a cornerstone of talent selection and promotion practices. One of the key goals of the interview process is to understand how you would approach a variety of leadership challenges at work, given your knowledge, expertise, and prior work experience. Within the context of this interview, your primary objective for the capstone assignment is to use content from the specialization to demonstrate your knowledge of key leadership skills.\n\nThe benefits of incorporating the specialization content into your interview responses extend well beyond the Leading People and Teams Specialization. Thinking about your past work experiences using the concepts, tools, and frameworks you learned in the specialization will enable you to reflect more deeply on your past actions and their outcomes. \n\nFurthermore, we selected questions for the mock interview from actual job interviews. In other words, in your future interviews, it is likely you will be asked similar questions. Thus, by working through the capstone, you will be investing in your own interview preparation and increasing the likelihood of performing well in your future interviews.\n\nSHOW ALL ABOUT LEADING PEOPLE AND TEAMS CAPSTONE\nSHOW ALL"
    },
    "/specializations/real-world-product-management",
    {
       "Url":"/learn/the-business-of-product-management-one?specialization=real-world-product-management",
       "name":"The Business of Product Management I",
       "Rating":"The Business of Product Management I\n4.6\nstars\n277 ratings\n•\n157 reviews\n\nSponsored by AMAZON WEB SERVICES (AWS). Learn real-world PM lessons from Amazon, Intuit, Procter and Gamble, Barnes and Noble, Whole Foods, Google, Mint Mobile, Juicero, Twitter, Tesla, Dropbox, Eventbrite, Blue, Samson, Coffee Meets Bagel, Mixpanel, and more!\n\nFeaturing NANCY WANG, Head of Data Protection Services, Amazon Web Services; Founder and CEO, Advancing Women in Product; WAYNE DUSO, Vice President for Edge Computing, File Services, and Data Services, Amazon Web Services; ARUM KANG, Co-Founder & CEO, Coffee Meets Bagel; and AMIR MOVAFAGHI, CEO, Mixpanel; former Global Head of Business of Operations, Twitter.\n\nSHOW ALL ABOUT THE BUSINESS OF PRODUCT MANAGEMENT I\nSHOW ALL"
    },
    {
       "Url":"/learn/real-world-product-management-skills?specialization=real-world-product-management",
       "name":"The Business of Product Management II",
       "Rating":"The Business of Product Management II\n4.7\nstars\n83 ratings\n•\n40 reviews\n\nSponsored by AMAZON WEB SERVICES (AWS). Learn real-world PM lessons from Amazon, Tesla, Uber, WeWork, Zoom, the United States Armed Forces, Facebook, Google, Alphabet, Poshmark, Slack, Twitter, Headspace, Walmart Labs, Humana, Schwab, Allianz, Amex, Grohe, Amazon, Costco, Progressive, Activision, Yelp, H&M, Basecamp, Microsoft, and more!\n\nFeaturing NANCY WANG, Head of Data Protection Services, Amazon Web Services; Founder and CEO, Advancing Women in Product; VERONICA PINCHIN, Director of Product Management, Sidewalk Labs; KATE ZHANG, Product Manager, Instagram; and BARKHA SAXENA, Chief Data Officer, Poshmark.\n\nSHOW ALL ABOUT THE BUSINESS OF PRODUCT MANAGEMENT II\nSHOW ALL"
    },
    {
       "Url":"/learn/pms-leading-design-engineering-ai-ml?specialization=real-world-product-management",
       "name":"The Art & Science of Product Management",
       "Rating":"The Art & Science of Product Management\n4.6\nstars\n52 ratings\n•\n26 reviews\n\nSponsored by AMAZON WEB SERVICES (AWS). Learn how Amazon, Facebook, Google, and Twitch PMs and lead and collaborate with an interdisciplinary team of UX designers, software engineers, AI/ML engineers. Plus, practice real PM interview questions asked by Microsoft, Google, and Amazon!\n\nFeaturing NANCY WANG, Head of Data Protection Services, Amazon Web Services; Founder and CEO, Advancing Women in Product; SANDY CARTER, Vice President for Worldwide Public Sector Programs, Amazon Web Services; PRANAVA ADDURI, Software Engineering Manager, Amazon Web Services; MINMIN YANG, Principal UX Lead, Amazon Web Services; WAHAB OWOLABI, Founder, OneReq; Diversity Business Partner, Facebook; SHARMEEN CHAPP, Vice President of Product & Engineering, Twitch Community; EJ EMEAGWALI, Product Manager, Samsara; former Product Manager, Google and Microsoft; \nSTEPHANIE NEILL, Senior Director of Product, Twitch Commerce; GEORGE ELISSAOIS, General Manager & Director of Product Management, Amazon Web Services; NANCY RILEY, Vice President & General Manager of the Ecosystem Product Group, Hubspot, and SABRINA FARMER, Vice President of Engineering for Site Reliability, Google Products.\n\nSHOW ALL ABOUT THE ART & SCIENCE OF PRODUCT MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/acing-product-management-interviews?specialization=real-world-product-management",
       "name":"Acing the Product Management Interview",
       "Rating":"Acing the Product Management Interview\n4.7\nstars\n49 ratings\n•\n25 reviews\n\nSponsored by AMAZON WEB SERVICES (AWS). Apply your PM knowledge by answering real PM interview questions asked by Facebook, Microsoft, Google, and Amazon!\n\nFeaturing NANCY WANG, Head of Data Protection Services, Amazon Web Services; Founder and CEO, Advancing Women in Product; BOB O'BRIEN, Senior Product Manager, Amazon Web Services; JENNY TAI, Director of Product, Jam City; NANCY GESSLER, Product Management, Learning Products, Amazon Web Services; TATYANA MAMUT, Chief Product Officer, Nextdoor; and SANDY CARTER, Vice President for Worldwide Public Sector Programs, Amazon Web Services.\n\nSHOW ALL ABOUT ACING THE PRODUCT MANAGEMENT INTERVIEW\nSHOW ALL"
    },
    "/specializations/integrative-health-and-medicine",
    {
       "Url":"/learn/integrative-therapies-and-healing-practices?specialization=integrative-health-and-medicine",
       "name":"Introduction to Integrative Therapies and Healing Practices",
       "Rating":"Introduction to Integrative Therapies and Healing Practices\n4.7\nstars\n336 ratings\n•\n124 reviews\n\nThis introductory course provides a framework for incorporating integrative therapies into your work with clients or patients.  By the end of the course, you will be able to assess if integrative therapies are good options in specific situations, as well as educate patients and colleagues about benefits and risks.  You will be confident discussing the evidence base for integrative therapies in general, with an understanding of some of the challenges of research in this area, and able to identify reliable sources of evidence-based information. You will leave with the skills to  partner with patients or clients around use of  these therapies and a plan to introduce integrative therapies in your work or other setting.\n\nContinuing Education Credit\nThis course has been designed to meet Minnesota Board of Nursing continuing education requirements for 15 contact hours and may be eligible for CE credit from other professional boards that allow self-documenting of continuing education activities. It is your responsibility to check with your regulatory board to confirm this course meets your local requirements and, if necessary, to provide them with the certificate of completion you get if you pay for and fulfill all the requirements of this course. This course is also approved by ICHWC (Health Coaching) for 15 continuing education units (CEP # 100057).\n\nSHOW ALL ABOUT INTRODUCTION TO INTEGRATIVE THERAPIES AND HEALING PRACTICES\nSHOW ALL"
    },
    {
       "Url":"/learn/guided-imagery?specialization=integrative-health-and-medicine",
       "name":"Guided Imagery",
       "Rating":"Guided Imagery\n4.8\nstars\n156 ratings\n•\n58 reviews\n\nIn this course, you will learn how you can use imagery and imagery interventions to help with symptom management and healing, as well as to enhance overall health and wellbeing. You will experience a variety of imagery interventions and evaluate how they might be helpful in providing relief or enhancing quality of life.  By the end of the course, you will know how to assess if guided imagery is appropriate in specific situations or with specific patients. You will be able to find and evaluate guided imagery scripts and recordings you might use.  Most importantly, you will learn how to write and record effective guided imagery scripts of your own for specific needs at work or in your personal life.\n\nContinuing Education Credit\nThis course has been designed to meet Minnesota Board of Nursing continuing education requirements for 14.5 contact hours and may be eligible for CE credit from other professional boards that allow self-documenting of continuing education activities. It is your responsibility to check with your regulatory board to confirm this course meets your local requirements and, if necessary, to provide them with the certificate of completion you get if you pay for and fulfill all the requirements of this course.\n\nThis course is also approved by ICHWC (Health Coaching) for 14.5 continuing education units (CEP # 100057).\n\nSHOW ALL ABOUT GUIDED IMAGERY\nSHOW ALL"
    },
    {
       "Url":"/learn/herbalmedicine?specialization=integrative-health-and-medicine",
       "name":"Herbal Medicine",
       "Rating":"Herbal Medicine\n4.9\nstars\n545 ratings\n•\n224 reviews\n\nThere is strong demand for alternatives to pharmaceuticals for a variety of common illnesses due to concerns of safety, efficacy, and a desire for more “natural” products. Despite this growing interest, “conventional” healthcare providers may have little to no knowledge about herbal medicines, which is further compounded by the sometimes misleading information in the media and on the internet. This course provides the necessary background for providers to begin to incorporate herbal medicines into their practice, particularly in regards to their therapeutic properties, efficacy (or lack thereof), and safety concerns, including quality control and potential adverse effects.\n\nContinuing Education Credit\nThis course has been designed to meet Minnesota Board of Nursing continuing education requirements for 16 contact hours and may be eligible for CE credit from other professional boards that allow self-documenting of continuing education activities. It is your responsibility to check with your regulatory board to confirm this course meets your local requirements and, if necessary, to provide them with the certificate of completion you get if you pay for and fulfill all the requirements of this course.\n\nSHOW ALL ABOUT HERBAL MEDICINE\nSHOW ALL"
    },
    {
       "Url":"/learn/aromatherapy-clinical-use-essential-oils?specialization=integrative-health-and-medicine",
       "name":"Aromatherapy: Clinical Use of Essential Oils",
       "Rating":"Aromatherapy: Clinical Use of Essential Oils\n4.8\nstars\n350 ratings\n•\n149 reviews\n\nThis course provides an overview of essential oil therapy and current aromatherapy practices in clinical settings and gives you the skills to bring aromatherapy into your own practice. By the end of the course, you will be able to: a) explain what essential oils are to a patient and how they work; b) assess if an essential oil might be beneficial to a patient, considering patient preference and the research evidence, as well as any safety issues or contraindications; and c) suggest a protocol for use in a clinical setting.\n\nContinuing Education Credits\nThis course has been designed to meet Minnesota Board of Nursing continuing education requirements for 15 contact hours and may be eligible for CE credit from other professional boards that allow self-documenting of continuing education activities. It is your responsibility to check with your regulatory board to confirm this course meets your local requirements and, if necessary, to provide them with the certificate of completion you get if you pay for and fulfill all the requirements of this course.\n\nSHOW ALL ABOUT AROMATHERAPY: CLINICAL USE OF ESSENTIAL OILS\nSHOW ALL"
    },
    {
       "Url":"/learn/mindfulness-integrative-healthcare?specialization=integrative-health-and-medicine",
       "name":"Mindfulness in Integrative Healthcare",
       "Rating":"Mindfulness in Integrative Healthcare\n4.8\nstars\n179 ratings\n•\n72 reviews\n\nBy the end of this course, you will be able to assess when mindfulness may be helpful for your patients or clients, educate them about its potential benefits, and refer them to mindfulness programs and resources. To begin, you will explore what mindfulness is (and is not) through presentations and direct experience. You will also learn about the research supporting the benefits (and risks) of mindfulness for various conditions, as well as how to identify contraindications. Finally, you will learn about the benefits of this practice for you as a busy healthcare provider.\n\nContinuing Education Credit\nThis course has been designed to meet Minnesota Board of Nursing continuing education requirements for 10 contact hours and may be eligible for CE credit from other professional boards that allow self-documenting of continuing education activities. It is your responsibility to check with your regulatory board to confirm this course meets your local requirements and, if necessary, to provide them with the certificate of completion you get if you pay for and fulfill all the requirements of this course.\n\nSHOW ALL ABOUT MINDFULNESS IN INTEGRATIVE HEALTHCARE\nSHOW ALL"
    },
    "/specializations/influencing-storytelling-change-management",
    {
       "Url":"/learn/change-management?specialization=influencing-storytelling-change-management",
       "name":"Leading transformations: Manage change",
       "Rating":"Leading transformations: Manage change\n4.7\nstars\n779 ratings\n•\n209 reviews\n\nWe live in a globalised world of continuous change. Your ability to successfully manage change will allow you to have a positive impact on your work and your life. Via structured learning activities (video lectures, quizzes, discussion prompts and written assessment) this course will teach you how to effectively influence change by developing a ‘change mindset’, creating a productive change cycle, and leading yourself and others on the change journey. You will learn how to re-imagine change by redefining the change problem and developing a balanced and reflective change mindset. Change is inevitable but you can influence how it affects your organisation.\n\nSHOW ALL ABOUT LEADING TRANSFORMATIONS: MANAGE CHANGE\nSHOW ALL"
    },
    {
       "Url":"/learn/negotiation-skills-conflict?specialization=influencing-storytelling-change-management",
       "name":"Negotiation skills: Negotiate and resolve conflict",
       "Rating":"Negotiation skills: Negotiate and resolve conflict\n4.7\nstars\n346 ratings\n•\n95 reviews\n\nModern organisations are characterised by increasingly higher levels of uncertainty, complexity and diversity. In our current globalised work environment, how can you manage the power and politics that persistently influence organisational decision-making? Being savvy about organisational politics and having the nous to negotiate and resolve conflict is a critical capability for managers at all levels. This course will develop your negotiation and conflict resolution skills – crucial to becoming a positive influence in your organisation. Via structured learning activities (video lectures, quizzes, discussion prompts and written assessments) you will conceptualise and measure power and politics; analyse and develop strategies for influencing stakeholders; and learn how to act with integrity and purpose when ‘playing politics’.\n\nSHOW ALL ABOUT NEGOTIATION SKILLS: NEGOTIATE AND RESOLVE CONFLICT\nSHOW ALL"
    },
    {
       "Url":"/learn/communicate-with-impact?specialization=influencing-storytelling-change-management",
       "name":"Storytelling and influencing: Communicate with impact",
       "Rating":"Storytelling and influencing: Communicate with impact\n4.8\nstars\n850 ratings\n•\n291 reviews\n\nAn ambitious vision for the future of your organisation isn’t enough – how do you communicate this vision to get your colleagues on board? The ability to effectively communicate and persuade others is a key leadership skill. Traditional and common-sense models of communication and persuasion often fail to capture the complex nature of ‘influencing’. Via structured learning activities (video lectures, quizzes, discussion prompts and written assessments) this course will develop your capacity to communicate appropriately in different situational and cultural contexts, making you a highly influential leader.\n\nSHOW ALL ABOUT STORYTELLING AND INFLUENCING: COMMUNICATE WITH IMPACT\nSHOW ALL"
    },
    {
       "Url":"/learn/risk-governance-engage-the-board?specialization=influencing-storytelling-change-management",
       "name":"Risk governance: Engage the board",
       "Rating":"Risk governance: Engage the board\n4.8\nstars\n106 ratings\n•\n38 reviews\n\nAll organisations must grapple with fundamental issues at the heart of governance: who are our stakeholders? What are their objectives? How can we ensure these objectives are met as effectively as possible? How can we ensure all legitimate stakeholders are treated fairly? Via structured learning activities (video lectures, quizzes, discussion prompts and written assessments) this course will teach you how to address these questions and how a sound governance structure and comprehensive risk management framework can support you and your organisation in achieving its objectives. You will consider contemporary ethical issues and devise practical responses to them, and finally, you’ll discover that your future ‘influencing’ challenge will be to encourage all members of your organisation to understand their role in serving your organisation’s stakeholders.\n\nSHOW ALL ABOUT RISK GOVERNANCE: ENGAGE THE BOARD\nSHOW ALL"
    },
    "/specializations/applied-data-science-r",
    {
       "Url":"/learn/introducton-r-programming-data-science?specialization=applied-data-science-r",
       "name":"Introduction to R Programming for Data Science",
       "Rating":"Introduction to R Programming for Data Science\n4.6\nstars\n50 ratings\n•\n15 reviews\n\nWhen working in the data science field you will definitely become acquainted with the R language and the role it plays in data analysis. This course introduces you to the basics of the R language such as data types, techniques for manipulation, and how to implement fundamental programming tasks. \n\nYou will begin the process of understanding common data structures, programming fundamentals and how to manipulate data all with the help of the R programming language. \n\nThe emphasis in this course is hands-on and practical learning . You will write a simple program using RStudio, manipulate data in a data frame or matrix, and complete a final project as a data analyst using Watson Studio and Jupyter notebooks to acquire and analyze data-driven insights.  \n \n\nNo prior knowledge of R, or programming is required.\n\nSHOW ALL ABOUT INTRODUCTION TO R PROGRAMMING FOR DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/sql-data-science-r?specialization=applied-data-science-r",
       "name":"SQL for Data Science with R",
       "Rating":"SQL for Data Science with R\n3.8\nstars\n12 ratings\n•\n2 reviews\n\nMuch of the world's data resides in databases. SQL (or Structured Query Language) is a powerful language which is used for communicating with and extracting data from databases. A working knowledge of databases and SQL is a must if you want to become a data scientist.\n\nThe purpose of this course is to introduce relational database concepts and help you learn and apply foundational knowledge of the SQL and R languages. It is also intended to get you started with performing SQL access in a data science environment.  \n\nThe emphasis in this course is on hands-on and practical learning . As such, you will work with real databases, real data science tools, and real-world datasets. You will create a database instance in the cloud. Through a series of hands-on labs you will practice building and running SQL queries. You will also learn how to access databases from Jupyter notebooks using SQL and R.\n\nNo prior knowledge of databases, SQL, R, or programming is required.\n\nAnyone can audit this course at no-charge. If you choose to take this course and earn the Coursera course certificate, you can also earn an IBM digital badge upon successful completion of the course.\n\nSHOW ALL ABOUT SQL FOR DATA SCIENCE WITH R\nSHOW ALL"
    },
    {
       "Url":"/learn/data-analysis-with-r?specialization=applied-data-science-r",
       "name":"Data Analysis with R",
       "Rating":"Data Analysis with R\n5.0\nstars\n14 ratings\n•\n2 reviews\n\nThe R programming language is purpose-built for data analysis. R is the key that opens the door between the problems that you want to solve with data and the answers you need to meet your objectives.  This course starts with a question and then walks you through the process of answering it through data. You will first learn important techniques for preparing (or wrangling) your data for analysis. You will then learn how to gain a better understanding of your data through exploratory data analysis, helping you to summarize your data and identify relevant relationships between variables that can lead to insights. Once your data is ready to analyze, you will learn how to develop your model and evaluate and tune its performance. By following this process, you can be sure that your data analysis performs to the standards that you have set, and you can have confidence in the results. \n\nYou will build hands-on experience by playing the role of a data analyst who is analyzing airline departure and arrival data to predict flight delays. Using an Airline Reporting Carrier On-Time Performance Dataset, you will practice reading data files, preprocessing data, creating models, improving models, and evaluating them to ultimately choose the best model. \n\nWatch the videos, work through the labs, and add to your portfolio. Good luck!\n\nNote: The pre-requisite for this course is basic R programming skills. For example, ensure that you have completed a course like Introduction to R Programming for Data Science from IBM.\n\nSHOW ALL ABOUT DATA ANALYSIS WITH R\nSHOW ALL"
    },
    {
       "Url":"/learn/data-visualization-r?specialization=applied-data-science-r",
       "name":"Data Visualization with R",
       "Rating":"Data Visualization with R\n\nIn this course, you will learn the Grammar of Graphics, a system for describing and building graphs, and how the ggplot2 data visualization package for R applies this concept to basic bar charts, histograms, pie charts, scatter plots, line plots, and box plots. You will also learn how to further customize your charts and plots using themes and other techniques. You will then learn how to use another data visualization package for R called Leaflet to create map plots, a unique way to plot data based on geolocation data. Finally, you will be introduced to creating interactive dashboards using the R Shiny package. You will learn how to create and customize Shiny apps, alter the appearance of the apps by adding HTML and image components, and deploy your interactive data apps on the web.\n\nYou will practice what you learn and build hands-on experience by completing labs in each module and a final project at the end of the course.\n\nWatch the videos, work through the labs, and watch your data science skill grow. Good luck!\n\nNOTE: This course requires knowledge of working with R and data. If you do not have these skills, it is highly recommended that you first take the Introduction to R Programming for Data Science as well as the Data Analysis with R courses from IBM prior to starting this course. Note: The pre-requisite for this course is basic R programming skills.\n\nSHOW ALL ABOUT DATA VISUALIZATION WITH R\nSHOW ALL"
    },
    {
       "Url":"/learn/data-science-with-r-capstone-project?specialization=applied-data-science-r",
       "name":"Data Science with R - Capstone Project",
       "Rating":"Data Science with R - Capstone Project\n\nIn this capstone course, you will apply various data science skills and techniques that you have learned as part of the previous courses in the IBM Data Science with R Specialization or IBM Data Analytics with Excel and R Professional Certificate.\n\nFor this project, you will assume the role of a Data Scientist who has recently joined an organization and be presented with a challenge that requires data collection, analysis, basic hypothesis testing, visualization, and modeling to be performed on real-world datasets. You will collect and understand data from multiple sources, conduct data wrangling and preparation with Tidyverse, perform exploratory data analysis with SQL, Tidyverse and ggplot2, model data with linear regression, create charts and plots to visualize the data, and build an interactive dashboard.\n\nThe project will culminate with a presentation of your data analysis report, with an executive summary for the various stakeholders in the organization.\n\nSHOW ALL ABOUT DATA SCIENCE WITH R - CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/scala",
    {
       "Url":"/learn/scala-functional-programming?specialization=scala",
       "name":"Functional Programming Principles in Scala",
       "Rating":"Functional Programming Principles in Scala\n4.8\nstars\n7,864 ratings\n•\n1,605 reviews\n\nFunctional programming is becoming increasingly widespread in industry. This trend is driven by the adoption of Scala as the main programming language for many applications. Scala fuses functional and object-oriented programming in a practical package. It interoperates seamlessly with both Java and Javascript. Scala is the implementation language of many important frameworks, including Apache Spark, Kafka, and Akka. It provides the core infrastructure for sites such as Twitter, Netflix, Zalando, and also Coursera.\n\nIn this course, you will discover the elements of the functional programming style and learn how to apply them usefully in your daily programming tasks, such as modeling business domains or implementing business logic. You will also develop a solid foundation for reasoning about functional programs, by touching upon proofs of invariants and the tracing of execution symbolically.\n\nThe course is hands-on; most units introduce short programs that serve as illustrations of important concepts and invite you to play with them, modifying and improving them. The course is complemented by a series of programming projects as homework assignments.\n\nRecommended background: You should have at least one year of programming experience. Proficiency with Java or C# is ideal, but experience with other languages such as C/C++, Python, Javascript, or Ruby is also sufficient. You should have some familiarity using the command line.\n\nSHOW ALL ABOUT FUNCTIONAL PROGRAMMING PRINCIPLES IN SCALA\nSHOW ALL"
    },
    {
       "Url":"/learn/scala-functional-program-design?specialization=scala",
       "name":"Functional Program Design in Scala",
       "Rating":"Functional Program Design in Scala\n4.5\nstars\n3,055 ratings\n•\n522 reviews\n\nIn this course you will learn how to apply the functional programming style in the design of larger Scala applications. You'll get to know important new functional programming concepts, from lazy evaluation to structuring your libraries using monads. We'll work on larger and more involved examples, from state space exploration to random testing to discrete circuit simulators. You’ll also learn some best practices on how to write good Scala code in the real world. Finally, you will learn how to leverage the ability of the compiler to infer values from types.\n\nSeveral parts of this course deal with the question how functional programming interacts with mutable state. We will explore the consequences of combining functions and state. We will also look at purely functional alternatives to mutable state, using infinite data structures or functional reactive programming.\n\nRecommended background: You should have at least one year programming experience. Proficiency with Java or C# is ideal, but experience with other languages such as C/C++, Python, Javascript or Ruby is also sufficient. You should have some familiarity with using the command line. This course is intended to be taken after Functional Programming Principles in Scala: https://www.coursera.org/learn/progfun1.\n\nSHOW ALL ABOUT FUNCTIONAL PROGRAM DESIGN IN SCALA\nSHOW ALL"
    },
    {
       "Url":"/learn/scala-parallel-programming?specialization=scala",
       "name":"Parallel programming",
       "Rating":"Parallel programming\n4.4\nstars\n1,801 ratings\n•\n279 reviews\n\nWith every smartphone and computer now boasting multiple processors, the use of functional ideas to facilitate parallel programming is becoming increasingly widespread. In this course, you'll learn the fundamentals of parallel programming, from task parallelism to data parallelism. In particular, you'll see how many familiar ideas from functional programming map perfectly to to the data parallel paradigm. We'll start the nuts and bolts how to effectively parallelize familiar collections operations, and we'll build up to parallel collections, a production-ready data parallel collections library available in the Scala standard library. Throughout, we'll apply these concepts through several hands-on examples that analyze real-world data, such as popular algorithms like k-means clustering.\n\nLearning Outcomes. By the end of this course you will be able to:\n\n- reason about task and data parallel programs,\n- express common algorithms in a functional style and solve them in parallel,\n- competently microbenchmark parallel code,\n- write programs that effectively use parallel collections to achieve performance\n\nRecommended background: You should have at least one year programming experience. Proficiency with Java or C# is ideal, but experience with other languages such as C/C++, Python, Javascript or Ruby is also sufficient. You should have some familiarity using the command line. This course is intended to be taken after Functional Program Design in Scala: https://www.coursera.org/learn/progfun2.\n\nSHOW ALL ABOUT PARALLEL PROGRAMMING\nSHOW ALL"
    },
    {
       "Url":"/learn/scala-spark-big-data?specialization=scala",
       "name":"Big Data Analysis with Scala and Spark",
       "Rating":"Big Data Analysis with Scala and Spark\n4.7\nstars\n2,485 ratings\n•\n513 reviews\n\nManipulating big data distributed over a cluster using functional concepts is rampant in industry, and is arguably one of the first widespread industrial uses of functional ideas. This is evidenced by the popularity of MapReduce and Hadoop, and most recently Apache Spark, a fast, in-memory distributed collections framework written in Scala. In this course, we'll see how the data parallel paradigm can be extended to the distributed case, using Spark throughout. We'll cover Spark's programming model in detail, being careful to understand how and when it differs from familiar programming models, like shared-memory parallel collections or sequential Scala collections. Through hands-on examples in Spark and Scala, we'll learn when important issues related to distribution like latency and network communication should be considered and how they can be addressed effectively for improved performance.\n\nLearning Outcomes. By the end of this course you will be able to:\n\n- read data from persistent storage and load it into Apache Spark,\n- manipulate data with Spark and Scala,\n- express algorithms for data analysis in a functional style, \n- recognize how to avoid shuffles and recomputation in Spark,\n\nRecommended background: You should have at least one year programming experience. Proficiency with Java or C# is ideal, but experience with other languages such as C/C++, Python, Javascript or Ruby is also sufficient. You should have some familiarity using the command line. This course is intended to be taken after Parallel Programming: https://www.coursera.org/learn/parprog1.\n\nSHOW ALL ABOUT BIG DATA ANALYSIS WITH SCALA AND SPARK\nSHOW ALL"
    },
    {
       "Url":"/learn/scala-capstone?specialization=scala",
       "name":"Functional Programming in Scala Capstone",
       "Rating":"Functional Programming in Scala Capstone\n4.4\nstars\n530 ratings\n•\n91 reviews\n\nIn the final capstone project you will apply the skills you learned by building a large data-intensive application using real-world data.\n\nYou will implement a complete application processing several gigabytes of data. This application will show interactive visualizations of the evolution of temperatures over time all over the world.\n\nThe development of such an application will involve:\n — transforming data provided by weather stations into meaningful information like, for instance, the average temperature of each point of the globe over the last ten years ;\n — then, making images from this information by using spatial and linear interpolation techniques ;\n — finally, implementing how the user interface will react to users’ actions.\n\nSHOW ALL ABOUT FUNCTIONAL PROGRAMMING IN SCALA CAPSTONE\nSHOW ALL"
    },
    "/specializations/introduction-intellectual-property",
    {
       "Url":"/learn/introduction-intellectual-property?specialization=introduction-intellectual-property",
       "name":"Introduction to Intellectual Property",
       "Rating":"Introduction to Intellectual Property\n4.8\nstars\n591 ratings\n•\n122 reviews\n\nIntellectual property is the currency of the tech world, with the world’s most valuable intellectual property assets dwarfing the value of their real-world counterparts. Apple’ trademarked brand was valued at over $100 billion as of 2017. J.K. Rowling’s Harry potter franchise has generated over $25 billion to date. But how did the law come to create such enormous value in intangible assets?\n\nThis course will introduce the various types of U.S. intellectual property: patents, which cover inventions and process innovations; copyright, which protects original works of authorship; and trademarks, which protect a business’ commercial identity as the source of valuable goods and services. You will then explore case studies of how global businesses have used intellectual property law to generate enormous value from these intangible assets.\n\nSHOW ALL ABOUT INTRODUCTION TO INTELLECTUAL PROPERTY\nSHOW ALL"
    },
    {
       "Url":"/learn/copyright-law?specialization=introduction-intellectual-property",
       "name":"Copyright Law",
       "Rating":"Copyright Law\n4.8\nstars\n210 ratings\n•\n41 reviews\n\nCopyright law is unique in the greater intellectual property regime, as it protects original expression that is fixed in a tangible medium and is the product of authorship.  This course is designed for creative professionals — such as screenwriters, musicians, documentary filmmakers or artists — who want to understand the scope and limits of which works can enjoy U.S. copyright protection. The course will introduce students to the workings of copyright law through an examination of the system’s basic principles, rules, and institutions. Topics will include; the justifications for copyright law, copyrightable subject matter, authorship, the nature and scope of copyright’s exclusive rights, fair use, and remedies for infringement. \n\nWe will also explore real-world examples of legal battles surrounding copyright law, from the recent litigation over Robin Thicke’s hit song “Blurred Lines” to more peculiar cases such as the infamous “monkey selfie” case. By understanding what copyright does and does not protect, producers of creative expression will be able to protect and maximize the commercial value of their works.\n\nSHOW ALL ABOUT COPYRIGHT LAW\nSHOW ALL"
    },
    {
       "Url":"/learn/trademark-law?specialization=introduction-intellectual-property",
       "name":"Trademark Law",
       "Rating":"Trademark Law\n4.8\nstars\n150 ratings\n•\n30 reviews\n\nThe protections afforded under trademark law have created incredible value in intangible assets, with the value of the world’s most valuable brands such as Amazon, Apple and Google each exceeding $100 billion. But what exactly is trademark law, and how is such enormous value created?\n\nThis course examines the fundamentals of U.S. trademark law and the ways in which the manufacturers of various products and services can establish and protect their identities and the identities of their products in the marketplace.  \n\nWe will explore the purpose of trademark law, identify the different types of trademarks, including names, designs, logos, and trade dress, and explore strategies for choosing and protecting strong, potentially valuable trademarks. We will also discuss strategies for strengthening descriptive marks, and lay out the steps for filing for federal trademark protection. Finally, we will address how to design an ongoing maintenance strategy to protect, extend, and maximize the value of trademarks, and discuss strategies for responding to possible trademark infringement.\n\nSHOW ALL ABOUT TRADEMARK LAW\nSHOW ALL"
    },
    {
       "Url":"/learn/patents?specialization=introduction-intellectual-property",
       "name":"Patent Law",
       "Rating":"Patent Law\n4.8\nstars\n168 ratings\n•\n32 reviews\n\nIn our modern technologically-based economy, the creation and enforcement of patent rights can make or break a business. With record numbers of patents being issued every year, the stakes for inventors (and, indeed, their lawyers) continue to rise, even as the patent law and its administration faces growing criticism. \n\nThis course begins with an examination of the fundamental justifications for and creation of U.S. patent rights as well as the relationship between patent law and other “intellectual property” concepts. We will then delve into the details of the U.S. requirements for patentability, and explore the scope of patent rights, again considering how the policies expressed reflect the justifications for patent rights. Then we will look at an actual patent document and analyze the different pieces of an issued patent with a special focus on the importance of patent claims. Finally, we will explore strategies for dealing with patent infringement.\n\nSHOW ALL ABOUT PATENT LAW\nSHOW ALL"
    },
    "/specializations/computational-neuroscience",
    {
       "Url":"/learn/neuroscience-neuroimaging?specialization=computational-neuroscience",
       "name":"Fundamental Neuroscience for Neuroimaging",
       "Rating":"Fundamental Neuroscience for Neuroimaging\n4.6\nstars\n1,734 ratings\n•\n404 reviews\n\nNeuroimaging methods are used with increasing frequency in clinical practice and basic research. Designed for students and professionals, this course will introduce the basic principles of neuroimaging methods as applied to human subjects research and introduce the neuroscience concepts and terminology necessary for a basic understanding of neuroimaging applications. Topics include the history of neuroimaging, an introduction to neuroimaging physics and image formation, as well as an overview of different neuroimaging applications, including functional MRI, diffusion tensor imaging, magnetic resonance spectroscopy, perfusion imaging, and positron emission tomography imaging. Each will be reviewed in the context of their specific methods, source of signal, goals, and limitations. The course will also introduce basic neuroscience concepts necessary to understand the implementation of neuroimaging methods, including structural and functional human neuroanatomy, cognitive domains, and experimental design.\n\nSHOW ALL ABOUT FUNDAMENTAL NEUROSCIENCE FOR NEUROIMAGING\nSHOW ALL"
    },
    {
       "Url":"/learn/functional-mri?specialization=computational-neuroscience",
       "name":"Principles of fMRI 1",
       "Rating":"Principles of fMRI 1\n4.6\nstars\n713 ratings\n•\n145 reviews\n\nFunctional Magnetic Resonance Imaging (fMRI) is the most widely used technique for investigating the living, functioning human brain as people perform tasks and experience mental states. It is a convergence point for multidisciplinary work from many disciplines. Psychologists, statisticians, physicists, computer scientists, neuroscientists, medical researchers, behavioral scientists, engineers, public health researchers, biologists, and others are coming together to advance our understanding of the human mind and brain.  This course covers the design, acquisition, and analysis of Functional Magnetic Resonance Imaging (fMRI) data, including psychological inference, MR Physics, K Space, experimental design, pre-processing of fMRI data, as well as Generalized Linear Models (GLM’s).  A book related to the class can be found here: https://leanpub.com/principlesoffmri.\n\nSHOW ALL ABOUT PRINCIPLES OF FMRI 1\nSHOW ALL"
    },
    {
       "Url":"/learn/functional-mri-2?specialization=computational-neuroscience",
       "name":"Principles of fMRI 2",
       "Rating":"Principles of fMRI 2\n4.7\nstars\n205 ratings\n•\n32 reviews\n\nFunctional Magnetic Resonance Imaging (fMRI) is the most widely used technique for investigating the living, functioning human brain as people perform tasks and experience mental states. It is a convergence point for multidisciplinary work from many disciplines. Psychologists, statisticians, physicists, computer scientists, neuroscientists, medical researchers, behavioral scientists, engineers, public health researchers, biologists, and others are coming together to advance our understanding of the human mind and brain.  This course covers the analysis of Functional Magnetic Resonance Imaging (fMRI) data.  It is a continuation of the course “Principles of fMRI, Part 1”.\n\nSHOW ALL ABOUT PRINCIPLES OF FMRI 2\nSHOW ALL"
    },
    {
       "Url":"/learn/neurohacking?specialization=computational-neuroscience",
       "name":"Introduction to Neurohacking In R",
       "Rating":"Introduction to Neurohacking In R\n4.6\nstars\n253 ratings\n•\n49 reviews\n\nNeurohacking describes how to use the R programming language (https://cran.r-project.org/) and its associated package to perform manipulation, processing, and analysis of neuroimaging data. We focus on publicly-available structural magnetic resonance imaging (MRI). We discuss concepts such as inhomogeneity correction, image registration, and image visualization.\n\nBy the end of this course, you will be able to:\n\nRead/write images of the brain in the NIfTI (Neuroimaging Informatics Technology Initiative) format\nVisualize and explore these images\nPerform inhomogeneity correction, brain extraction, and image registration (within a subject and to a template).\n\nSHOW ALL ABOUT INTRODUCTION TO NEUROHACKING IN R\nSHOW ALL"
    },
    "/specializations/microsoft-azure-fundamentals-az-900",
    {
       "Url":"/learn/microsoft-azure-cloud-services?specialization=microsoft-azure-fundamentals-az-900",
       "name":"Introduction to Microsoft Azure Cloud Services",
       "Rating":"Introduction to Microsoft Azure Cloud Services\n4.6\nstars\n347 ratings\n•\n65 reviews\n\nWhether you're just beginning to work with the cloud or you already have cloud experience and are new to Microsoft Azure, this course provides you with everything you need to get started. It introduces you to Microsoft Azure core concepts and services. You’ll learn the basics of cloud computing, its advantages, and how to choose the right Microsoft Azure solution for different business scenarios. You’ll use the Microsoft Azure portal and a sandbox to create and test Microsoft Azure resources at no cost to you. You don’t need to write code or have scripting skills to do this.\n\nYou’ll learn about several of the database and big data services that are available on Microsoft Azure. You'll also learn how to take advantage of several virtualization services in Microsoft Azure compute, which can help your applications scale out quickly and efficiently to meet increasing demands. Finally, you’ll learn about the different storage and virtual network options available in Microsoft Azure.\n\nThis course can help you prepare for AZ-900: Microsoft Azure Fundamentals exam. This is the first course in a four-course program that prepares you to take the AZ-900 certification exam. This course teaches you the core concepts and skills that are assessed in the cloud concepts and core Microsoft Azure services exam domains. \nThis beginner course is suitable for IT personnel who are just beginning to work with Microsoft Azure and want to learn about Microsoft Azure offerings and get hands-on experience with the product. \n\nTo be successful in this course, you need to have basic computer literacy and proficiency in the English language. You should be familiar with basic computing concepts and terminology,  general technology concepts, including concepts of networking, storage, compute, application support, and application development. You should also be familiar with the concept of application programming interfaces or APIs. It is beneficial to have a high-level familiarity with relevant Microsoft products such as Dynamics 365 and Office 365.\n\nSHOW ALL ABOUT INTRODUCTION TO MICROSOFT AZURE CLOUD SERVICES\nSHOW ALL"
    },
    {
       "Url":"/learn/microsoft-azure-management-security?specialization=microsoft-azure-fundamentals-az-900",
       "name":"Microsoft Azure Management Tools and Security Solutions",
       "Rating":"Microsoft Azure Management Tools and Security Solutions\n4.7\nstars\n92 ratings\n•\n10 reviews\n\nMicrosoft Azure offers a wide range of services to deploy your applications. To keep control of your environment and to make deployments easier, it also offers a wide array of management tools and services. In this course, you will be introduced to these tools and services and you will be asked to help choose the best one for a given business scenario. \n\nSome modules cover software development processes and services. You will learn about cloud monitoring solutions for your applications and infrastructure. As well as picking the right Microsoft Azure management tool depending on your technical needs. When you have completed this course, you will be able to choose the right serverless compute technology, Azure IoT service, or Azure Artificial Intelligence service.\n\nHaving a good security strategy is essential in today's digital world. Every application and service, whether on-premises or in the cloud, needs to be designed with security in mind. Security needs to happen at the application level, at the data level, and the network level.\n\nYou will learn about the various Microsoft Azure services you can use to help ensure that your cloud resources are safe, secure, and trusted. When you have completed this course, you will be able to identify security threats in Microsoft Azure, make security recommendations, and detect and respond to events using security and event management. From a developer perspective, you will look at how to secure your secrets and ensure that they are not exposed.\n\nYou will also examine network security scenarios such as firewalling, network security groups, and protecting yourself from distributed denial of service attacks. You will learn how to build a complete network security solution that brings all these tools together to secure your Microsoft Azure deployments and resources.\n\nWhen you have completed this course, you will be able to choose the best Microsoft Azure tools and services for a given business scenario. You will also be able to describe how to protect the workloads that you run both in the cloud and in your on-premises datacenter. \n\nThis beginner-level course is suitable for IT personnel who are just beginning to work with Microsoft Azure and want to learn about Microsoft Azure offerings and get hands-on experience with the product. \n\nThis course can help you prepare for AZ-900: Microsoft Azure Fundamentals exam. This is the second course in a four-course program that prepares you to take the AZ-900 certification exam. This course teaches you the core concepts and skills that are assessed in the Microsoft Azure management tools, and security solutions exam domains. \n\nTo be successful in this course, you need to have basic computer literacy and proficiency in the English language. You should be familiar with basic computing concepts and terminology,  general technology concepts, including concepts of networking, storage, compute, application support, and application development. You should also be familiar with the concept of application programming interfaces, or APIs. It is beneficial to have a high-level familiarity with relevant Microsoft products such as Dynamics 365 and Office 365.\n\nSHOW ALL ABOUT MICROSOFT AZURE MANAGEMENT TOOLS AND SECURITY SOLUTIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/microsoft-azure-services-lifecycles?specialization=microsoft-azure-fundamentals-az-900",
       "name":"Microsoft Azure Services and Lifecycles",
       "Rating":"Microsoft Azure Services and Lifecycles\n4.9\nstars\n55 ratings\n•\n8 reviews\n\nIn this course, you will learn how Microsoft Azure can help you secure access to cloud resources, what it means to build a cloud governance strategy, and how Microsoft Azure adheres to common regulatory and compliance standards.\n\nWith the rise of remote work, bring your own device (BYOD), mobile applications, and cloud applications, the primary security boundary has shifted from firewalls and physical access controls to identity.\n\nUnderstanding who is using your systems and what they have permission to do is critical to keeping your data safe from attackers. To stay organized, manage costs, and meet your compliance goals, you need a good cloud governance strategy.\n\nMigration to the cloud presents new ways to think about your IT expenses. The cloud also removes the burden of supporting IT infrastructure.\n\nAs you move to the cloud, you might ask:\n•\tHow much will it cost?\n•\tWhat guarantees does Microsoft Azure provide around uptime and connectivity?\n•\tHow do preview services impact my production applications?\n\nIn this course, you will also learn about the factors that influence cost, tools you can use to help estimate and manage your cloud spend, and how Microsoft Azure's service-level agreements (SLAs) can impact your application design decisions.\n\nThis course can help you prepare for AZ-900: Microsoft Azure Fundamentals exam. This is the third course in a four-course program that prepares you to take the AZ-900 certification exam. This course teaches you the core concepts and skills that are assessed in the Microsoft Azure identity services, and governance exam domains. \n\nThis beginner-level course is suitable for IT personnel who are just beginning to work with Microsoft Azure and want to learn about Microsoft Azure offerings and get hands-on experience with the product. \n\nTo be successful in this course, you need to have basic computer literacy and proficiency in the English language. You should be familiar with basic computing concepts and terminology,  general technology concepts, including concepts of networking, storage, compute, application support, and application development. You should also be familiar with the concept of application programming interfaces, or APIs. It is beneficial to have a high-level familiarity with relevant Microsoft products such as Dynamics 365 and Office 365.\n\nSHOW ALL ABOUT MICROSOFT AZURE SERVICES AND LIFECYCLES\nSHOW ALL"
    },
    {
       "Url":"/learn/az-900-exam-prep?specialization=microsoft-azure-fundamentals-az-900",
       "name":"Preparing for the AZ-900 Microsoft Azure Fundamentals Exam",
       "Rating":"Preparing for the AZ-900 Microsoft Azure Fundamentals Exam\n4.7\nstars\n72 ratings\n•\n14 reviews\n\nMicrosoft certifications give you a professional advantage by providing globally recognized and industry-endorsed evidence of mastering skills in digital and cloud businesses.​​ In this course, you will prepare for the AZ-900 Microsoft Azure Fundamentals exam. \n\nYou will refresh your knowledge of cloud concepts, Microsoft Azure services, Microsoft Azure workloads, security and privacy in Microsoft Azure, as well as Microsoft Azure pricing and support. in short, you will recap all the core concepts and skills that are measured by the exam.\n\nYou will test your knowledge in a series of practice exams​ mapped to all the main topics covered in the AZ-900 exam, ensuring you’re well prepared for certification success. You will prepare to pass the certification exam by taking practice tests with similar formats and content.\n\nYou will also get a more detailed overview of the Microsoft certification program and where you can go next in your career. You’ll also get tips and tricks, testing strategies, useful resources, and information on how to sign up for the AZ-900 proctored exam. By the end of this course, you will be ready to sign-up for and take the AZ-900 exam.​\n\nThis beginner course is suitable for IT personnel who are just beginning to work with Microsoft Azure and want to demonstrate foundational level knowledge of cloud services and how those services are provided with Microsoft Azure platforms.\n\nThis course can help you prepare for AZ-900: Microsoft Azure Fundamentals exam. This is the final course in a four-course program that prepares you to take the AZ-900 certification exam. This course gives you opportunities to hone your exam technique and refresh your knowledge of all the key areas assessed in the certification exam. \n\nTo be successful in this course, you need to have basic computer literacy and proficiency in the English language. You should be familiar with basic computing concepts and terminology,  general technology concepts, including concepts of networking, storage, compute, application support, and application development. You should also be Familiarity with the concept of application programming interfaces or APIs. It is beneficial to have a high-level familiarity with relevant Microsoft products such as Dynamics 365 and Office 365.\n\nSHOW ALL ABOUT PREPARING FOR THE AZ-900 MICROSOFT AZURE FUNDAMENTALS EXAM\nSHOW ALL"
    },
    "/specializations/branding-the-creative-journey",
    {
       "Url":"/learn/brand-identity-strategy?specialization=branding-the-creative-journey",
       "name":"Brand Identity and Strategy",
       "Rating":"Brand Identity and Strategy\n4.7\nstars\n503 ratings\n•\n152 reviews\n\nBrand identity and Strategy is a IE Business School course for those professionals who are ready to adopt a creative approach to empowering brands.\n\nStudents will go through a journey that starts with understanding what a brand is and how they can build successful ones, whilst simultaneously segmenting their consumers appropriately. The course explores positioning and its importance to successful brands looking at perceptual maps and the well-known iceberg model. It culminates in development of real brand houses, which can be applied to the working world, and how picking the right name, colors and logo can be instrumental to a brand’s success.\n\nThe course is delivered by Rhodes Scholar winning Professor, Dr Maria Eizaguirre, a member of IE Business School’s faculty.\n\nSHOW ALL ABOUT BRAND IDENTITY AND STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/brand-and-content-marketing?specialization=branding-the-creative-journey",
       "name":"Brand & Content Marketing",
       "Rating":"Brand & Content Marketing\n4.3\nstars\n167 ratings\n•\n39 reviews\n\nBrand & Content Marketing is a IE University course for professionals who want to learn how to produce memorable content through quality storytelling.\n\nStudents will go through a learning process that will start with a deep understanding of the term Branded Content and its main differences with traditional advertising, simultaneously creating an effective story-line through powerful values. The course analyses the production of quality journalism and explores how to create memorable and long lasting connections with a given target audience in a world of constant content surplus. It concludes with a deeper insight into the term of Brand Entertainment, giving them the opportunity to amplify their knowledge about how to produce a good call to action and retain the audience's attention.\n\nSHOW ALL ABOUT  BRAND & CONTENT MARKETING \nSHOW ALL"
    },
    {
       "Url":"/learn/brand-image-high-impact-campaign?specialization=branding-the-creative-journey",
       "name":"From Brand to Image: Creating High Impact Campaigns That Tell Brand Stories",
       "Rating":"From Brand to Image: Creating High Impact Campaigns That Tell Brand Stories\n4.7\nstars\n184 ratings\n•\n47 reviews\n\nThere are many different ways to approach clients to assess their needs and develop creative campaigns which fulfill your creative desires. Many agencies have established methodology, terminology and processes, and oftentimes, have spent decades or even years developing these processes. However, whether you are a freelancer, designer, illustrator, photographer or marketing director, or perhaps a small business owner, you will be looking to develop a simple process to create campaigns for yourself or your client. \n\nIn this course I am offering you a methodology which you can easily put into practice. Then, as your needs change and grow, you might decide that you want to incorporate other techniques as well.  I hope this course serves as a launchpad for you to go out and win new creative projects as well as make the ones that you are currently working on even better. And most of all, I hope you have FUN! Because remember, if you're not having fun, it's not worth it!\n\nSHOW ALL ABOUT FROM BRAND TO IMAGE: CREATING HIGH IMPACT CAMPAIGNS THAT TELL BRAND STORIES\nSHOW ALL"
    },
    {
       "Url":"/learn/branding-and-cx?specialization=branding-the-creative-journey",
       "name":"Branding and Customer Experience",
       "Rating":"Branding and Customer Experience\n4.6\nstars\n258 ratings\n•\n72 reviews\n\nWhether students come from a Branding or a Customer Experience background or perspective, this course will explore the synergies between and the intersection of the two sets of activities. While there are different approaches to defining a branding strategy, a branding project’s implementation impacts many departments and their customer-facing activities. In this sense, it’s essential to understand branding efforts in the context of Customer Experience. In this course, we will use a framework - adapted from Customer Journey Mapping - for focusing and organizing students' thinking about the operational implications of their branding projects. Through the framework, we will derive an operational language for aligning activities and measuring impacts across multiple departments and the customer touch points they manage.\n\nSHOW ALL ABOUT BRANDING AND CUSTOMER EXPERIENCE\nSHOW ALL"
    },
    "/specializations/object-oriented-programming",
    {
       "Url":"/learn/java-programming?specialization=object-oriented-programming",
       "name":"Java Programming: Solving Problems with Software",
       "Rating":"Java Programming: Solving Problems with Software\n4.6\nstars\n6,617 ratings\n•\n1,390 reviews\n\nLearn to code in Java and improve your programming and problem-solving skills. You will learn to design algorithms as well as develop and debug programs. Using custom open-source classes, you will write programs that access and transform images, websites, and other types of data. At the end of the course you will build a program that determines the popularity of different baby names in the US over time by analyzing comma separated value (CSV) files. \n\nAfter completing this course you will be able to:\n1. Edit, compile, and run a Java program;\n2. Use conditionals and loops in a Java program;\n3. Use Java API documentation in writing programs. \n4. Debug a Java program using the scientific method;\n5. Write a Java method to solve a specific problem;\n6. Develop a set of test cases as part of developing a program;\n7. Create a class with multiple methods that work together to solve a problem; and\n8. Use divide-and-conquer design techniques for a program that uses multiple methods.\n\nSHOW ALL ABOUT JAVA PROGRAMMING: SOLVING PROBLEMS WITH SOFTWARE\nSHOW ALL"
    },
    {
       "Url":"/learn/java-programming-arrays-lists-data?specialization=object-oriented-programming",
       "name":"Java Programming: Arrays, Lists, and Structured Data",
       "Rating":"Java Programming: Arrays, Lists, and Structured Data\n4.7\nstars\n2,659 ratings\n•\n476 reviews\n\nBuild on the software engineering skills you learned in “Java Programming: Solving Problems with Software” by learning new data structures. Use these data structures to build more complex programs that use Java’s object-oriented features. At the end of the course you will write an encryption program and a program to break your encryption algorithm.\n\nAfter completing this course, you will be able to:\n1. Read and write data from/to files;\n2. Solve problems involving data files;\n3. Perform quantitative analyses of data (e.g., finding maximums, minimums, averages); \n4. Store and manipulate data in an array or ArrayList;\n5. Combine multiple classes to solve larger problems;\n6. Use iterables and collections (including maps) in Java.\n\nSHOW ALL ABOUT JAVA PROGRAMMING: ARRAYS, LISTS, AND STRUCTURED DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/object-oriented-java?specialization=object-oriented-programming",
       "name":"Object Oriented Programming in Java",
       "Rating":"Object Oriented Programming in Java\n4.7\nstars\n5,181 ratings\n•\n1,314 reviews\n\nWelcome to our course on Object Oriented Programming in Java using data visualization. People come to this course with many different goals -- and we are really excited to work with all of you! Some of you want to be professional software developers, others want to improve your programming skills to implement that cool personal project that you’ve been thinking about, while others of you might not yet know why you’re here and are trying to figure out what this course is all about.\n\nThis is an intermediate Java course. We recommend this course to learners who have previous experience in software development or a background in computer science.  Our goal is that by the end of this course each and every one of you feels empowered to create a Java program that’s more advanced than any you have created in the past and that is personally interesting to you. In achieving this goal you will also learn the fundamentals of Object Oriented Programming, how to leverage the power of existing libraries, how to build graphical user interfaces, and how to use some core algorithms for searching and sorting data. And this course is project-based, so we’ll dive right into the project immediately!\n\nWe are excited to be offering a unique course structure, designed to support learners of different backgrounds in succeeding at their own pace. The first module explains how this will work and if this course is right for you. We also recommend taking a few minutes to explore the course site. A good place to start is the navigation bar on the left. Click Course Content to see what material we’ll cover each week, as well preview the assignments you’ll need to complete to pass the course. Click Discussions to see forums where you can discuss the course material with fellow students taking the class. Be sure to introduce yourself to everyone in the Meet and Greet forum.\n\nThis course should take about 6 weeks to complete. You can check out the recommended course schedule below to see a quick overview of the lessons and assignments you’ll complete each week.\n\nWe’re excited you’re here learning with us. Let’s get started!\n\nSHOW ALL ABOUT OBJECT ORIENTED PROGRAMMING IN JAVA\nSHOW ALL"
    },
    {
       "Url":"/learn/data-structures-optimizing-performance?specialization=object-oriented-programming",
       "name":"Data Structures and Performance",
       "Rating":"Data Structures and Performance\n4.8\nstars\n2,121 ratings\n•\n435 reviews\n\nHow do Java programs deal with vast quantities of data? Many of the data structures and algorithms that work with introductory toy examples break when applications process real, large data sets.  Efficiency is critical, but how do we achieve it, and how do we even measure it?\n\nThis is an intermediate Java course. We recommend this course to learners who have previous experience in software development or a background in computer science, and in particular, we recommend that you have taken the first course in this specialization (which also requires some previous experience with Java).  \n\nIn this course, you will use and analyze data structures that are used in industry-level applications, such as linked lists, trees, and hashtables.  You will explain how these data structures make programs more efficient and flexible.  You will apply asymptotic Big-O analysis to describe the performance of algorithms and evaluate which strategy to use for efficient data retrieval, addition of new data, deletion of elements, and/or memory usage.\n\nThe program you will build throughout this course allows its user to manage, manipulate and reason about large sets of textual data.  This is an intermediate Java course, and we will build on your prior knowledge.  This course is designed around  the same video series as in our first course in this specialization, including explanations of core content, learner videos, student and engineer testimonials, and support videos -- to better allow you to choose your own path through the course!\n\nSHOW ALL ABOUT DATA STRUCTURES AND PERFORMANCE\nSHOW ALL"
    },
    "/specializations/coding-for-everyone",
    {
       "Url":"/learn/c-for-everyone?specialization=coding-for-everyone",
       "name":"C for Everyone: Programming Fundamentals",
       "Rating":"C for Everyone: Programming Fundamentals\n4.5\nstars\n4,318 ratings\n•\n1,231 reviews\n\nThis course is for everyone. In the new world we live in, coding is a universally valuable skill, whether you're a scientist, artist, or a humanist. Algorithms are everywhere, and we all have to understand how they work. The C language is particularly well suited as an introduction to coding: It's a tried-and-true language, and it allows you to understand computing processes at a deep level. \n\nNo prior knowledge of coding is needed for this course. We'll start at the beginning.\nThe time estimated time commitment for this course is five hours a week for five weeks.\n\nSHOW ALL ABOUT C FOR EVERYONE: PROGRAMMING FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/c-structured-programming?specialization=coding-for-everyone",
       "name":"C for Everyone: Structured Programming",
       "Rating":"C for Everyone: Structured Programming\n4.6\nstars\n449 ratings\n•\n118 reviews\n\nIn the new world we live in, coding is a universally valuable skill, whether you're a scientist, artist, or a humanist. Algorithms are everywhere, and we all have to understand how they work. The C language is particularly well suited as an introduction to coding: It's a tried-and-true language, and it allows you to understand computing processes at a deep level. You will also get an introduction to more advanced programming in C++ in the final module. \n\nThis is a continuation of C for Everyone: Fundamentals, which you should take before beginning this course. \nThe time estimated time commitment for this course is five hours a week for five weeks.\n\nSHOW ALL ABOUT C FOR EVERYONE: STRUCTURED PROGRAMMING\nSHOW ALL"
    },
    {
       "Url":"/learn/c-plus-plus-a?specialization=coding-for-everyone",
       "name":"C++ For C Programmers, Part A",
       "Rating":"C++ For C Programmers, Part A\n4.4\nstars\n2,065 ratings\n•\n581 reviews\n\nThis course is for experienced C programmers who want to program in C++. The examples and exercises require a basic understanding of algorithms and object-oriented software."
    },
    {
       "Url":"/learn/c-plus-plus-b?specialization=coding-for-everyone",
       "name":"C++ For C Programmers, Part B",
       "Rating":"C++ For C Programmers, Part B\n4.4\nstars\n249 ratings\n•\n76 reviews\n\nThis course is for experienced C programmers who want to program in C++. The examples and exercises require a basic understanding of algorithms and object-oriented software."
    },
    "/specializations/product-management",
    {
       "Url":"/learn/introduction-to-software-product-management?specialization=product-management",
       "name":"Introduction to Software Product Management",
       "Rating":"Introduction to Software Product Management\n4.6\nstars\n6,633 ratings\n•\n1,238 reviews\n\nThis course highlights the importance and role of software product management. It also provides an overview of the specialization, as well as its goals, structure, and expectations. The course explains the value of process, requirements, planning, and monitoring in producing better software."
    },
    {
       "Url":"/learn/software-processes-and-agile-practices?specialization=product-management",
       "name":"Software Processes and Agile Practices",
       "Rating":"Software Processes and Agile Practices\n4.7\nstars\n4,789 ratings\n•\n777 reviews\n\nThis course delves into a variety of processes to structure software development. It also covers the foundations of core Agile practices, such as Extreme Programming and Scrum."
    },
    {
       "Url":"/learn/client-needs-and-software-requirements?specialization=product-management",
       "name":"Client Needs and Software Requirements",
       "Rating":"Client Needs and Software Requirements\n4.8\nstars\n2,849 ratings\n•\n528 reviews\n\nThis course covers practical techniques to elicit and express software requirements from client interactions."
    },
    {
       "Url":"/learn/agile-planning-for-software-products?specialization=product-management",
       "name":"Agile Planning for Software Products",
       "Rating":"Agile Planning for Software Products\n4.8\nstars\n1,871 ratings\n•\n287 reviews\n\nThis course covers the techniques required to break down and map requirements into plans that will ultimately drive software production.\n\nUpon successful completion of this course, you will be able to:\n\n- Create effective plans for software development\n- Map user requirements to developer tasks\n- Assess and plan for project risks\n- Apply velocity-driven planning techniques\n- Generate work estimates for software products\n\nSHOW ALL ABOUT AGILE PLANNING FOR SOFTWARE PRODUCTS\nSHOW ALL"
    },
    {
       "Url":"/learn/reviews-and-metrics-for-software-improvements?specialization=product-management",
       "name":"Reviews & Metrics for Software Improvements",
       "Rating":"Reviews & Metrics for Software Improvements\n4.7\nstars\n1,505 ratings\n•\n193 reviews\n\nThis course covers techniques for monitoring your projects in order to align client needs, project plans, and software production. It focuses on metrics and reviews to track and improve project progress and software quality."
    },
    {
       "Url":"/learn/software-product-management-capstone?specialization=product-management",
       "name":"Software Product Management Capstone",
       "Rating":"Software Product Management Capstone\n4.8\nstars\n859 ratings\n•\n214 reviews\n\nIn this six-week capstone course, you will gain practical management experience in a safe, simulated software production setting. You will apply Agile practices and techniques to conquer industry-inspired challenges. Interacting with a realistic client, you will discern what they want and express what they truly need in software requirements to drive software production. Upon completing the capstone, you will be prepared to advance your career as a confident software product management professional.\n\nSHOW ALL ABOUT SOFTWARE PRODUCT MANAGEMENT CAPSTONE\nSHOW ALL"
    }
 ]