[
    "/specializations/american-english-pronunciation",
    {
       "Url":"/learn/american-english-pronunciation-consonant-sounds?specialization=american-english-pronunciation",
       "name":"Consonants of American English Pronunciation",
       "Rating":"Consonants of American English Pronunciation\n4.8\nstars\n400 ratings\n•\n152 reviews\n\nIn this first course of The Pronunciation of American English specialization, you will learn and practice all of the consonant sounds of American English, including some pairs of consonants that are especially tricky.  Each week you will receive practical advice from successful English learners and practice an effective technique called shadowing to improve your pronunciation of consonant sounds.  You will also have opportunities to record yourself and to respond to the recordings of other learners.\n\nOnly learners who pay for the course will be able to take the graded quizzes or submit assignments for feedback. The free version provides access to the lectures and practice activities only.\n\nSHOW ALL ABOUT CONSONANTS OF AMERICAN ENGLISH PRONUNCIATION\nSHOW ALL"
    },
    {
       "Url":"/learn/american-english-pronunciation-vowel-sounds?specialization=american-english-pronunciation",
       "name":"Vowels of American English Pronunciation",
       "Rating":"Vowels of American English Pronunciation\n4.9\nstars\n120 ratings\n•\n38 reviews\n\nThis is the second course of The Pronunciation of American English specialization.  In this course, you will learn and practice all of the vowel sounds of American English, including pairs of vowels that may be easy to confuse.  Each week you will receive practical advice from successful English learners and practice an effective technique called shadowing to improve your pronunciation of vowel sounds.  You will also have opportunities to record yourself and to respond to the recordings of other learners.\n\nOnly learners who pay for the course will be able to take the graded quizzes or submit assignments for feedback. The free version provides access to the lectures and practice activities only.\n\nSHOW ALL ABOUT VOWELS OF AMERICAN ENGLISH PRONUNCIATION\nSHOW ALL"
    },
    {
       "Url":"/learn/american-english-pronunciation-music?specialization=american-english-pronunciation",
       "name":"The Music of American English Pronunciation",
       "Rating":"The Music of American English Pronunciation\n4.9\nstars\n86 ratings\n•\n25 reviews\n\nIn this third course of The Pronunciation of American English specialization, you will learn and practice the \"music\" of American English, the features of pronunciation such as stress, rhythm, and intonation that will help improve your listening comprehension as well as your ability to communicate more clearly. Each week you will receive practical advice from successful English learners and practice an effective technique called shadowing to improve your pronunciation of the musical features of English.  You will also have opportunities to record yourself and to respond to the recordings of other learners.\n\nOnly learners who pay for the course will be able to take the graded quizzes or submit assignments for feedback. The free version provides access to the lectures and practice activities only.\n\nSHOW ALL ABOUT THE MUSIC OF AMERICAN ENGLISH PRONUNCIATION\nSHOW ALL"
    },
    {
       "Url":"/learn/pronunciation-american-english-project?specialization=american-english-pronunciation",
       "name":"The Pronunciation of American English Project",
       "Rating":"The Pronunciation of American English Project\n4.7\nstars\n46 ratings\n•\n15 reviews\n\nIn the final course of The Pronunciation of American English specialization, you will complete a final self-reflection project applying what you have learned in the first three courses about consonants, vowels, and the “music” of English.  In preparation for the project, you will take a post-test, review all the sounds of English, analyze a speech, and share your advice on improving pronunciation with other learners.   \n\nOnly learners who pay for the course will be able to take the graded quizzes or submit assignments for feedback. The free version provides access to the lectures and practice activities only.\n\nSHOW ALL ABOUT THE PRONUNCIATION OF AMERICAN ENGLISH PROJECT\nSHOW ALL"
    },
    "/specializations/python",
    {
       "Url":"/learn/python?specialization=python",
       "name":"Programming for Everybody (Getting Started with Python)",
       "Rating":"Programming for Everybody (Getting Started with Python)\n4.8\nstars\n196,264 ratings\n•\n47,061 reviews\n\nThis course aims to teach everyone the basics of programming computers using Python. We cover the basics of how one constructs a program from a series of simple instructions in Python.  The course has no pre-requisites and avoids all but the simplest mathematics. Anyone with moderate computer experience should be able to master the materials in this course. This course will cover Chapters 1-5 of the textbook “Python for Everybody”.  Once a student completes this course, they will be ready to take more advanced programming courses. This course covers Python 3.\n\nSHOW ALL ABOUT PROGRAMMING FOR EVERYBODY (GETTING STARTED WITH PYTHON)\nSHOW ALL"
    },
    {
       "Url":"/learn/python-data?specialization=python",
       "name":"Python Data Structures",
       "Rating":"Python Data Structures\n4.9\nstars\n85,899 ratings\n•\n15,268 reviews\n\nThis course will introduce the core data structures of the Python programming language. We will move past the basics of procedural programming and explore how we can use the Python built-in data structures such as lists, dictionaries, and tuples to perform increasingly complex data analysis. This course will cover Chapters 6-10 of the textbook “Python for Everybody”.  This course covers Python 3.\n\nSHOW ALL ABOUT PYTHON DATA STRUCTURES\nSHOW ALL"
    },
    {
       "Url":"/learn/python-network-data?specialization=python",
       "name":"Using Python to Access Web Data",
       "Rating":"Using Python to Access Web Data\n4.8\nstars\n41,089 ratings\n•\n7,482 reviews\n\nThis course will show how one can treat the Internet as a source of data.  We will scrape, parse, and read web data as well as access data using web APIs.  We will work with HTML, XML, and JSON data formats in Python.  This course will cover Chapters 11-13 of the textbook “Python for Everybody”. To succeed in this course, you should be familiar with the material covered in Chapters 1-10 of the textbook and the first two courses in this specialization.  These topics include variables and expressions, conditional execution (loops, branching, and try/except), functions, Python data structures (strings, lists, dictionaries, and tuples), and manipulating files.  This course covers Python 3.\n\nSHOW ALL ABOUT USING PYTHON TO ACCESS WEB DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/python-databases?specialization=python",
       "name":"Using Databases with Python",
       "Rating":"Using Databases with Python\n4.8\nstars\n19,910 ratings\n•\n3,038 reviews\n\nThis course will introduce students to the basics of the Structured Query Language (SQL) as well as basic database design for storing data as part of a multi-step data gathering, analysis, and processing effort.  The course will use SQLite3 as its database.  We will also build web crawlers and multi-step data gathering and visualization processes.  We will use the D3.js library to do basic data visualization.  This course will cover Chapters 14-15 of the book “Python for Everybody”. To succeed in this course, you should be familiar with the material covered in Chapters 1-13 of the textbook and the first three courses in this specialization. This course covers Python 3.\n\nSHOW ALL ABOUT USING DATABASES WITH PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/python-data-visualization?specialization=python",
       "name":"Capstone: Retrieving, Processing, and Visualizing Data with Python",
       "Rating":"Capstone: Retrieving, Processing, and Visualizing Data with Python\n4.7\nstars\n11,738 ratings\n•\n1,526 reviews\n\nIn the capstone, students will build a series of applications to retrieve, process and visualize data using Python.   The projects will involve all the elements of the specialization.  In the first part of the capstone, students will do some visualizations to become familiar with the technologies in use and then will pursue their own project to visualize some other data that they have or can find.  Chapters 15 and 16 from the book “Python for Everybody” will serve as the backbone for the capstone. This course covers Python 3.\n\nSHOW ALL ABOUT CAPSTONE: RETRIEVING, PROCESSING, AND VISUALIZING DATA WITH PYTHON\nSHOW ALL"
    },
    "/specializations/mba",
    {
       "Url":"/learn/professional-skills-networking?specialization=mba",
       "name":"Professional Skills for International Business",
       "Rating":"Professional Skills for International Business\n4.7\nstars\n806 ratings\n•\n209 reviews\n\nThis course provides insight into the key professional skills needed by managers at all levels of an organisation. You’ll learn key skills such as how to make a positive first impression; how to become a role model at work; effective time and resource management; and networking.\n\nThis course forms part of a specialisation from the University of London designed to help you develop and build the essential business, academic, and cultural skills necessary to succeed in international business, or in further study. \n\nIf completed successfully, your certificate from this specialisation can also be used as part of the application process for the University of London Global MBA programme, particularly for early career applicants. If you would like more information about the Global MBA, please visit https://mba.london.ac.uk/.\n\nThis course is endorsed by CMI\n\nSHOW ALL ABOUT PROFESSIONAL SKILLS FOR INTERNATIONAL BUSINESS\nSHOW ALL"
    },
    {
       "Url":"/learn/management-skills-international-business?specialization=mba",
       "name":"Management Skills for International Business",
       "Rating":"Management Skills for International Business\n4.7\nstars\n591 ratings\n•\n138 reviews\n\nThis course focuses on a range of management techniques. You’ll discover the main skills and competencies of effective leaders, and how to distinguish between management and leadership. The course will cover team dynamics, how to build effective relationships, key motivation theories, and how to use communication to best effect.\n\nThis course forms part of a specialisation from the University of London designed to help you develop and build the essential business, academic, and cultural skills necessary to succeed in international business, or in further study. \n\nIf completed successfully, your certificate from this specialisation can also be used as part of the application process for the University of London Global MBA programme, particularly for early career applicants. If you would like more information about the Global MBA, please visit https://mba.london.ac.uk/.\n\nThis course is endorsed by CMI\n\nSHOW ALL ABOUT MANAGEMENT SKILLS FOR INTERNATIONAL BUSINESS\nSHOW ALL"
    },
    {
       "Url":"/learn/quantitative-foundations-international-business?specialization=mba",
       "name":"Quantitative Foundations for International Business",
       "Rating":"Quantitative Foundations for International Business\n4.0\nstars\n355 ratings\n•\n102 reviews\n\nThis course provides the essential mathematics required to succeed in the finance and economics related modules of the Global MBA, including equations, functions, derivatives, and matrices. You can test your understanding with quizzes and worksheets, while more advanced content will be available if you want to push yourself.\n\nThis course forms part of a specialisation from the University of London designed to help you develop and build the essential business, academic, and cultural skills necessary to succeed in international business, or in further study. \n\nIf completed successfully, your certificate from this specialisation can also be used as part of the application process for the University of London Global MBA programme, particularly for early career applicants. If you would like more information about the Global MBA, please visit https://mba.london.ac.uk/.\n\nThis course is endorsed by CMI\n\nSHOW ALL ABOUT QUANTITATIVE FOUNDATIONS FOR INTERNATIONAL BUSINESS\nSHOW ALL"
    },
    {
       "Url":"/learn/statistics-international-business?specialization=mba",
       "name":"Statistics for International Business",
       "Rating":"Statistics for International Business\n3.7\nstars\n256 ratings\n•\n76 reviews\n\nThis course introduces core areas of statistics that will be useful in business and for several MBA modules. It covers a variety of ways to present data, probability, and statistical estimation. You can test your understanding as you progress, while more advanced content is available if you want to push yourself.\n\nThis course forms part of a specialisation from the University of London designed to help you develop and build the essential business, academic, and cultural skills necessary to succeed in international business, or in further study. \n\nIf completed successfully, your certificate from this specialisation can also be used as part of the application process for the University of London Global MBA programme, particularly for early career applicants. If you would like more information about the Global MBA, please visit https://mba.london.ac.uk/.\n\nThis course is endorsed by CMI\n\nSHOW ALL ABOUT STATISTICS FOR INTERNATIONAL BUSINESS\nSHOW ALL"
    },
    {
       "Url":"/learn/global-business-environment?specialization=mba",
       "name":"International Business Environment",
       "Rating":"International Business Environment\n4.7\nstars\n312 ratings\n•\n65 reviews\n\nThis course explores the international business environment in which organisations function. You’ll learn about core analysis methods, including PESTLE, SWOT, and Boston Box Matrices, as well as the applications of Porter’s Five Forces. You’ll have the opportunity to participate in discussion forums and access case studies, as well as testing your understanding in quizzes.\n\nThis course forms part of a specialization from the University of London designed to help you develop and build the essential business, academic, and cultural skills necessary to succeed in international business, or in further study. \n\nIf completed successfully, your certificate from this specialization can also be used as part of the application process for the University of London Global MBA programme, particularly for early career applicants. If you would like more information about the Global MBA, please visit https://mba.london.ac.uk/.\n\nThis course is endorsed by CMI\n\nSHOW ALL ABOUT INTERNATIONAL BUSINESS ENVIRONMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/international-business-capstone?specialization=mba",
       "name":"International Business Capstone",
       "Rating":"International Business Capstone\n4.7\nstars\n92 ratings\n•\n17 reviews\n\nThe Capstone project is the culmination of the International Business Essentials specialisation, and brings together knowledge gained in the previous courses and applies this to a real-world scenario. Throughout the Capstone, you’ll be taught new skills, and will use the knowledge you have gained throughout the Specialisation to develop a business plan. \n\nThis course forms part of a specialisation from the University of London designed to help you develop and build the essential business, academic, and cultural skills necessary to succeed in international business, or in further study. \n\nIf completed successfully, your certificate from this specialisation can also be used as part of the application process for the University of London Global MBA programme, particularly for early career applicants. If you would like more information about the Global MBA, please visit https://mba.london.ac.uk/.\n\nThis course is endorsed by CMI\n\nSHOW ALL ABOUT INTERNATIONAL BUSINESS CAPSTONE\nSHOW ALL"
    },
    "/specializations/social-media-marketing",
    {
       "Url":"/learn/what-is-social?specialization=social-media-marketing",
       "name":"What is Social?",
       "Rating":"What is Social?\n4.6\nstars\n3,875 ratings\n•\n1,019 reviews\n\nThe “What Is Social?\" MOOC is for business owners, executives, and marketing professionals who want to significantly improve their abilities to grow their social strategy using effective, proven methodologies. This hands on, \"how to\" program won’t just tell you how to grow your professional persona using social – you will actually do it! This course is the first in the six-course specialization, Social Media Marketing: How to Profit in a Digital World. \n\nWhile the course can be audited for free, paid learners will receive additional content beyond the course basics. For MOOC 1, the toolkit includes a special video from Alessandro Acquisti on Big Data and a set of studies done by IBM on engagement and social marketing strategies with bottom-line profits. \n\nThis course has been designed to give you the tools, insights, knowledge, and skills to immediately impact your organization. In addition, we will help you network with thought leaders in social.  After completing this course, you and your organization’s staff will be able to position, engage, and grow relationships with the consumers of highest value to you.\n\nToday, we are living in a period of massive disruption. New technologies are changing the way people engage with each other and with the organizations that interest them. This course will start you on the path to growing your own social strategy using effective, proven methodologies.\n\nAdditional MOOC 1 faculty include: \n* Judy Ungar Franks (President, The Marketing Democracy, Ltd. & Lecturer, Medill Integrated Marketing Communications, Northwestern)\n\nSHOW ALL ABOUT WHAT IS SOCIAL?\nSHOW ALL"
    },
    {
       "Url":"/learn/importance-of-listening?specialization=social-media-marketing",
       "name":"The Importance of Listening",
       "Rating":"The Importance of Listening\n4.6\nstars\n1,545 ratings\n•\n312 reviews\n\nIn this second MOOC in the Social Marketing Specialization - \"The Importance of Listening\" - you will go deep into the Big Data of social and gain a more complete picture of what can be learned from interactions on social sites. You will be amazed at just how much information can be extracted from a single post, picture, or video. In this MOOC, guest speakers from Social Gist, BroadReader, Lexalytics, Semantria, Radian6, and IBM's Bluemix and Social Media Analytics Tools (SMA) will join Professor Hlavac to take you through the full range of analytics tools and options available to you and how to get the most from them. The best part, most of them will be available to you through the MOOC for free! Those purchasing the MOOC will receive special tools, templates, and videos to enhance your learning experience. In completing this course you will develop a fuller understanding of the data and will be able to increase the effectiveness of your content strategy by making better decisions and spotting crises before they happen! MOOC 2 bonus content in the paid toolkit includes access to Semantria's analytics engine to extract some data on the markets you are developing and have it analyzed. \n\nAs a student in this course, you are being provided the opportunity to access IBM Bluemix® platform-as-a-service trial for up to six months at no-charge with no credit card (up to a $1500 value).\n\nNOTE: By enrolling in this course, given access to IBM's Bluemix technology for one month for free as well as Lexalytics' Semantria tool. For those earning a Course Certificate, you will be given an additional five months of Bluemix and three months of Semantria at no cost with a special key code. By enrolling for a Course Certificate for this MOOC, you are acknowledging that your email will be shared with Lexalytics for the sole and express purpose of generating your individual key code. After the key code has been generated, Lexalytics will delete your email from its records. \n\nAdditional MOOC 2 faculty include: \n* Steve Dodd (SVP Business Development, Effyis - dba BoardReader and Socialgist - Global Social Media Content Access) \n* Seth Redmore (CMO, Lexalytics, Inc.)\n* Chris Gruber (Social Media Analytics Solution Architect, IBM)\n* Russell Beardall (Cloud Architect, IBM) \n* Tom Collinger (Executive Director Spiegel Research Center and Senior Director Distance Learning, Medill Integrated Marketing Communications, Northwestern)\n* Tressie Lieberman (VP Digital Innovation, Taco Bell)\n\nSHOW ALL ABOUT THE IMPORTANCE OF LISTENING\nSHOW ALL"
    },
    {
       "Url":"/learn/nurture-market-strategies?specialization=social-media-marketing",
       "name":"Engagement & Nurture Marketing Strategies",
       "Rating":"Engagement & Nurture Marketing Strategies\n4.8\nstars\n1,107 ratings\n•\n181 reviews\n\nIn this third course in the Social Marketing Specialization - \"The Engagement & Nurture Marketing Strategies\" - you will learn two of the most effective social strategies used by organizations today. You'll see real-world best practice examples and learn what metrics they use to gauge success. You will also learn the importance of infographics and the impact a well-designed landing page can have on your bottom line. All of the social skills you have learned thus far will be put into action with a multimedia filter and focus blog that you will create to demonstrate how social can enable real-time marketing results. After this MOOC, you will have developed a plan to reach your target consumer markets and know when it is best to either use or avoid specific social marketing strategies.\n\nAdditional MOOC 3 faculty include: \n* Randy Krum (Data Visualization & Infographics Designer | Consultant | Author | Speaker | President, InfoNewt)\n* Stanford Smith (CEO, Pushing Social)\n* Andy Crestodina (Co-Founder & Strategic Director, Orbit Media Studios)\n* Ellen Valentine (Veteran Marketing Leader & Evangelist, Silverpop, IBM)\n\nSHOW ALL ABOUT ENGAGEMENT & NURTURE MARKETING STRATEGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/social-imc?specialization=social-media-marketing",
       "name":"Content, Advertising & Social IMC",
       "Rating":"Content, Advertising & Social IMC\n4.7\nstars\n978 ratings\n•\n150 reviews\n\nWant your content to go viral? Who doesn't! It takes a thoughtful, integrated approach to make content that stands out in our increasingly oversaturated world. In this fourth course of the Social Marketing Specialization - \"Content, Advertising & Social IMC\" - you will learn how marketers are successfully navigating today's media landscape. You will learn why developing engaging content for your audience is an essential component in effective social marketing. A panel of experts will unlock the paid/owned/earned media riddle and replace it with an integrated who/what/where approach that utilizes platform-specific messaging to grow your market share. This course also includes an overview of the integrated marketing communications strategy for social and how it is being deployed around the globe, as well as gamification tips to keep your audiences coming back for more. In addition, you will learn the secrets to advertising on Facebook and other social sites.\n\nAdditional MOOC 4 faculty include:\n* Judy Ungar Franks (President, The Marketing Democracy, Ltd. & Lecturer, Medill Integrated Marketing Communications, Northwestern)\n* Steffi Decker (Junior Partner, Chong and Koster)\n* Joey Strawn (Director of Integrated Marketing, Industrial Strength Marketing)\n\nSHOW ALL ABOUT CONTENT, ADVERTISING & SOCIAL IMC\nSHOW ALL"
    },
    {
       "Url":"/learn/business-of-social?specialization=social-media-marketing",
       "name":"The Business of Social",
       "Rating":"The Business of Social\n4.7\nstars\n742 ratings\n•\n104 reviews\n\nIn a 2014 study of CEOs and CMOs, IBM found 63% wanted social strategies which generate business metrics while only 20% of businesses worldwide actually have them. This means strategies which not only grow your company’s social footprint but link to your sales and marketing systems. With this critical linkage, your social and mobile strategies will provide you with the ability to engage consumers at a 1-to-1 level and measure your social investments in terms of costs, revenues, profits and ROI. In this fifth MOOC of the Social Marketing Specialization - \"The Business of Social\" - you will learn how to transform your organization's social marketing from an untracked investment to an integral part of your company’s marketing strategy. You will learn the legal considerations involved as well as proven performance metrics and management tactics for success.\n\nAdditional MOOC 5 faculty include:\n* Rich Gordon (Professor & Director of Digital Innovation, Medill, Northwestern)\n* Tom Collinger (Executive Director Spiegel Research Center and Senior Director Distance Learning, Medill Integrated Marketing Communications, Northwestern)\n* Seth Redmore (CMO, Lexalytics, Inc.)\n* Jeff Davidoff (CMO, Donuts.Domains) \n* Matt Krull (Business Unit Executive, IBM Security) \n* Frank Mulhern (Associate Dean, Department Chair, and Professor, Integrated Marketing Communications, Northwestern)\n\nSHOW ALL ABOUT THE BUSINESS OF SOCIAL\nSHOW ALL"
    },
    {
       "Url":"/learn/social-marketing-capstone?specialization=social-media-marketing",
       "name":"Social Marketing Capstone Project",
       "Rating":"Social Marketing Capstone Project\n4.9\nstars\n264 ratings\n•\n52 reviews\n\nYour markets are on social and you need to be there. However, your social strategy needs to be based on the business metrics which define your success. This final Capstone Project in the Social Marketing Specialization will put the methodologies, tools, and insights you have learned to the test as you create a multifaceted plan to assure effective social marketing is an integral part of your business strategy. Whether your company has a sophisticated Engagement Strategy or you are a new start-up, you will learn to harness the full power of social marketing to grow provable market share and build stronger relationships with your high value markets. For success in today's digital world, you must have a plan to integrate your social and mobile marketing strategies into your business strategy. In this Capstone you will use the practical skills that you’ve mastered through the Specialization to demonstrate your ability to integrate social and mobile marketing strategies into a company’s business strategy.\n\n2016 Capstone Schedule:\n1st offering begins on February 29 (2/29/16). It will be offered again starting on May 23 (5/23/16), August 29 (8/29/16), and November 28 (11/28/16),\n\nSHOW ALL ABOUT SOCIAL MARKETING CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/statistical-inference-for-data-science-applications",
    {
       "Url":"/learn/probability-theory-foundation-for-data-science?specialization=statistical-inference-for-data-science-applications",
       "name":"Probability Theory: Foundation for Data Science",
       "Rating":"Probability Theory: Foundation for Data Science\n\nUnderstand the foundations of probability and its relationship to statistics and data science.  We’ll learn what it means to calculate a probability, independent and dependent outcomes, and conditional events.  We’ll study discrete and continuous random variables and see how this fits with data collection.  We’ll end the course with Gaussian (normal) random variables and the Central Limit Theorem and understand its fundamental importance for all of statistics and data science.\n\nThis course can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nLogo adapted from photo by Christopher Burns on Unsplash.\n\nSHOW ALL ABOUT PROBABILITY THEORY: FOUNDATION FOR DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/statistical-inference-for-estimation-in-data-science?specialization=statistical-inference-for-data-science-applications",
       "name":"Statistical Inference for Estimation in Data Science",
       "Rating":"Statistical Inference for Estimation in Data Science\n\nThis course introduces statistical inference, sampling distributions,  and confidence intervals. Students will learn how to define and construct  good estimators, method of moments estimation, maximum likelihood estimation, and methods of constructing confidence intervals that will extend to more general settings.  \n\nThis course can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nLogo adapted from photo by Christopher Burns on Unsplash.\n\nSHOW ALL ABOUT STATISTICAL INFERENCE FOR ESTIMATION IN DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/statistical-inference-and-hypothesis-testing-in-data-science-applications?specialization=statistical-inference-for-data-science-applications",
       "name":"Statistical Inference and Hypothesis Testing in Data Science Applications",
       "Rating":"Statistical Inference and Hypothesis Testing in Data Science Applications\n\nThis course will focus on theory and implementation of hypothesis testing, especially as it relates to applications in data science. Students will learn to use hypothesis tests to make informed decisions from data. Special attention will be given to the general logic of hypothesis testing, error and error rates, power, simulation, and the correct computation and interpretation of p-values. Attention will also be given to the misuse of testing concepts, especially p-values, and the ethical implications of such misuse.\n\nThis course can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nSHOW ALL ABOUT STATISTICAL INFERENCE AND HYPOTHESIS TESTING IN DATA SCIENCE APPLICATIONS\nSHOW ALL"
    },
    "/specializations/business-english",
    {
       "Url":"/learn/business-english-intro?specialization=business-english",
       "name":"Business English: Networking",
       "Rating":"Business English: Networking\n4.8\nstars\n2,688 ratings\n•\n824 reviews\n\nThis course begins with a welcome message and an overview of the Specialization. After this introduction, you will be asked to take a proficiency test to see if this course is right for you. \n\nDuring the course, you will begin learning vocabulary and customs related to socializing and networking in English. The goal is to enable you to interact with business contacts in person, on the phone and over email in a professional way.\n\nCourse Learning Objectives\n\n•\tDetermine whether the objectives of this Specialization align with your learning goals\n•\tEvaluate your current level of proficiency in business English communication \n•\tPresent relevant information about yourself in a discussion forum\n•\tDevelop your networking skills \n•\tWrite short emails with appropriate formatting\n•\tRecognize and produce formal and informal language in emails\n•\tDevelop vocabulary related to jobs and companies\n\nSHOW ALL ABOUT BUSINESS ENGLISH: NETWORKING\nSHOW ALL"
    },
    {
       "Url":"/learn/business-english-meetings?specialization=business-english",
       "name":"Business English: Meetings",
       "Rating":"Business English: Meetings\n4.8\nstars\n789 ratings\n•\n193 reviews\n\nThis course will teach you vocabulary and skills related to participating in meetings. You will learn terms and phrases used both in email and in speaking to arrange, participate in, and conclude meetings. The goals of this course are to enable you to participate effectively in on-site meetings and teleconferences and to prepare you to write a proposal as an outcome of a meeting.\n\nCourse Learning Objectives\n\n•\tArrange a meeting though email and by telephone \n•\tList expectations and protocols related to on-site meetings and teleconferences\n•\tState phone numbers, dates, currencies and sales figures accurately \n•\tWrite a proposal with appropriate organization and vocabulary\n\nSHOW ALL ABOUT BUSINESS ENGLISH: MEETINGS\nSHOW ALL"
    },
    {
       "Url":"/learn/business-english-negotiating?specialization=business-english",
       "name":"Business English: Planning & Negotiating",
       "Rating":"Business English: Planning & Negotiating\n4.8\nstars\n455 ratings\n•\n87 reviews\n\nIn this course, the context is hosting an event and finding an appropriate venue for it. You will learn language and strategies for successful negotiations culminating in a written announcement for an event.\n\nCourse Learning Objectives\n\n•\tNegotiate strategically in formal and informal settings\n•\tIdentify and resolve customer issues after a negotiation has taken place\n•\tEvaluate and compare services and features of two venues\n•\tPlan a business event using negotiation skills\n•\tWrite an announcement for a business event after selecting a venue\n\nSHOW ALL ABOUT BUSINESS ENGLISH: PLANNING & NEGOTIATING\nSHOW ALL"
    },
    {
       "Url":"/learn/business-english-presentations?specialization=business-english",
       "name":"Business English: Making Presentations",
       "Rating":"Business English: Making Presentations\n4.8\nstars\n599 ratings\n•\n144 reviews\n\nThis course teaches you language and techniques that will help you make effective presentations in English. The final task is to develop a well-organized, persuasive presentation using charts and graphs that sells your city as a venue.\n\nThe course focuses on students who have an intermediate level of English, with a minimum of two years of formal language study.\n\nCourse Learning Objectives\n\n•\tPresent information in an organized and engaging way\n•\tShare data in charts and graphs\n•\tUse persuasive language in a presentation\n\nSHOW ALL ABOUT BUSINESS ENGLISH: MAKING PRESENTATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/business-english-capstone?specialization=business-english",
       "name":"Business English: Capstone Project",
       "Rating":"Business English: Capstone Project\n4.7\nstars\n117 ratings\n•\n29 reviews\n\nThe capstone project will give you opportunities to demonstrate your competence in the learning objectives for this Specialization. For the project, you’ll use formal, written methods and more casual visual and audio methods of communication to demonstrate your ability to use language appropriate for different business contexts. The goal of this course is to demonstrate competence in writing and presenting a plan using skills and language appropriate for business.\n\nCourse Learning Objectives\n•\tUse appropriate vocabulary to write a mini business plan\n•\tCommunicate a business plan orally in an organized and engaging presentation\n\nSHOW ALL ABOUT BUSINESS ENGLISH: CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/ui-ux-design",
    {
       "Url":"/learn/visual-elements-user-interface-design?specialization=ui-ux-design",
       "name":"Visual Elements of User Interface Design",
       "Rating":"Visual Elements of User Interface Design\n4.7\nstars\n4,429 ratings\n•\n1,106 reviews\n\nThis design-centric course examines the broad question of what an interface is and what role a designer plays in creating a user interface. Learning how to design and articulate meaning using color, type, and imagery is essential to making interfaces function clearly and seamlessly. Through a series of lectures and visual exercises, you will focus on the many individual elements and components that make up the skillset of an interface designer. By the end of this course, you will be able to describe the key formal elements of clear, consistent, and intuitive UI design, and apply your learned skills to the design of a static screen-based interface.\n\nThis is the first course in the UI/UX Design Specialization, which brings a design-centric approach to user interface (UI) and user experience (UX) design, and offers practical, skill-based instruction centered around a visual communications perspective, rather than on one focused on marketing or programming alone.\n\nThese courses are ideal for anyone with some experience in graphic or visual design and who would like to build their skill set in UI or UX for app and web design. It would also be ideal for anyone with experience in front- or back-end web development or human-computer interaction and want to sharpen their visual design and analysis skills for UI or UX.\n\nSHOW ALL ABOUT VISUAL ELEMENTS OF USER INTERFACE DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/ux-design-fundamentals?specialization=ui-ux-design",
       "name":"UX Design Fundamentals",
       "Rating":"UX Design Fundamentals\n4.8\nstars\n1,672 ratings\n•\n348 reviews\n\nThis hands-on course examines how content is organized and structured to create an experience for a user, and what role the designer plays in creating and shaping user experience. You will be led through a condensed process that acts as a roadmap for developing robust UI/UX design: from ideation and sitemapping, to the creation of paper and digital prototypes. Building on the design skills learned in Visual Elements of User Interface Design, you will apply this methodology to produce a digital prototype for a multi-screen app of your own invention.\n\nBy the end of this course, you will be able to describe and apply current best practices and conventions in UX design, and employ the fundamental principles of how UX design functions to shape an audience's experience of a given body of content.\nThis is the second course in the UI/UX Design Specialization, which brings a design-centric approach to user interface (UI) and user experience (UX) design, and offers practical, skill-based instruction centered around a visual communications perspective, rather than on one focused on marketing or programming alone.\n\nThese courses are ideal for anyone with some experience in graphic or visual design and who would like to build their skill set in UI or UX for app and web design. It would also be ideal for anyone with experience in front- or back-end web development or human-computer interaction and want to sharpen their visual design and analysis skills for UI or UX.\n\nSHOW ALL ABOUT UX DESIGN FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/web-design-strategy?specialization=ui-ux-design",
       "name":"Web Design: Strategy and Information Architecture",
       "Rating":"Web Design: Strategy and Information Architecture\n4.8\nstars\n967 ratings\n•\n194 reviews\n\nThis course is focused on the early user experience (UX) challenges of research, planning, setting goals, understanding the user, structuring content, and developing interactive sequences. While the concepts covered will translate to many kinds of interactive media (apps, digital kiosks, games), our primary focus will be on designing contemporary, responsive websites. In this course you will complete the first half of a large scale project—developing a comprehensive plan for a complex website—by defining the strategy and scope of the site, as well as developing its information architecture and overall structure. Along the way we will also discuss:\n\n- Different job descriptions in the web design industry and where UX and UI skills fall within this spectrum\n - The difference between native apps and websites\n - The difference of agile vs. waterfall approaches\n - User personas and site personas\n - User testing\n\nThe work and knowledge in this course continues in the last course in the UI/UX Design Specialization, Web Design: Wireframes to Prototypes, where you will tackle—finally—wireframes, visual mockups, and clickable prototypes.\nThis is the third course in the UI/UX Design Specialization, which brings a design-centric approach to user interface (UI) and user experience (UX) design, and offers practical, skill-based instruction centered around a visual communications perspective, rather than on one focused on marketing or programming alone.\n\nThese courses are ideal for anyone with some experience in graphic or visual design and who would like to build their skill set in UI or UX for app and web design. It would also be ideal for anyone with experience in front- or back-end web development or human-computer interaction and want to sharpen their visual design and analysis skills for UI or UX.\n\nSHOW ALL ABOUT WEB DESIGN: STRATEGY AND INFORMATION ARCHITECTURE\nSHOW ALL"
    },
    {
       "Url":"/learn/web-design-wireframes-prototypes?specialization=ui-ux-design",
       "name":"Web Design: Wireframes to Prototypes",
       "Rating":"Web Design: Wireframes to Prototypes\n4.9\nstars\n629 ratings\n•\n147 reviews\n\nThis course is focused on the application of the early UX research to actual user interfaces: the creation of wireframes, high-fidelity mockups, and clickable prototypes. Along the way we will also discuss:\n\n- Responsive web design and mobile web challenges\n - Mobile-first approach\n - Web typography\n - The relationship between design and programming and whether it is important to know how to code\n - The different web technologies that make the web work, such as HTML, CSS, JavaScript, server-side coding, and databases.\n\nThis course is the continuation of the course Web Design: Strategy and Information Architecture, in which students completed the first half of a large scale project—developing a comprehensive plan for a complex website. If you are intending to complete the assignments in this course to earn a certificate you must complete the Strategy and Information Architecture course first so you have the materials and data needed to begin creating wireframes and mockups in this course.\n\nThis is the fourth and last course in the UI/UX Design Specialization, which brings a design-centric approach to user interface (UI) and user experience (UX) design, and offers practical, skill-based instruction centered around a visual communications perspective, rather than on one focused on marketing or programming alone.\n\nThese courses are ideal for anyone with some experience in graphic or visual design and who would like to build their skill set in UI or UX for app and web design. It would also be ideal for anyone with experience in front- or back-end web development or human-computer interaction and want to sharpen their visual design and analysis skills for UI or UX.\n\nSHOW ALL ABOUT WEB DESIGN: WIREFRAMES TO PROTOTYPES\nSHOW ALL"
    },
    "/specializations/conflict-management",
    {
       "Url":"/learn/types-of-conflict?specialization=conflict-management",
       "name":"Types of Conflict",
       "Rating":"Types of Conflict\n4.4\nstars\n864 ratings\n•\n216 reviews\n\nConflict is everywhere and it is impossible to avoid conflicting viewpoints. However, not all conflict is bad, nor is it inherently negative. How conflict is handled makes all the difference. It is through proper identification and understanding of conflict that allows for effective resolutions, some of which may yield positive outcomes. In this course, we will examine the different types of conflict, how to understand and embrace the positive aspects of conflict, and how to successfully navigate conflict to positive resolution.\n\nThis course presents the material though video lessons, case studies, and interviews. In each module students will be presented with in-video quiz questions to test their understanding. To further their mastery of the content students will also be asked to complete two peer reviewed assignments.\n\nUpon completing this course, you will be able to:\n1.       Identify the different types of conflict\n2.       Illustrate the positive aspects of conflict\n3.       Provide examples of positive ways to deal with conflict\n\nSHOW ALL ABOUT TYPES OF CONFLICT\nSHOW ALL"
    },
    {
       "Url":"/learn/conflict-resolution-skills?specialization=conflict-management",
       "name":"Conflict Resolution Skills",
       "Rating":"Conflict Resolution Skills\n4.4\nstars\n836 ratings\n•\n206 reviews\n\nResolving conflict in a positive manner is a skill that can be developed and practiced.  Being heard can be one of the most important goals of someone engaged in conflict.  Knowing how to listen and deploy appropriate communication tactics is determinative of whether a conflict will have a positive or negative resolution.  Examine listening skills, appropriate and strategic verbal and non-verbal communication skills, and how to assemble a conflict management plan likely to yield positive resolutions.\n\nUpon completing this course, you will be able to:\n1.       Use active listening skills when dealing with conflict\n2.       Choose appropriate communication tactics when dealing with conflict\n3.       Create a usable plan for managing conflict\n\nSHOW ALL ABOUT CONFLICT RESOLUTION SKILLS\nSHOW ALL"
    },
    {
       "Url":"/learn/intercultural-communication?specialization=conflict-management",
       "name":"Intercultural Communication and Conflict Resolution",
       "Rating":"Intercultural Communication and Conflict Resolution\n4.4\nstars\n457 ratings\n•\n115 reviews\n\nIntercultural Communication and Conflict Resolution is a growing area of importance considering the pace and volume of global transactions.  The ease of global communication using technology, the abundance of cheaper transportation costs, and the frequency of businesses using cross-border talent is fostering millions of interactions a day between people of different cultures.  Examine how the process of communication can be further complicated during interactions between people of different cultures. The topics of stereotypes, generalizations, communication styles, communication strategies, and communication orientations will be explored.\n\nUpon completing this course, you will be able to:\n1.       Explain the dimensions of intercultural interactions that add to conflict\n2.       Analyze the dynamics of intercultural interactions\n3.       Plan strategies for success in intercultural interactions\n\nSHOW ALL ABOUT INTERCULTURAL COMMUNICATION AND CONFLICT RESOLUTION\nSHOW ALL"
    },
    {
       "Url":"/learn/conflict-management-capstone-project?specialization=conflict-management",
       "name":"Conflict Management Project",
       "Rating":"Conflict Management Project\n4.7\nstars\n88 ratings\n•\n16 reviews\n\nThe capstone project is designed to give you the opportunity to apply what you've learned in Types of Conflict, Conflict Resolution, and Intercultural Communication and Conflict Resolution. In this course you will prepare a conflict management portfolio illustrating the nature of a specific conflict, the different roles of participants in the conflict and the significance of those roles, the perceived incompatible goals, power imbalances, and communication skills needed for the effective management of the conflict.\n\nUpon completing this course, you will be able to:\n1.       Create a well organized and complete case study\n2.       Analyze key organizational issues with an integrated action plan for conflict resolution\n3.       Identify appropriate communication skills needed for conflict resolution skills\n4.       Present a portfolio that incorporates concepts learned throughout the Specialization\n5.       Reflect on what you've learned throughout the Specialization\n\nSHOW ALL ABOUT CONFLICT MANAGEMENT PROJECT\nSHOW ALL"
    },
    "/specializations/good-with-words",
    {
       "Url":"/learn/writing-editing-words?specialization=good-with-words",
       "name":"Writing and Editing: Word Choice and Word Order",
       "Rating":"Writing and Editing: Word Choice and Word Order\n4.7\nstars\n1,105 ratings\n•\n274 reviews\n\nThis course will teach you how to use your written words to become more persuasive. You’ll learn creative ways to use syntax, effective techniques for telling stories, and a clever method for arranging a complex series of information. You’ll also get a chance to both professionalize your use of punctuation and add a bit of style and sophistication to how you craft everything from sentences to slogans.  \n\nIn addition, you’ll get access to a wide range of books and other resources you can use even after you finish the course. These include (1) the readings and exercises provided to the students who have taken the in-person version of this course at the University of Michigan and the University of Chicago; (2) two digital libraries of excellent writing from a diverse collection of journalists, scientists, novelists, poets, historians, and entrepreneurs; and (3) a monthly “Good Sentences” email. Social media has only accelerated the ways in which we all must learn to use our writing to connect, compete, and create—sometimes all at once. So join us for this first course in a four-part series and experience the many benefits, both personal and professional, of becoming “good with words.”\n\nSHOW ALL ABOUT WRITING AND EDITING: WORD CHOICE AND WORD ORDER\nSHOW ALL"
    },
    {
       "Url":"/learn/writing-editing-structure?specialization=good-with-words",
       "name":"Writing and Editing: Structure and Organization",
       "Rating":"Writing and Editing: Structure and Organization\n4.8\nstars\n311 ratings\n•\n60 reviews\n\nThis second course in the Good with Words: Writing and Editing series will help you become an effective architect of information, both with your sentences and with your paragraphs. You’ll learn that the traditional advice to “Show, don’t tell” is incomplete and that skilled writers actually switch back and forth between showing and telling.\n\nYou’ll also learn more about the menu of time management techniques introduced in the first course of the series, including “deep work,” “studio time,” and “the Animal Farm Principle.” And as with the other three courses in this series, you will get access to a wide range of books and other resources you can use even after you finish the course. These include:\n\n(1)the readings and exercises provided to the students who have taken the in-person version of this course at the University of Michigan and the University of Chicago;\n\n(2)two digital libraries of excellent writing from a diverse collection of journalists, scientists, novelists, poets, historians, and entrepreneurs; \n\n(3)a monthly “Good Sentences” email.\n\nSHOW ALL ABOUT WRITING AND EDITING: STRUCTURE AND ORGANIZATION\nSHOW ALL"
    },
    {
       "Url":"/learn/writing-editing-drafting?specialization=good-with-words",
       "name":"Writing and Editing: Drafting",
       "Rating":"Writing and Editing: Drafting\n4.8\nstars\n199 ratings\n•\n41 reviews\n\nThis third course in the “Good with Words: Writing and Editing” series will give you a number of strategies to help with what is often the most intimidating, even paralyzing part of the writing process: getting started.\n\nYou’ll learn about the “planning fallacy” and “temptation bundling.” You’ll get a chance to experiment with “freewriting” and “writing before you are ready.” And you’ll continue to benefit, through our ongoing “Good Sentences” and “Takeaways” segments, from the models and advice of a diverse set of writers. \n\nAs with the other three courses in this series, you will also get access to a wide range of books and other resources you can use even after you finish the course. These include:\n\n(1)the readings and exercises provided to the students who have taken the in-person version of this course at the University of Michigan and the University of Chicago;\n\n(2)two digital libraries of excellent writing from a diverse collection of journalists, scientists, novelists, poets, historians, and entrepreneurs; \n\n(3)a monthly “Good Sentences” email.\n\nSHOW ALL ABOUT WRITING AND EDITING: DRAFTING\nSHOW ALL"
    },
    {
       "Url":"/learn/writing-editing-revising?specialization=good-with-words",
       "name":"Writing and Editing: Revising",
       "Rating":"Writing and Editing: Revising\n4.8\nstars\n191 ratings\n•\n46 reviews\n\nThis fourth and final course in the “Good with Words: Writing and Editing” series will help you master perhaps the most important step in the writing process: revising. You’ll learn about the difference between editing and proofreading. You’ll practice “un-numbing the numbers” so that data and statistics you use are clear and compelling. And you’ll be introduced to a framework for giving and receiving feedback that helpfully systematizes what should be cut and what should be kept from each draft.\n\nAs with the other three courses in this series, you will also get access to a wide range of books and other resources you can use even after you finish the course. These include:\n\n(1)the readings and exercises provided to the students who have taken the in-person version of this course at the University of Michigan and the University of Chicago;\n\n(2)two digital libraries of excellent writing from a diverse collection of journalists, scientists, novelists, poets, historians, and entrepreneurs; \n\n(3)a monthly “Good Sentences” email.\n\nSHOW ALL ABOUT WRITING AND EDITING: REVISING\nSHOW ALL"
    },
    "/specializations/logic-critical-thinking-duke",
    {
       "Url":"/learn/understanding-arguments?specialization=logic-critical-thinking-duke",
       "name":"Think Again I: How to Understand Arguments",
       "Rating":"Think Again I: How to Understand Arguments\n4.6\nstars\n2,590 ratings\n•\n701 reviews\n\nIn this course, you will learn what an argument is. The definition of argument will enable you to identify when speakers are giving arguments and when they are not. Next, you will learn how to break an argument into its essential parts, how to put them in order to reveal their connections, and how to fill in gaps in an argument by adding suppressed premises. By the end of this course, you will be better able to understand and appreciate arguments that you and other people present.\n\nSuggested Readings:\nStudents who want more detailed explanations or additional exercises or who want to explore these topics in more depth should consult Understanding Arguments: An Introduction to Informal Logic, Ninth Edition, Concise, Chapters 1-5, by Walter Sinnott-Armstrong and Robert Fogelin.\n\nCourse Format:\nEach week will be divided into multiple video segments that can be viewed separately or in groups. There will be short ungraded quizzes after each segment (to check comprehension) and a longer graded quiz at the end of the course.\n\nSHOW ALL ABOUT THINK AGAIN I: HOW TO UNDERSTAND ARGUMENTS\nSHOW ALL"
    },
    {
       "Url":"/learn/deductive-reasoning?specialization=logic-critical-thinking-duke",
       "name":"Think Again II: How to Reason Deductively",
       "Rating":"Think Again II: How to Reason Deductively\n4.4\nstars\n320 ratings\n•\n56 reviews\n\nDeductive arguments are supposed to be valid in the sense that the premises guarantee that the conclusion is true. In this course, you will learn how to use truth-tables and Venn diagrams to represent the information contained in the premises and conclusion of an argument so that you can determine whether or not the argument is deductively valid.  \n\nSuggested Readings:\nStudents who want more detailed explanations or additional exercises or who want to explore these topics in more depth should consult Understanding Arguments: An Introduction to Informal Logic, Ninth Edition, Concise, Chapters 6 and 7 by Walter Sinnott-Armstrong and Robert Fogelin.\n\nCourse Format:\nEach week will be divided into multiple video segments that can be viewed separately or in groups. There will be short ungraded quizzes after each segment (to check comprehension) and a longer graded quiz at the end of the course.\n\nSHOW ALL ABOUT THINK AGAIN II: HOW TO REASON DEDUCTIVELY\nSHOW ALL"
    },
    {
       "Url":"/learn/inductive-reasoning?specialization=logic-critical-thinking-duke",
       "name":"Think Again III: How to Reason Inductively",
       "Rating":"Think Again III: How to Reason Inductively\n4.8\nstars\n240 ratings\n•\n43 reviews\n\nWant to solve a murder mystery? What caused your computer to fail? Who can you trust in your everyday life? In this course, you will learn how to analyze and assess five common forms of inductive arguments: generalizations from samples, applications of generalizations, inference to the best explanation, arguments from analogy, and causal reasoning. The course closes by showing how you can use probability to help make decisions of all sorts.\n\nSuggested Readings\nStudents who want more detailed explanations or additional exercises or who want to explore these topics in more depth should consult Understanding Arguments: An Introduction to Informal Logic, Ninth Edition, Concise, Chapters 8-12, by Walter Sinnott-Armstrong and Robert Fogelin.\n\nCourse Format\nEach week will be divided into multiple video segments that can be viewed separately or in groups. There will be short ungraded quizzes after each segment (to check comprehension) and a longer graded quiz at the end of the course.\n\nSHOW ALL ABOUT THINK AGAIN III: HOW TO REASON INDUCTIVELY\nSHOW ALL"
    },
    {
       "Url":"/learn/logical-fallacies?specialization=logic-critical-thinking-duke",
       "name":"Think Again IV: How to Avoid Fallacies",
       "Rating":"Think Again IV: How to Avoid Fallacies\n4.7\nstars\n264 ratings\n•\n44 reviews\n\nWe encounter fallacies almost everywhere we look. Politicians, salespeople, and children commonly use fallacies in order to get you to think whatever they want you to think. It’s important to learn to recognize fallacies so that you can avoid being fooled by them. It’s also important to learn about fallacies so that you avoid making fallacious arguments yourself. This course will show you how to identify and avoid many of the fallacies that lead people astray.\n\nIn this course, you will learn about fallacies. Fallacies are arguments that suffer from one or more common but avoidable defects:  equivocation, circularity, vagueness, etc. It’s important to learn about fallacies so that you can recognize them when you see them, and not be fooled by them. It’s also important to learn about fallacies so that you avoid making fallacious arguments yourself.\n\nSuggested Readings\nStudents who want more detailed explanations or additional exercises or who want to explore these topics in more depth should consult Understanding Arguments: An Introduction to Informal Logic, Ninth Edition, Concise, Chapters 13-17, by Walter Sinnott-Armstrong and Robert Fogelin.\n\nCourse Format\nEach week will be divided into multiple video segments that can be viewed separately or in groups. There will be short ungraded quizzes after each segment (to check comprehension) and a longer graded quiz at the end of the course.\n\nSHOW ALL ABOUT THINK AGAIN IV: HOW TO AVOID FALLACIES\nSHOW ALL"
    },
    "/specializations/data-analytics-business",
    {
       "Url":"/learn/data-analytics-business?specialization=data-analytics-business",
       "name":"Introduction to Data Analytics for Business",
       "Rating":"Introduction to Data Analytics for Business\n4.7\nstars\n2,752 ratings\n•\n741 reviews\n\nThis course will expose you to the data analytics practices executed in the business world. We will explore such key areas as the analytical process, how data is created, stored, accessed, and how the organization works with data and creates the environment in which analytics can flourish.\n\nWhat you learn in this course will give you a strong foundation in all the areas that support analytics and will help you to better position yourself for success within your organization. You’ll develop skills and a perspective that will make you more productive faster and allow you to become a valuable asset to your organization.\n\nThis course also provides a basis for going deeper into advanced investigative and computational methods, which you have an opportunity to explore in future courses of the Data Analytics for Business specialization.\n\nSHOW ALL ABOUT INTRODUCTION TO DATA ANALYTICS FOR BUSINESS\nSHOW ALL"
    },
    {
       "Url":"/learn/predictive-modeling-analytics?specialization=data-analytics-business",
       "name":"Predictive Modeling and Analytics",
       "Rating":"Predictive Modeling and Analytics\n3.6\nstars\n533 ratings\n•\n195 reviews\n\nWelcome to the second course in the Data Analytics for Business specialization! \n\nThis course will introduce you to some of the most widely used predictive modeling techniques and their core principles. By taking this course, you will form a solid foundation of predictive analytics, which refers to tools and techniques for building statistical or machine learning models to make predictions based on data. You will learn how to carry out exploratory data analysis to gain insights and prepare data for predictive modeling, an essential skill valued in the business. \n\nYou’ll also learn how to summarize and visualize datasets using plots so that you can present your results in a compelling and meaningful way. We will use a practical predictive modeling software, XLMiner, which is a popular Excel plug-in. This course is designed for anyone who is interested in using data to gain insights and make better business decisions. The techniques discussed are applied in all functional areas within business organizations including accounting, finance, human resource management, marketing, operations, and strategic planning. \n\nThe expected prerequisites for this course include a prior working knowledge of Excel, introductory level algebra, and basic statistics.\n\nSHOW ALL ABOUT PREDICTIVE MODELING AND ANALYTICS \nSHOW ALL"
    },
    {
       "Url":"/learn/business-analytics-decision-making?specialization=data-analytics-business",
       "name":"Business Analytics for Decision Making",
       "Rating":"Business Analytics for Decision Making\n4.6\nstars\n1,618 ratings\n•\n416 reviews\n\nIn this course you will learn how to create models for decision making. We will start with cluster analysis, a technique for data reduction that is very useful in market segmentation. You will then learn the basics of Monte Carlo simulation that will help you model the uncertainty that is prevalent in many business decisions. A key element of decision making is to identify the best course of action. Since businesses problems often have too many alternative solutions, you will learn how optimization can help you identify the best option. What is really exciting about this course is that you won’t need to know a computer language or advanced statistics to learn about these predictive and prescriptive analytic models. The Analytic Solver Platform and basic knowledge of Excel is all you’ll need. Learners participating in assignments will be able to get free access to the Analytic Solver Platform.\n\nSHOW ALL ABOUT BUSINESS ANALYTICS FOR DECISION MAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/communicating-business-analytics-results?specialization=data-analytics-business",
       "name":"Communicating Business Analytics Results",
       "Rating":"Communicating Business Analytics Results\n4.5\nstars\n414 ratings\n•\n85 reviews\n\nThe analytical process does not end with models than can predict with accuracy or prescribe the best solution to business problems. Developing these models and gaining insights from data do not necessarily lead to successful implementations. This depends on the ability to communicate results to those who make decisions. Presenting findings to decision makers who are not familiar with the language of analytics presents a challenge. In this course you will learn how to communicate analytics results to  stakeholders who do not understand the details of analytics but want evidence of analysis and data. You will be able to choose the right vehicles to present quantitative information, including those based on principles of data visualization. You will also learn how to develop and deliver data-analytics stories that provide context, insight, and interpretation.\n\nSHOW ALL ABOUT COMMUNICATING BUSINESS ANALYTICS RESULTS\nSHOW ALL"
    },
    {
       "Url":"/learn/data-analytics-business-capstone?specialization=data-analytics-business",
       "name":"Advanced Business Analytics Capstone",
       "Rating":"Advanced Business Analytics Capstone\n4.3\nstars\n53 ratings\n•\n17 reviews\n\nThe analytics process is a collection of interrelated activities that lead to better decisions and to a higher business performance. The capstone of this specialization is designed with the goal of allowing you to experience this process. The capstone project will take you from data to analysis and models, and ultimately to presentation of insights. \n\nIn this capstone project, you will analyze the data on financial loans to help with the investment decisions of an investment company. You will go through all typical steps of a data analytics project, including data understanding and cleanup, data analysis, and presentation of analytical results. \nFor the first week, the goal is to understand the data and prepare the data for analysis. As we discussed  in this specialization, data preprocessing and cleanup is often the first step in data analytics projects. Needless to say, this step is crucial for the success of this project.  \n\nIn the second week, you will perform some predictive analytics tasks, including classifying loans and predicting losses from defaulted loans. You will try a variety of tools and techniques  this week, as the predictive accuracy of different tools can vary quite a bit. It is rarely the case that the default model produced by ASP is the best model possible. Therefore, it is important for you to tune the different models in order to improve the performance.\n\nBeginning in the third week, we turn our attention to prescriptive analytics, where you will provide some concrete suggestions on how to allocate investment funds using analytics tools, including clustering and simulation based optimization. You will see that allocating funds wisely is crucial for the financial return of the investment portfolio.\n\nIn the last week, you are expected to present your analytics results to your clients. Since you will obtain many results in your project, it is important for you to judiciously choose what to include in your presentation. You are also expected to follow the principles we covered in the courses in preparing your presentation.\n\nSHOW ALL ABOUT ADVANCED BUSINESS ANALYTICS CAPSTONE\nSHOW ALL"
    },
    "/specializations/deep-learning",
    {
       "Url":"/learn/neural-networks-deep-learning?specialization=deep-learning",
       "name":"Neural Networks and Deep Learning",
       "Rating":"Neural Networks and Deep Learning\n4.9\nstars\n108,847 ratings\n•\n21,713 reviews\n\nIn the first course of the Deep Learning Specialization, you will study the foundational concept of neural networks and deep learning. \n\nBy the end, you will be familiar with the significant technological trends driving the rise of deep learning; build, train, and apply fully connected deep neural networks; implement efficient (vectorized) neural networks; identify key parameters in a neural network’s architecture; and apply deep learning to your own applications.\n\nThe Deep Learning Specialization is our foundational program that will help you understand the capabilities, challenges, and consequences of deep learning and prepare you to participate in the development of leading-edge AI technology. It provides a pathway for you to gain the knowledge and skills to apply machine learning to your work, level up your technical career, and take the definitive step in the world of AI.\n\nSHOW ALL ABOUT NEURAL NETWORKS AND DEEP LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/deep-neural-network?specialization=deep-learning",
       "name":"Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization",
       "Rating":"Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization\n4.9\nstars\n59,290 ratings\n•\n6,850 reviews\n\nIn the second course of the Deep Learning Specialization, you will open the deep learning black box to understand the processes that drive performance and generate good results systematically. \n\nBy the end, you will learn the best practices to train and develop test sets and analyze bias/variance for building deep learning applications; be able to use standard neural network techniques such as initialization, L2 and dropout regularization, hyperparameter tuning, batch normalization, and gradient checking; implement and apply a variety of optimization algorithms, such as mini-batch gradient descent, Momentum, RMSprop and Adam, and check for their convergence; and implement a neural network in TensorFlow.\n\nThe Deep Learning Specialization is our foundational program that will help you understand the capabilities, challenges, and consequences of deep learning and prepare you to participate in the development of leading-edge AI technology. It provides a pathway for you to gain the knowledge and skills to apply machine learning to your work, level up your technical career, and take the definitive step in the world of AI.\n\nSHOW ALL ABOUT IMPROVING DEEP NEURAL NETWORKS: HYPERPARAMETER TUNING, REGULARIZATION AND OPTIMIZATION\nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-projects?specialization=deep-learning",
       "name":"Structuring Machine Learning Projects",
       "Rating":"Structuring Machine Learning Projects\n4.8\nstars\n47,192 ratings\n•\n5,421 reviews\n\nIn the third course of the Deep Learning Specialization, you will learn how to build a successful machine learning project and get to practice decision-making as a machine learning project leader. \n\nBy the end, you will be able to diagnose errors in a machine learning system; prioritize strategies for reducing errors; understand complex ML settings, such as mismatched training/test sets, and comparing to and/or surpassing human-level performance; and apply end-to-end learning, transfer learning, and multi-task learning.\n\nThis is also a standalone course for learners who have basic machine learning knowledge. This course draws on Andrew Ng’s experience building and shipping many deep learning products. If you aspire to become a technical leader who can set the direction for an AI team, this course provides the \"industry experience\" that you might otherwise get only after years of ML work experience.\n \nThe Deep Learning Specialization is our foundational program that will help you understand the capabilities, challenges, and consequences of deep learning and prepare you to participate in the development of leading-edge AI technology. It provides a pathway for you to gain the knowledge and skills to apply machine learning to your work, level up your technical career, and take the definitive step in the world of AI.\n\nSHOW ALL ABOUT STRUCTURING MACHINE LEARNING PROJECTS\nSHOW ALL"
    },
    {
       "Url":"/learn/convolutional-neural-networks?specialization=deep-learning",
       "name":"Convolutional Neural Networks",
       "Rating":"Convolutional Neural Networks\n4.9\nstars\n39,548 ratings\n•\n5,229 reviews\n\nIn the fourth course of the Deep Learning Specialization, you will understand how computer vision has evolved and become familiar with its exciting applications such as autonomous driving, face recognition, reading radiology images, and more.\n\nBy the end, you will be able to build a convolutional neural network, including recent variations such as residual networks; apply convolutional networks to visual detection and recognition tasks; and use neural style transfer to generate art and apply these algorithms to a variety of image, video, and other 2D or 3D data. \n\nThe Deep Learning Specialization is our foundational program that will help you understand the capabilities, challenges, and consequences of deep learning and prepare you to participate in the development of leading-edge AI technology. It provides a pathway for you to gain the knowledge and skills to apply machine learning to your work, level up your technical career, and take the definitive step in the world of AI.\n\nSHOW ALL ABOUT CONVOLUTIONAL NEURAL NETWORKS\nSHOW ALL"
    },
    {
       "Url":"/learn/nlp-sequence-models?specialization=deep-learning",
       "name":"Sequence Models",
       "Rating":"Sequence Models\n4.8\nstars\n27,023 ratings\n•\n3,212 reviews\n\nIn the fifth course of the Deep Learning Specialization, you will become familiar with sequence models and their exciting applications such as speech recognition, music synthesis, chatbots, machine translation, natural language processing (NLP), and more. \n\nBy the end, you will be able to build and train Recurrent Neural Networks (RNNs) and commonly-used variants such as GRUs and LSTMs; apply RNNs to Character-level Language Modeling; gain experience with natural language processing and Word Embeddings; and use HuggingFace tokenizers and transformer models to solve different NLP tasks such as NER and Question Answering.\n\nThe Deep Learning Specialization is a foundational program that will help you understand the capabilities, challenges, and consequences of deep learning and prepare you to participate in the development of leading-edge AI technology. It provides a pathway for you to take the definitive step in the world of AI by helping you gain the knowledge and skills to level up your career.\n\nSHOW ALL ABOUT SEQUENCE MODELS\nSHOW ALL"
    },
    "/specializations/sustainable-transformation",
    {
       "Url":"/learn/systems-mindset?specialization=sustainable-transformation",
       "name":"Developing a Systems Mindset",
       "Rating":"Developing a Systems Mindset\n4.2\nstars\n77 ratings\n•\n16 reviews\n\nA Systems Mindset teaches learners how to interact effectively as service providers, consultants, researchers, developers, or other professionals providing a service or product to a person, group, or community. This course provides the basic foundations for policy makers, real estate developers, consultants, government agencies, engineers, and non-profit organizations the first steps in engaging complex problems where engagement with communities and stakeholders is necessary.  Being a successful professional requires creative, innovative, and entrepreneurial thinking, and to continually have a problem-solving mindset. Yes, absolutely!  But you also need to be a listener. You need to truly value the community and stakeholders - the ones who have the most to gain and lose from your actions. It is important for you to listen, learn what is important, and then act.  This course will highlight the urgency for you to have a systems mindset to engage complex problems for a systems perspective, meaning that you have approach problems from different angles, scales and perspectives.  This class is the first step in creating that mindset and for you to effectively engage – from receiving the “ask” for “assistance”, to orienting yourself to the issue, understanding the community, and developing a project plan. Students will learn how to use a systems mindset to understand scaled systems, nested hierarchies, and the interactions between social and environmental systems. Students will also learn practical skills and techniques that build rapport, trust, and buy-in.\n\nSHOW ALL ABOUT DEVELOPING A SYSTEMS MINDSET\nSHOW ALL"
    },
    {
       "Url":"/learn/effective-engagement?specialization=sustainable-transformation",
       "name":"Strategies for Effective Engagement",
       "Rating":"Strategies for Effective Engagement\n4.6\nstars\n26 ratings\n•\n5 reviews\n\nBeing a successful professional requires creative, innovative, and entrepreneurial thinking, and to continually have a problem-solving mindset. As a systems thinker, you are expected to engage complex problems from multiple perspectives and different angles, viewing them holistically. This course exposes the student to a variety of tools used to engage stakeholders, collect data, and more deeply understand the community. This course will have three modules. Techniques for Data Collection will reinforce the importance of built trust and rapport with your client and stakeholders, which in turn creates buy in. Students will then learn how to enter a community, conduct rapid assessments to provide a snapshot of the community or organization, and maintain ethical conduct throughout. System Mapping & Analysis will focus on mapping systems and stakeholders, two different techniques that are useful to visualize systems and identify and evaluate a network of stakeholders. Finally, in Conducting Interviews & Surveys, students will learn different techniques to collect information. From focus group interview to one-on-one interviews, to surveys, systems thinkers need a mix of approaches in their toolbox to identify assess needs and assets, engage stakeholders, and collect information throughout all phases of project implementation.\n\nSHOW ALL ABOUT STRATEGIES FOR EFFECTIVE ENGAGEMENT \nSHOW ALL"
    },
    {
       "Url":"/learn/transforming-communities?specialization=sustainable-transformation",
       "name":"Transforming Communities",
       "Rating":"Transforming Communities\n4.5\nstars\n35 ratings\n•\n7 reviews\n\nThis course focuses on communities and organizations in transition, and using the skills and new knowledge you have to lead change. In this course, we will discuss fundamentals of sustainability and resilience. We then go over the essentials of being a change maker. This course will provide further opportunity for skill building. We will go over asset mapping and needs assessments, two important skills that will be used for you to work with your clients so understand community and organizational needs, and have broad engagement, and use a systems-based approach to so that that the community can define its own needs and identify its own assets. This course will have three modules. Sustainability & Resilience will provide the basic principles of sustainability and resilience so that you will know the difference of these concepts and potential means of implementing them in your workplace and place of practice. In Needs Assessment & Asset Mapping, I will go over two important techniques that provide the community and organization needs front and center and allow you to engage stakeholders so that they have a voice and are involved throughout the process. Systems Thinking for Change will focus on using systems thinking principles as a changemaker, and provides tips and motivation for making change. Whether you work in a Fortune 500 company or a small non-profit, are a community organizer, it is time for you to step up and step out and put your new knowledge into practice. The road won’t always be easy and often non-liner. But real change requires radical change and true and genuine engagement with the people who will see and experience that change every day.\n\nSHOW ALL ABOUT TRANSFORMING COMMUNITIES\nSHOW ALL"
    },
    "/specializations/abnormal-psychology",
    {
       "Url":"/learn/intro-abnormal-psych?specialization=abnormal-psychology",
       "name":"Introduction to Abnormal Psychology",
       "Rating":"Introduction to Abnormal Psychology\n\nThis course presents an overview of the major domains of abnormal psychology. The course is made up of 5 modules, the first of which provides an introduction to the field through discussions of the concept of psychological abnormality, assessment and classification, and the major models in use for understanding psychological abnormality.  The remaining four modules provide overviews of major domains of abnormal psychology, including mood disorders, anxiety disorders, stress and trauma-related disorders, and schizophrenia spectrum disorders.  Lectures within each of these modules address symptoms and behaviors, epidemiology, causal theories, treatment interventions and multicultural findings and considerations.  \n\nThe course also seeks to assist participants with becoming more adept at noticing when a family member, friend, or colleague may be experiencing psychological distress, as well as develop the comfort level required for initiating an empathic, compassionate conversation with a person of concern.  Toward this goal, the last lecture of each module is dedicated to the topic “Foundations of Empathy.”\n\nThis course is not designed to assist participants with resolving their own experiences of psychopathology, nor it is intended to prepare participants to act as psychotherapists for distressed individuals in their personal lives.\n\nSHOW ALL ABOUT INTRODUCTION TO ABNORMAL PSYCHOLOGY\nSHOW ALL"
    },
    {
       "Url":"/learn/history-mental-illness?specialization=abnormal-psychology",
       "name":"History of Mental Illness",
       "Rating":"History of Mental Illness\n\nOur lexicon of mental illness is immense: There currently are hundreds of classified disorders and an extensive assortment of medications and therapies. This course explores the history of this productive science -- its discoveries, classifications, and treatments of psychiatric distress. The excursion begins with a general introduction and proceeds to explore 4 kinds of mental illness: neurasthenia, depression, attention deficits (ADD/ADHD), and narcissism. Each kind is examined in terms of its scientific research and classification; treatments developed to cure or alleviate its symptoms; lived-experiences of those so diagnosed with the disorder; and critical reflection on the diagnosis. \n\nThis course departs from histories that mainly chronicle scientific achievements and, instead, invites you to investigate how the scientific discoveries and therapies were deeply informed by cultural conditions of the time. The cultural influences on psychiatric science include ideals of individual happiness; conceptions about what is ‘normal’; notions of rational personhood; and existing social, gender, and racial hierarchies/biases. We investigate these cultural dynamics and then look at the lived experiences of those who were diagnosed or living with the condition. Paying attention to culture and lived experiences accords with the perspective of “mad studies,” a recent movement to foreground the people who suffer and the socio-political conditions surrounding their experiences. Exploring cultural dynamics and lived experiences along with the scientific milestones prepares us to critically reflect on world of psychopathology and on psychopathology in the world.  In our reflection classes we will ask, for instance, about the forces behind incredible increases in depression and attention deficit disorder; racial and gender biases in research and treatment; the apparent happiness epidemic; and the prospects of neurodiversity.\n\nSHOW ALL ABOUT HISTORY OF MENTAL ILLNESS\nSHOW ALL"
    },
    {
       "Url":"/learn/behavioral-change?specialization=abnormal-psychology",
       "name":"Creating Behavioral Change",
       "Rating":"Creating Behavioral Change\n\nIn this course you will learn about understanding and changing mental and physical health behavior. We will examine both the historical context and the current science. Major topics will include fundamental behavioral principles and basic elements of empirically supported individual treatments (e.g., motivational interviewing, cognitive behavioral therapies). Lectures and examples will illustrate both the theory and the practice of evidence-based approaches to behavior change. You will engage in a course-long behavior change experiment as well as brief quizzes. Please note: this course is designed to introduce you to a range of contemporary approaches to behavioral treatments; however, it will not provide the skills needed to implement psychological interventions with others (this requires years of graduate training) nor is it designed to address or resolve your own psychological problems.\n\nFor each module, students will complete 1 assignment related to their personal behavior change project and 1 quiz on the week’s material.\n\nSHOW ALL ABOUT CREATING BEHAVIORAL CHANGE\nSHOW ALL"
    },
    "/specializations/excel",
    {
       "Url":"/learn/excel-essentials?specialization=excel",
       "name":"Excel Skills for Business: Essentials",
       "Rating":"Excel Skills for Business: Essentials\n4.9\nstars\n38,517 ratings\n•\n10,419 reviews\n\nIn this first course of the specialization Excel Skills for Business, you will learn the essentials of Microsoft Excel. Within six weeks, you will be able to expertly navigate the Excel user interface, perform basic calculations with formulas and functions, professionally format spreadsheets, and create visualizations of data through charts and graphs.\n\nWhether you are self-taught and want to fill in the gaps for better efficiency and productivity, or whether you have never used Excel before, this course will set you up with a solid foundation to become a confident user and develop more advanced skills in later courses. \n\nThe best way to learn Excel is to use Excel. In this course, learners will solve a broad range of business problems as they apply the Excel skills and techniques they learn along the way. This course uses downloadable Excel workbooks and full data sets with applied examples and practical challenge exercises. This provides learners with countless opportunities to practice their Excel skills while discovering new and useful productivity features of Excel for a variety of business contexts.\n\nSpreadsheet software is one of the most ubiquitous pieces of software used in workplaces across the world. Learning to confidently operate this software means adding a highly valuable asset to your employability portfolio. At a time when digital skills jobs are growing much faster than non-digital jobs, make sure to position yourself ahead of the rest by adding Excel skills to your employment portfolio.\n\nSHOW ALL ABOUT EXCEL SKILLS FOR BUSINESS: ESSENTIALS\nSHOW ALL"
    },
    {
       "Url":"/learn/excel-intermediate-1?specialization=excel",
       "name":"Excel Skills for Business: Intermediate I",
       "Rating":"Excel Skills for Business: Intermediate I\n4.9\nstars\n13,516 ratings\n•\n3,124 reviews\n\nSpreadsheet software remains one of the most ubiquitous pieces of software used in workplaces across the world. Learning to confidently operate this software means adding a highly valuable asset to your employability portfolio. In the United States alone, millions of job advertisements requiring Excel skills are posted every day. Research by Burning Glass Technologies and Capital One shows that digitals skills lead to higher income and better employment opportunities at a time when digital skills job are growing much faster than non-digital jobs.\n\nIn this second course of our Excel specialization Excel Skills for Business you will build on the strong foundations of the Essentials course. Intermediate Skills I will expand your Excel knowledge to new horizons. You are going to discover a whole range of skills and techniques that will become a standard component of your everyday use of Excel. In this course, you will build a solid layer of more advanced skills so you can manage large datasets and create meaningful reports. These key techniques and tools will allow you to add a sophisticated layer of automation and efficiency to your everyday tasks in Excel.\n\nOnce again, we have brought together a great teaching team that will be with you every step of the way. Prashan and Nicky will guide you through each week (and I am even going to make a guest appearance in Week 5 to help you learn about my favourite tool in Excel - shh, no spoilers!). Work through each new challenge step-by-step and in no time you will surprise yourself by how far you have come. This time around, we are going to follow Uma's trials and tribulations as she is trying to find her feet in a new position in the fictitious company PushPin. For those of you who have done the Essentials course, you will already be familiar with the company. Working through her challenges which are all too common ones that we encounter everyday, will help you to more easily relate to the skills and techniques learned in each week and apply them to familiar and new contexts.\n\nSHOW ALL ABOUT EXCEL SKILLS FOR BUSINESS: INTERMEDIATE I\nSHOW ALL"
    },
    {
       "Url":"/learn/excel-intermediate-2?specialization=excel",
       "name":"Excel Skills for Business: Intermediate II",
       "Rating":"Excel Skills for Business: Intermediate II\n4.8\nstars\n6,485 ratings\n•\n1,492 reviews\n\nSpreadsheet software remains one of the most ubiquitous pieces of software used in workplaces across the world. Learning to confidently operate this software means adding a highly valuable asset to your employability portfolio. In this third course of our Excel specialization Excel Skills for Business you will delve deeper into some of the most powerful features Excel has to offer. When you have successfully completed the course you will be able to\n\nCheck for and prevent errors in spreadsheets; \nCreate powerful automation in spreadsheets; \nApply advanced formulas and conditional logic to help make informed business decisions; and\nCreate spreadsheets that help forecast and model data. \n\nOnce again, we have brought together a great teaching team that will be with you every step of the way. Nicky, Prashan and myself will guide you through each week. As we are exploring these more advanced topics, we are following Alex who is an Excel consultant called in by businesses that experience issues with their spreadsheets.\n\nSHOW ALL ABOUT EXCEL SKILLS FOR BUSINESS: INTERMEDIATE II\nSHOW ALL"
    },
    {
       "Url":"/learn/excel-advanced?specialization=excel",
       "name":"Excel Skills for Business: Advanced",
       "Rating":"Excel Skills for Business: Advanced\n4.7\nstars\n4,517 ratings\n•\n1,150 reviews\n\nSpreadsheet software remains one of the most ubiquitous pieces of software used in workplaces around the world. Learning to confidently operate this software means adding a highly valuable asset to your employability portfolio. Across the globe, millions of job advertisements requiring Excel skills are posted every day. At a time when digital skills jobs are growing much faster than non-digital jobs, completing this course will position you ahead of others, so keep reading.\n\nIn this last course of our Specialization Excel Skills for Business you will build on the strong foundations of the first three courses: Essentials, Intermediate I + II.  In the Advanced course, we will prepare you to become a power user of Excel - this is your last step before specializing at a professional level. The topics we have prepared will challenge you as you learn how to use advanced formula techniques and sophisticated lookups. You will clean and prepare data for analysis, and learn how to work with dates and financial functions. An in-depth look at spreadsheet design and documentation will prepare you for our big finale, where you will learn how to build professional dashboards in Excel.\n\nSHOW ALL ABOUT EXCEL SKILLS FOR BUSINESS: ADVANCED\nSHOW ALL"
    },
    "/specializations/graphic-design",
    {
       "Url":"/learn/fundamentals-of-graphic-design?specialization=graphic-design",
       "name":"Fundamentals of Graphic Design",
       "Rating":"Fundamentals of Graphic Design\n4.8\nstars\n13,883 ratings\n•\n3,589 reviews\n\nGraphic Design is all around us! Words and pictures—the building blocks of graphic design—are the elements that carry the majority of the content in both the digital world and the printed world. As graphic design becomes more visible and prevalent in our lives, graphic design as a practice becomes more important in our culture.\n\nThrough visual examples, this course will teach you the fundamental principles of graphic design: imagemaking, typography, composition, working with color and shape... foundational skills that are common in all areas of graphic design practice. I don't just want you to watch a video of someone talking about design, I want you to MAKE design! If you want to be a designer you have to be a maker and a communicator, so this course will offer you lots of opportunities to get your hands dirty with exercises and with more practical projects.\n\nAt the end of this course you will have learned how to explore and investigate visual representation through a range of image-making techniques; understand basic principles of working with shape, color and pattern; been exposed to the language and skills of typography; and understand and have applied the principles of composition and visual contrast. If you complete the course, along with its optional (but highly recommended) briefs, you will have a core set of graphic design skills that you can apply to your own projects, or to more deeply investigate a specialized area of graphic design.\n\nTo succeed in this course you will need access to a computer. You can complete this course without one but it will be tougher. Access to, and a beginner's level knowledge of Adobe Creative Suite programs, such as Illustrator, Photoshop and InDesign will help you, especially if you want to complete the optional briefs.\n\nSHOW ALL ABOUT FUNDAMENTALS OF GRAPHIC DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/typography?specialization=graphic-design",
       "name":"Introduction to Typography",
       "Rating":"Introduction to Typography\n4.8\nstars\n4,756 ratings\n•\n1,011 reviews\n\nTypography is the art of manipulating the visual form of language to enrich and control its meaning. It’s an essential area of skill and knowledge for graphic designers. Typography predates modern graphic design by around 500 years; it is rich in rules, conventions, and esoteric terminology—but it remains an exciting space for invention and expression.\n\nIn this rigorous introductory course, we will study, name, and measure the characteristics of letterforms. We’ll consider the pragmatic concerns involved in selecting and combining type. We’ll peek into the rich historical, cultural, and aesthetic histories of familiar typefaces. We’ll discuss time-tested conventions and best practices in setting type, as governed by principles of hierarchy and spatial organization. And we’ll explore the expressive, meaning-making potential of type. \n\nInformative lectures will be complemented by a series of three peer-assessed assignments, culminating in an opportunity to design a full-scale typographic poster.\n\nPlease note that this is not a software course; a basic working knowledge of Adobe InDesign or other page layout software will be assumed. You will need access to a computer and page layout software, such as InDesign, to complete the assignments.\n\nSHOW ALL ABOUT INTRODUCTION TO TYPOGRAPHY\nSHOW ALL"
    },
    {
       "Url":"/learn/image-making?specialization=graphic-design",
       "name":"Introduction to Imagemaking",
       "Rating":"Introduction to Imagemaking\n4.5\nstars\n2,406 ratings\n•\n529 reviews\n\nThis course for serious makers, and for students new to imagemaking. Imagemaking is a fluid and exciting area of graphic design that comes out of practice and process: experimenting fearlessly, showing and sharing ideas, and giving and receiving knowledgeable and constructive input.\n\nFor the sake of this online platform, we have applied some structure to our investigations, but for the most part imagemaking is loose and unstructured. If we must adopt a rule in this course it is only this: you will not become a graphic designer by watching videos alone. Or, don't just make stuff just in your head. So here, the focus here is on making, and you are expected to devote serious time and intellectual energy to that activity in this course. Specifically, you will:\n\n - experiment with a range of materials and techniques to make images for graphic design\n - expand your visual vocabulary both in terms of making and talking about work, in order to discuss your work and work of others\n - learn how to make, manipulate and arrange images to create compositions, eventually culminating in the design and production of an-image-based book.\n\nThe first half of the course is an opportunity to experiment and explore imagemaking in order to expand your visual vocabulary. You will create pieces that are expressive, meditative, or 'design-y' to instigate, evoke, experiment, record, explain, or try out a media.\n\nIn the second two weeks, we’ll invite the images to deliberately and intentionally carry meaning and communication through relational moves like juxtaposition, composition, and context. We’ll look at developing and expanding the range of approaches for putting things together by composing page spreads with your images. Since nothing exists without context, we look at how to intentionally drive the image’s connotations, meanings, and associations generated through elements of composition and “visual contrasts.” Ultimately, we will take the images that you create and make a book from them.\n\nThe results of your assignments (and experiments) may generate something completely unknowable now or in the future—and that's the goal.\n\nSHOW ALL ABOUT INTRODUCTION TO IMAGEMAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/graphic-design-history?specialization=graphic-design",
       "name":"Ideas from the History of Graphic Design",
       "Rating":"Ideas from the History of Graphic Design\n4.7\nstars\n2,098 ratings\n•\n439 reviews\n\nThis condensed survey course focuses on four key periods or themes from the history of design in the West. Together we’ll trace the emergence of design as a recognized practice, why things look the way they do, and how designers approached specific design problems in their work. \n\nStudents will develop an understanding of where the wide variety of today’s design practice comes from. By participating in this survey of the works of innovative groups and individuals, we outline the process by which graphic design moved from a purely instrumental practice, to becoming a demanding creative and hybridized field.\n\nEach week, a short quiz will test your knowledge of concepts, and a short reflective assignment will give you the opportunity to analyze the questions designers ask themselves today.\n\nThis is an essential course for emerging designers entering the field, or for students interested in learning more about visual culture and analysis. No previous experience is required.\n\nA note about this course: \n\nThis course is taught from the perspective of contemporary design, to connect ideas that helped formulate design practice from the 1850s through the 1960s to the ways that designers think today. The relationship of words and pictures in graphic design is looked at through the ever-changing social and cultural contexts, technologies, aesthetics, and politics of their eras. \n\nThe definition and practice of graphic design includes all public visual communications, which is a global practice. It was the evolution of mass production and communication in the West that specifically redefined graphic design as a professional practice and is this course’s particular narrative. We hope students will consider how to connect the themes and ideas offered in this course to your own culture.\n\nSHOW ALL ABOUT IDEAS FROM THE HISTORY OF GRAPHIC DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/brand-new-brand?specialization=graphic-design",
       "name":"Brand New Brand",
       "Rating":"Brand New Brand\n4.9\nstars\n951 ratings\n•\n250 reviews\n\nThis course is the culmination of the Graphic Design Specialization and gives you an opportunity to tie together your knowledge and skills into a single project: a brand development guide for a company you will invent.\n\nThis course takes you through the entire design process, from ideation to creation to presentation. Through the guide, you will be creating and giving a visual identity to an imaginary start-up company, and applying that visual identity to a number of forms. You will also develop a logotype and accompanying graphic palette to visually represent your company, as well as apply that design to a number of different applications to see it at work.\n\nNote: Only learners who have earned a certificate in the four previous courses in the Specialization are eligible to take the Capstone.\n\nSHOW ALL ABOUT BRAND NEW BRAND\nSHOW ALL"
    },
    "/specializations/organizational-leadership",
    {
       "Url":"/learn/leadership-collaboration?specialization=organizational-leadership",
       "name":"High Performance Collaboration: Leadership, Teamwork, and Negotiation",
       "Rating":"High Performance Collaboration: Leadership, Teamwork, and Negotiation\n4.8\nstars\n2,357 ratings\n•\n744 reviews\n\nAre leaders born or made?  Learn the essential skills to develop and expand your leadership repertoire,  design teams for collaboration, and craft win-win negotiation strategies. High Performance Collaboration: Leadership, Teamwork, and Negotiation focuses on leadership, teamwork, and negotiation. Students will engage in self-assessments to analyze their leadership style, develop team charters to optimize their groups, and develop a game plan for effective negotiation.\n\nRecurring course sessions repeat every 2 weeks on Monday with an enrollment period of 5 days.\n\nSHOW ALL ABOUT HIGH PERFORMANCE COLLABORATION: LEADERSHIP, TEAMWORK, AND NEGOTIATION\nSHOW ALL"
    },
    {
       "Url":"/learn/leadership-storytelling?specialization=organizational-leadership",
       "name":"Leadership Communication for Maximum Impact: Storytelling",
       "Rating":"Leadership Communication for Maximum Impact: Storytelling\n4.5\nstars\n941 ratings\n•\n239 reviews\n\nStorytelling is an essential part of leadership.  Effective leaders communicate to inspire talent to excel; to partner with investors and communities; to engage with customers and clients and to grow their impact in the world as part of a global community.  Cultivating an authentic, trustworthy and compelling narrative is vital to a leader’s success.    This course helps leaders find their own story through personal branding; develop storytelling success with all constituencies; initiate an effective voice for crisis; interact well through social and third party media; and communicate a vision for innovation.\n\nSHOW ALL ABOUT LEADERSHIP COMMUNICATION FOR MAXIMUM IMPACT: STORYTELLING\nSHOW ALL"
    },
    {
       "Url":"/learn/leadership-socialinfluence?specialization=organizational-leadership",
       "name":"Leadership Through Social Influence",
       "Rating":"Leadership Through Social Influence\n4.7\nstars\n1,094 ratings\n•\n269 reviews\n\nThis course will provide learners with a systematic general framework for analyzing persuasive influence situations. Learners will be able to identify different challenges faced by persuaders and to fashion appropriate strategies for addressing those challenges. The broad goal is to provide learners with not only an extensive persuasion tool kit, but also with an understanding of how different tools are useful in different situations. Specifically, the course will address four broad topics: strategies for influencing people’s personal attitudes; strategies for affecting social factors influencing behavior; strategies for affecting people’s perceived ability to undertake the desired behavior; and strategies for inducing people to act on their existing intentions.\n\nSHOW ALL ABOUT LEADERSHIP THROUGH SOCIAL INFLUENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/leadership-marketing?specialization=organizational-leadership",
       "name":"Leadership Through Marketing",
       "Rating":"Leadership Through Marketing\n4.6\nstars\n421 ratings\n•\n93 reviews\n\nThe success of every organization depends on attracting and retaining customers. Although the marketing concepts for doing so are well established, digital technology has empowered customers, while producing massive amounts of data, revolutionizing the processes through which organizations attract and retain customers. In this course, students will learn how to identify new opportunities to create value for empowered consumers, develop strategies that yield an advantage over rivals, and develop the data science skills to lead more effectively, allocate resources, and to confront this very challenging environment with confidence.\n\nSHOW ALL ABOUT LEADERSHIP THROUGH MARKETING\nSHOW ALL"
    },
    {
       "Url":"/learn/leadership-design-innovation?specialization=organizational-leadership",
       "name":"Leadership Through Design Innovation",
       "Rating":"Leadership Through Design Innovation\n4.3\nstars\n279 ratings\n•\n82 reviews\n\nToday’s workplace calls for a new style of leadership to embolden and accelerate innovation. Design offers a novel way to discover market opportunities, experiment to validate concepts and mitigate risk, and deliver value to all stakeholders. This course offers hands-on experience applying human-centered design process to real-world challenges, and requires you to explore the world around you. Learn how to engage with end users, effectively frame problems, identify potential solutions, and build prototypes to test assumptions and learn what works (and doesn’t). Then dive into a range of ways large and small to bring design innovation into your organization.\n\nSHOW ALL ABOUT LEADERSHIP THROUGH DESIGN INNOVATION\nSHOW ALL"
    },
    {
       "Url":"/learn/leadership-capstone?specialization=organizational-leadership",
       "name":"Organizational Leadership Capstone",
       "Rating":"Organizational Leadership Capstone\n4.7\nstars\n76 ratings\n•\n29 reviews\n\nThe capstone project consists of a case study that must be addressed to complete the specialization.\n\nIn the case study, you will be asked to assume the role of the incoming chief executive officer of a fictitious privately held medical device company. From the company’s standpoint, its customers are the clinics that use and dispense its  products, rather than the end-users of the company’s products.  The company is currently facing a range of challenges, including obstacles to access for world-wide users of the company’s product, as well as internal conflict about the company’s priorities and a new disruptive technology.  You will be asked to help the board address key changes in the industry, by developing a strategy to meet these challenges. Specifically, you will submit artifacts responding to a series of challenges related to the case. The artifacts will be peer-assessed on how effectively you applied concepts and skills explored throughout the specialization, assessed your own skills as a leader, evaluated the data to help you make an informed decision, developed a customer-facing design process, and communicated your strategy to relevant stakeholders.\n\nSHOW ALL ABOUT ORGANIZATIONAL LEADERSHIP CAPSTONE\nSHOW ALL"
    },
    "/specializations/computerforensics",
    {
       "Url":"/learn/digital-forensics-concepts?specialization=computerforensics",
       "name":"Digital Forensics Concepts",
       "Rating":"Digital Forensics Concepts\n5.0\nstars\n13 ratings\n•\n5 reviews\n\nIn the Digital Forensics Concepts course, you will learn about legal considerations applicable to computer forensics and how to identify, collect and preserve digital evidence. This course dives into the scientific principles relating to digital forensics and gives you a close look at on-scene triaging, keyword lists, grep, file hashing, report writing and the profession of digital forensic examination.\n\nSHOW ALL ABOUT DIGITAL FORENSICS CONCEPTS\nSHOW ALL"
    },
    {
       "Url":"/learn/windows-os-forensics?specialization=computerforensics",
       "name":"Windows OS Forensics",
       "Rating":"Windows OS Forensics\n\nThe Windows OS Forensics course covers windows file systems, Fat32, ExFat, and NTFS. You will learn how these systems store data, what happens when a file gets written to disc, what happens when a file gets deleted from disc, and how to recover deleted files. You will also learn how to correctly interpret the information in the file system data structures, giving the student a better understanding of how these file systems work. This knowledge will enable you to validate the information from multiple forensic tools properly.\n\nSHOW ALL ABOUT WINDOWS OS FORENSICS\nSHOW ALL"
    },
    {
       "Url":"/learn/windows-registry-forensics?specialization=computerforensics",
       "name":"Windows Registry Forensics",
       "Rating":"Windows Registry Forensics\n\nThe Windows Registry Forensics course shows you how to examine the live registry, the location of the registry files on the forensic image, and how to extract files."
    },
    "/specializations/information-security",
    {
       "Url":"/learn/security-governance-compliance?specialization=information-security",
       "name":"Security Governance & Compliance",
       "Rating":"Security Governance & Compliance\n4.6\nstars\n40 ratings\n•\n15 reviews\n\nStudents are introduced to the field of cyber security with a focus on the domain of security & risk management. Topics include the fundamental concepts and goals of cybersecurity (the CIA triad), security governance design, the NIST cybersecurity framework, relevant laws and regulations, and the roles of policies, strategies, and procedures in cybersecurity governance.\n\nSHOW ALL ABOUT SECURITY GOVERNANCE & COMPLIANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/risk-management-threat-modeling?specialization=information-security",
       "name":"Introduction to Risk Management",
       "Rating":"Introduction to Risk Management\n4.8\nstars\n36 ratings\n•\n8 reviews\n\nIn this course, you will learn about risk assessment techniques and how to implement a number of strategies that will ensure the protection of assets. You will learn about the relationship between assets, vulnerabilities, threats, and risks. You will also engage with a number of current case studies in the industry that illustrate the material. You will leave the course with skills relating to threat modeling and business continuity planning that have direct applications at your current job or in your future career.\n\nSHOW ALL ABOUT INTRODUCTION TO RISK MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/internal-risk-mitigation?specialization=information-security",
       "name":"Personnel & Third-Party Security",
       "Rating":"Personnel & Third-Party Security\n\nIn this course, you will learn all about the process of implementing effective education, training, and awareness programs. You will also study the role personnel security plays in protecting an organization’s assets, intellectual property, and physical assets. You will also be introduced to the steps required for effective Vendor Risk Management (VRM), including: due diligence, contracting, monitoring & accessing, and termination. Throughout the course, you will engage with current case studies that illustrate the key concepts in your lessons. You will also have the chance to submit assignments in which you will apply the material in a practical application.\n\nSHOW ALL ABOUT PERSONNEL & THIRD-PARTY SECURITY\nSHOW ALL"
    },
    "/specializations/information-visualization",
    {
       "Url":"/learn/information-visualization-fundamentals?specialization=information-visualization",
       "name":"Information Visualization: Foundations",
       "Rating":"Information Visualization: Foundations\n4.5\nstars\n173 ratings\n•\n49 reviews\n\nThe main goal of this specialization is to provide the knowledge and practical skills necessary to develop a strong foundation on information visualization and to design and develop advanced applications for visual data analysis.\n\nThis course aims at introducing fundamental knowledge for information visualization. The main goal is to provide the students with the necessary “vocabulary” to describe visualizations in a way that helps them reason about what designs are appropriate for a given problem. This module also gives a broad overview of the field of visualization, introducing its goals, methods and applications.\n\nA learner with some or no previous knowledge in Information Visualization will get a sense of what visualization is, what it is for and in how many different situations it can be applied; will practice to describe data in a way that is useful for visualization design; will familiarize with fundamental charts to talk about the concept of visual encoding and decoding.\n\nSHOW ALL ABOUT INFORMATION VISUALIZATION: FOUNDATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/information-visualization-applied-perception?specialization=information-visualization",
       "name":"Information Visualization: Applied Perception",
       "Rating":"Information Visualization: Applied Perception\n4.8\nstars\n93 ratings\n•\n28 reviews\n\nThis module aims at introducing fundamental concepts of visual perception applied to information visualization. These concepts help the student ideate and evaluate visualization designs in terms of how well they leverage the capabilities of the human perceptual machinery."
    },
    {
       "Url":"/learn/information-visualization-programming-d3js?specialization=information-visualization",
       "name":"Information Visualization: Programming with D3.js",
       "Rating":"Information Visualization: Programming with D3.js\n4.5\nstars\n160 ratings\n•\n53 reviews\n\nIn this course you will learn how to use D3.js to create powerful visualizations for web. Learning D3.js will enable you to create many different types of visualization and to visualize many different data types. It will give you the freedom to create something as simple as a bar chart as well your own new revolutionary technique. \n\nIn this course we will cover the basics of creating visualizations with D3 as well as how to deal with tabular data, geography and networks. By the end of this course you will be able to:\n\n- Create bar and line charts\n- Create choropleth and symbol maps\n- Create node-link diagrams and tree maps\n- Implement zooming and brushing\n- Link two or more views through interaction\n\nThe course mixes theoretical and practical lectures. We will show you step by step how to use the library to build actual visualizations and what theoretical concepts lie behind them. Throughout the course you will learn skills that will lead you to building a whole application by the end of the lectures (a fully working visualization system to visualize airlines routes).\n\nThis course is the third one of the “Specialization in Information Visualization\". The course expects you to have some basic knowledge of programming as well as some basic visualization skills.\n\nSHOW ALL ABOUT INFORMATION VISUALIZATION: PROGRAMMING WITH D3.JS\nSHOW ALL"
    },
    {
       "Url":"/learn/information-visualization-advanced-techniques?specialization=information-visualization",
       "name":"Information Visualization: Advanced Techniques",
       "Rating":"Information Visualization: Advanced Techniques\n4.7\nstars\n29 ratings\n•\n10 reviews\n\nThis course aims to introduce learners to advanced visualization techniques beyond the basic charts covered in Information Visualization: Fundamentals. These techniques are organized around data types to cover advance methods for: temporal and spatial data, networks and trees and textual data. In this module we also teach learners how to develop innovative techniques in D3.js.\n\nLearning Goals\nGoal: Analyze the design space of visualization solutions for various kinds of data visualization problems. Learn what designs are available for a given problem and what are their respective advantages and disadvantages.\n- Temporal\n- Spatial\n- Spatio-Temporal\n- Networks\n- Trees\n- Text\n\nThis is the fourth course in the Information Visualization Specialization. The course expects you to have some basic knowledge of programming as well as some basic visualization skills (as those introduced in the first course of the specialization).\n\nSHOW ALL ABOUT INFORMATION VISUALIZATION: ADVANCED TECHNIQUES\nSHOW ALL"
    },
    "/specializations/blockchain",
    {
       "Url":"/learn/blockchain-basics?specialization=blockchain",
       "name":"Blockchain Basics",
       "Rating":"Blockchain Basics\n4.6\nstars\n5,594 ratings\n•\n1,420 reviews\n\nThis first course of the Blockchain specialization provides a broad overview of the essential concepts of blockchain technology – by initially exploring the Bitcoin protocol followed by the Ethereum protocol – to lay the foundation necessary for developing applications and programming. You will be equipped with the knowledge needed to create nodes on your personal Ethereum blockchain, create accounts, unlock accounts, mine, transact, transfer Ethers, and check balances.       \n\nYou will learn about the decentralized peer-to-peer network, an immutable distributed ledger and the trust model that defines a blockchain. This course enables you to explain basic components of a blockchain (transaction, block, block header, and the chain) its operations (verification, validation, and consensus model) underlying algorithms, and essentials of trust (hard fork and soft fork). Content includes the hashing and cryptography foundations indispensable to blockchain programming, which is the focus of two subsequent specialization courses, Smart Contracts and Decentralized Applications (Dapps). You will work on a virtual machine image, specifically created for this course, to build an Ethereum test chain and operate on the chain. This hands-on activity will help you understand the workings of a blockchain, its transactions, blocks and mining.\n\nMain concepts are delivered through videos, demos and hands-on exercises.\n\nSHOW ALL ABOUT BLOCKCHAIN BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/smarter-contracts?specialization=blockchain",
       "name":"Smart Contracts",
       "Rating":"Smart Contracts\n4.6\nstars\n1,777 ratings\n•\n337 reviews\n\nThis second course of the Blockchain specialization will help you design, code, deploy and execute a smart contract – the computational element of the blockchain technology. Smart contracts allow for implementing user-defined operations of arbitrary complexity that are not possible through plain cryptocurrency protocols. They allow users to implement conditions, rules and policies of the domain applications. Smart contracts are a powerful feature that, when properly designed and coded, can result in autonomous, efficient and transparent systems. \n\nYou will design and program smart contracts in Solidity language, test and deploy them in the Remix development environment, and invoke them from a simple web interface that Remix provides. This course features best practices for designing solutions with smart contracts using Solidity and Remix IDE.\n\nMain concepts are delivered through videos, demos and hands-on exercises.\n\nSHOW ALL ABOUT SMART CONTRACTS\nSHOW ALL"
    },
    {
       "Url":"/learn/decentralized-apps-on-blockchain?specialization=blockchain",
       "name":"Decentralized Applications (Dapps)",
       "Rating":"Decentralized Applications (Dapps)\n4.5\nstars\n938 ratings\n•\n158 reviews\n\nThis third course of the Blockchain specialization prepares you to design and develop end-to-end decentralized applications (Dapps) – which provide anyone with access to the blockchain’s features and services. You will use Truffle IDE, smart contracts, a simple web client and a MetaMask client. You will learn about the architecture of a Dapp: the front-end client interface, backed by the blockchain and smart contracts. The course covers the basic design of a Dapp, Truffle development process and commands (init, develop, test and migrate), test-driven development of Dapp, Dapp application models and emerging standards that are essential for predictable Dapp behavior. \n\nMain concepts are delivered through videos, demos and hands-on exercises.\n\nSHOW ALL ABOUT DECENTRALIZED APPLICATIONS (DAPPS)\nSHOW ALL"
    },
    {
       "Url":"/learn/blockchain-platforms?specialization=blockchain",
       "name":"Blockchain Platforms",
       "Rating":"Blockchain Platforms\n4.6\nstars\n853 ratings\n•\n147 reviews\n\nThis fourth course of the Blockchain specialization provides learners with an understanding of the broader blockchain ecosystem. Learners are introduced to other blockchain platforms, details of two decentralized application use cases, and challenges such as privacy and scalability. They are prepared to discuss permissioned blockchain architectures of Hyperledger and Microsoft Azure's blockchain as a service model and analyze the Augur and Grid+ decentralized application platforms. Course material includes emerging alternative decentralization models such as IPFS and Hashgraph, challenges in broader blockchain adoption, and continuous improvement solutions.\n\nSHOW ALL ABOUT BLOCKCHAIN PLATFORMS\nSHOW ALL"
    }
 ]