[
    "/specializations/virtual-teacher",
    {
       "Url":"/learn/virtual-school?specialization=virtual-teacher",
       "name":"Foundations of Virtual Instruction",
       "Rating":"Foundations of Virtual Instruction\n4.4\nstars\n1,120 ratings\n•\n344 reviews\n\nWelcome to Foundations of Virtual Instruction! This course will help you 'up' your game and develop the advanced skills and techniques that elude even some of the most experienced virtual teachers in the K-12 space. Examine pitfalls and learn how to overcome them by focusing on the fundamentals that have the most significant impact on student learning in a blended or online environment. When you complete this course, you will be able to: \n\n• Craft virtual learning experiences that align with your student's needs. \n• Set up a learning environment to get to know your students, and they get to know each other.\n• Use a variety of online tools to provide feedback and personalize the learning experience.\n• Identify at-risk students and employ effective strategies for teaching them.\n• Compare and contrast online and face-to-face learning communities.\n• Apply strategies to make virtual courses more human.\n\nSHOW ALL ABOUT FOUNDATIONS OF VIRTUAL INSTRUCTION \nSHOW ALL"
    },
    {
       "Url":"/learn/k-12-education?specialization=virtual-teacher",
       "name":"Emerging Trends & Technologies in the Virtual K-12 Classroom",
       "Rating":"Emerging Trends & Technologies in the Virtual K-12 Classroom\n4.6\nstars\n523 ratings\n•\n149 reviews\n\nWelcome to Emerging Trends and Technologies in K-12! This course will help you evaluate and implement technology in the most useful way within your virtual classroom setting. We will discuss the possibilities and challenges of using technology in fully online environments, although many of the ideas can be applied to blended and traditional environments as well. \n\nThis course is focused on emerging trends and technologies, specifically for K-12 instructors. Most of the content will be aimed at high school-aged students in the U.S., or ages 13-18 in other countries. Due to the nature of some of the internet-based technologies, young students are required to be 13 or older to participate. That said, many of the examples we discuss can apply to younger ages. \n\nThis course is focused on virtual education. In other words, blended or fully online teaching and learning experiences. Nevertheless, you can apply the concepts to a traditional class, adult education, and higher education. Lastly, please note that many of the examples will be U.S. based.  \n\nUpon completing this course, you will be able to:\n\n • Define educational technology's role in supporting the virtual environment.\n • Identify and evaluate existing and emerging technologies for virtual course instruction or curriculum development.\n • Use collaborative learning tools to design and assess learning activities.\n • Use game-based strategies to deepen student engagement in virtual courses.\n • Research, evaluate, and employ open content in virtual education.\n • Debate the role of MOOCs in virtual K-12 education.\n\nSHOW ALL ABOUT EMERGING TRENDS & TECHNOLOGIES IN THE VIRTUAL K-12 CLASSROOM\nSHOW ALL"
    },
    {
       "Url":"/learn/teaching-strategies?specialization=virtual-teacher",
       "name":"Advanced Instructional Strategies in the Virtual Classroom",
       "Rating":"Advanced Instructional Strategies in the Virtual Classroom\n4.6\nstars\n449 ratings\n•\n137 reviews\n\nWelcome to Advanced Instructional Strategies in the Virtual Classroom! This course will help you apply strategies to the critical areas of K-12 virtual instruction to significantly impact virtual education. We will examine the pitfalls beginning teachers run into and learn how to overcome them by focusing on the fundamentals that have the greatest impact on student learning in a blended or online environment. By the end of the course, you will be able to empower your students to be voracious learners who are ready to go out and make the world a better place to live.\n\nUpon completing this course, you will be able to:\n• Identify the role of direct instruction within a virtual course.\n• Establish direct communication and meaningful relationships with your students. \n• Use instructional strategies that motivate and challenge your students to think more critically.\n• Define at-risk students and examine effective strategies for teaching this demographic.\n• Build an inclusive and thriving online community with students, parents, and other teaching professionals.\n\nSHOW ALL ABOUT ADVANCED INSTRUCTIONAL STRATEGIES IN THE VIRTUAL CLASSROOM\nSHOW ALL"
    },
    {
       "Url":"/learn/performance-assessment?specialization=virtual-teacher",
       "name":"Performance Assessment in the Virtual Classroom",
       "Rating":"Performance Assessment in the Virtual Classroom\n4.6\nstars\n368 ratings\n•\n89 reviews\n\nWelcome to Performance Assessment in the Virtual Classroom! This course will help you effectively assess student performance virtually, including compliance issues, feedback models, online grade book functions, and data analysis. We will discuss why effective measures of performance and assessment are a crucial component of any virtual program, and the importance of teachers and administrators understanding both the myths and challenges of assessing performance virtually, administering standardized testing with geographical challenges, and complying with state and local requirements to make sure students are meeting requirements.  \n\nThrough the successful completion of this course, you will be able to:\n• Examine the importance of authentic performance and assessment in the virtual classroom.\n• Discuss academic integrity and remote assessments in the virtual classroom. \n• Apply best practices for data analysis and grade book management.\n• Consider performance and assessment for special populations: gifted, at-risk, and special needs students.\n• Discuss the importance of instructional feedback and monitoring progress and performance using technology.\n\nSHOW ALL ABOUT PERFORMANCE ASSESSMENT IN THE VIRTUAL CLASSROOM\nSHOW ALL"
    },
    {
       "Url":"/learn/virtual-teacher-capstone?specialization=virtual-teacher",
       "name":"Virtual Teacher Final Project",
       "Rating":"Virtual Teacher Final Project\n4.8\nstars\n176 ratings\n•\n54 reviews\n\nThe Final Project will be a hands-on, comprehensive project that practitioners of virtual education can implement in their profession. For this final project, learners will draft a design plan for an online learning module utilizing materials learned from the virtual teacher series. Learners will choose the subject matter, method of delivery, tools, instructional strategies, and assessments, with the goal of creating a module of online or blended instruction that meets the needs of their students. Learners do not have to create, develop or teach the online learning module they design.\n\nUpon completing this course, you will be able to:\n1.       Design a fully online or blended instructional module\n2.       Apply theories and/or strategies of effective online instruction\n\nSHOW ALL ABOUT VIRTUAL TEACHER FINAL PROJECT\nSHOW ALL"
    },
    "/specializations/key-technologies-for-business",
    {
       "Url":"/learn/introduction-to-cloud?specialization=key-technologies-for-business",
       "name":"Introduction to Cloud Computing",
       "Rating":"Introduction to Cloud Computing\n4.8\nstars\n1,133 ratings\n•\n269 reviews\n\nThis course introduces you to the core concepts of cloud computing. You gain the foundational knowledge required for understanding cloud computing from a business perspective as also for becoming a cloud practitioner. You understand the definition and essential characteristics of cloud computing, its history, the business case for cloud computing, and emerging technology usecases enabled by cloud. We introduce you to some of the prominent service providers of our times (e.g. AWS, Google, IBM, Microsoft, etc.) the services they offer, and look at some case studies of cloud computing across industry verticals. \n\nYou learn about the various cloud service models (IaaS, PaaS, SaaS) and deployment models (Public, Private, Hybrid) and the key components of a cloud infrastructure (VMs, Networking, Storage - File, Block, Object, CDN). We also cover emergent cloud trends and practices including - Hybrid Multicloud, Microservices, Serverless, DevOps, Cloud Native and Application Modernization. And we go over the basics of cloud security, monitoring, and different job roles in the cloud industry. \n\nEven though this course does not require any prior cloud computing or programming experience, by the end of the course, you will have created your own account on IBM Cloud and gained some hands-on experience by provisioning a cloud service and working with it.\n\nThis course is suitable for a large variety of audiences - whether you are an executive / manager / student who wants to become familiar with cloud computing terminology and concepts, or someone who wants foundational  grounding in cloud computing to start a career in this field or become a cloud practitioner - such as a cloud engineer, developer, analyst, etc.\n\nThe completion of this course also makes you eligible to earn the Cloud Computing Core IBM digital badge.  More information about the badge can be found here: https://www.youracclaim.com/org/ibm/badge/introduction-to-cloud-computing\n\nSHOW ALL ABOUT INTRODUCTION TO CLOUD COMPUTING\nSHOW ALL"
    },
    {
       "Url":"/learn/introduction-to-ai?specialization=key-technologies-for-business",
       "name":"Introduction to Artificial Intelligence (AI)",
       "Rating":"Introduction to Artificial Intelligence (AI)\n4.7\nstars\n7,964 ratings\n•\n1,759 reviews\n\nIn this course you will learn what Artificial Intelligence (AI) is, explore use cases and applications of AI, understand AI concepts and terms like machine learning, deep learning and neural networks. You will be exposed to various issues and concerns surrounding AI such as ethics and bias, & jobs, and get advice from experts about learning and starting a career in AI.  You will also demonstrate AI in action with a mini project.\n\nThis course does not require any programming or computer science expertise and is designed to introduce the basics of AI to anyone whether you have a technical background or not.\n\nSHOW ALL ABOUT INTRODUCTION TO ARTIFICIAL INTELLIGENCE (AI)\nSHOW ALL"
    },
    {
       "Url":"/learn/what-is-datascience?specialization=key-technologies-for-business",
       "name":"What is Data Science?",
       "Rating":"What is Data Science?\n4.7\nstars\n48,273 ratings\n•\n9,106 reviews\n\nThe art of uncovering the insights and trends in data has been around since ancient times. The ancient Egyptians used census data to increase efficiency in tax collection and they accurately predicted the flooding of the Nile river every year. Since then, people working in data science have carved out a unique and distinct field for the work they do. This field is data science. In this course, we will meet some data science practitioners and we will get an overview of what data science is today.\n\nSHOW ALL ABOUT WHAT IS DATA SCIENCE? \nSHOW ALL"
    },
    "/specializations/data-engineering-foundations",
    {
       "Url":"/learn/introduction-to-data-engineering?specialization=data-engineering-foundations",
       "name":"Introduction to Data Engineering",
       "Rating":"Introduction to Data Engineering\n4.7\nstars\n211 ratings\n•\n55 reviews\n\nThis course introduces you to the core concepts, processes, and tools you need to know in order to get a foundational knowledge of data engineering. You will gain an understanding of the modern data ecosystem and the role Data Engineers, Data Scientists, and Data Analysts play in this ecosystem. \n\nThe Data Engineering Ecosystem includes several different components. It includes disparate data types, formats, and sources of data. Data Pipelines gather data from multiple sources, transform it into analytics-ready data, and make it available to data consumers for analytics and decision-making. Data repositories, such as relational and non-relational databases, data warehouses, data marts, data lakes, and big data stores process and store this data. Data Integration Platforms combine disparate data into a unified view for the data consumers. You will learn about each of these components in this course. You will also learn about Big Data and the use of some of the Big Data processing tools. \n\nA typical Data Engineering lifecycle includes architecting data platforms, designing data stores, and gathering, importing, wrangling, querying, and analyzing data. It also includes performance monitoring and finetuning to ensure systems are performing at optimal levels. In this course, you will learn about the data engineering lifecycle. You will also learn about security, governance, and compliance. \n\nData Engineering is recognized as one of the fastest-growing fields today. The career opportunities available in the field and the different paths you can take to enter this field are discussed in the course. \n\nThe course also includes hands-on labs that guide you to create your IBM Cloud Lite account, provision a database instance, load data into the database instance, and perform some basic querying operations that help you understand your dataset.\n\nSHOW ALL ABOUT INTRODUCTION TO DATA ENGINEERING\nSHOW ALL"
    },
    {
       "Url":"/learn/python-for-applied-data-science-ai?specialization=data-engineering-foundations",
       "name":"Python for Data Science, AI & Development",
       "Rating":"Python for Data Science, AI & Development\n4.6\nstars\n22,873 ratings\n•\n3,757 reviews\n\nKickstart your learning of Python for data science, as well as programming in general, with this beginner-friendly introduction to Python. Python is one of the world’s most popular programming languages, and there has never been greater demand for professionals with the ability to apply Python fundamentals to drive business solutions across industries. \n\nThis course will take you from zero to programming in Python in a matter of hours—no prior programming experience necessary! You will learn Python fundamentals, including data structures and data analysis, complete hands-on exercises throughout the course modules, and create a final project to demonstrate your new skills. \n\nBy the end of this course, you’ll feel comfortable creating basic programs, working with data, and solving real-world problems in Python. You’ll gain a strong foundation for more advanced learning in the field, and develop skills to help advance your career. \n\nThis course can be applied to multiple Specialization or Professional Certificate programs. Completing this course will count towards your learning in any of the following programs: \n\nIBM Applied AI Professional Certificate \n\nApplied Data Science Specialization \n\nIBM Data Science Professional Certificate \n\nUpon completion of any of the above programs, in addition to earning a Specialization completion certificate from Coursera, you’ll also receive a digital badge from IBM recognizing your expertise in the field.\n\nSHOW ALL ABOUT PYTHON FOR DATA SCIENCE, AI & DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/python-project-for-data-engineering?specialization=data-engineering-foundations",
       "name":"Python Project for Data Engineering",
       "Rating":"Python Project for Data Engineering\n4.6\nstars\n70 ratings\n•\n13 reviews\n\nThis mini-course is intended to apply foundational Python skills by implementing different techniques to collect and work with data. Assume the role of a Data Engineer and extract data from multiple file formats, transform it into specific datatypes, and then load it into a single source for analysis. Continue with the course and test your knowledge by implementing webscraping and extracting data with APIs all with the help of multiple hands-on labs. After completing this course you will have acquired the confidence to begin collecting large datasets from multiple sources and transform them into one primary source, or begin web scraping to gain valuable business insights all with the use of Python. \n\nPRE-REQUISITE: **Python for Data Science, AI and Development** course from IBM is a pre-requisite for this project course. Please ensure that before taking this course you have either completed the Python for Data Science, AI and Development course from IBM or have equivalent proficiency in working with Python and data.\n\nNOTE: This course is not intended to teach you Python and does not have too much instructional content. It is intended for you to apply prior Python knowledge.\n\nSHOW ALL ABOUT PYTHON PROJECT FOR DATA ENGINEERING\nSHOW ALL"
    },
    {
       "Url":"/learn/introduction-to-relational-databases?specialization=data-engineering-foundations",
       "name":"Introduction to Relational Databases (RDBMS)",
       "Rating":"Introduction to Relational Databases (RDBMS)\n4.5\nstars\n31 ratings\n•\n4 reviews\n\nAre you ready to dive into the world of data engineering? You’ll need a solid understanding of how data is stored, processed, and accessed. You’ll need to identify the different types of database that are appropriate for the kind of data you are working with and what processing the data requires.\n\nIn this course, you will learn the essential concepts behind relational databases and Relational Database Management Systems (RDBMS). You’ll study relational data models and discover how they are created and what benefits they bring, and how you can apply them to your own data. You’ll be introduced to several industry standard relational databases, including IBM DB2, MySQL, and PostgreSQL.\n\nThis course incorporates hands-on, practical exercises to help you demonstrate your learning. You will work with real databases and explore real-world datasets. You will create database instances and populate them with tables. \n\nNo prior knowledge of databases or programming is required.\n\nAnyone can audit this course at no-charge. If you choose to take this course and earn the Coursera course certificate, you can also earn an IBM digital badge upon successful completion of the course.\n\nSHOW ALL ABOUT INTRODUCTION TO RELATIONAL DATABASES (RDBMS)\nSHOW ALL"
    },
    {
       "Url":"/learn/sql-data-science?specialization=data-engineering-foundations",
       "name":"Databases and SQL for Data Science with Python",
       "Rating":"Databases and SQL for Data Science with Python\n4.7\nstars\n13,764 ratings\n•\n1,659 reviews\n\nMuch of the world's data resides in databases. SQL (or Structured Query Language) is a powerful language which is used for communicating with and extracting data from databases. A working knowledge of databases and SQL is a must if you want to become a data scientist.\n\nThe purpose of this course is to introduce relational database concepts and help you learn and apply foundational knowledge of the SQL language. It is also intended to get you started with performing SQL access in a data science environment.  \n\nThe emphasis in this course is on hands-on and practical learning . As such, you will work with real databases, real data science tools, and real-world datasets. You will create a database instance in the cloud. Through a series of hands-on labs you will practice building and running SQL queries. You will also learn how to access databases from Jupyter notebooks using SQL and Python.\n\nNo prior knowledge of databases, SQL, Python, or programming is required.\n\nAnyone can audit this course at no-charge. If you choose to take this course and earn the Coursera course certificate, you can also earn an IBM digital badge upon successful completion of the course.\n\nLIMITED TIME OFFER: Subscription is only $39 USD per month for access to graded materials and a certificate.\n\nSHOW ALL ABOUT DATABASES AND SQL FOR DATA SCIENCE WITH PYTHON\nSHOW ALL"
    },
    "/specializations/ibm-ai-foundations-for-business",
    {
       "Url":"/learn/introduction-to-ai?specialization=ibm-ai-foundations-for-business",
       "name":"Introduction to Artificial Intelligence (AI)",
       "Rating":"Introduction to Artificial Intelligence (AI)\n4.7\nstars\n7,964 ratings\n•\n1,759 reviews\n\nIn this course you will learn what Artificial Intelligence (AI) is, explore use cases and applications of AI, understand AI concepts and terms like machine learning, deep learning and neural networks. You will be exposed to various issues and concerns surrounding AI such as ethics and bias, & jobs, and get advice from experts about learning and starting a career in AI.  You will also demonstrate AI in action with a mini project.\n\nThis course does not require any programming or computer science expertise and is designed to introduce the basics of AI to anyone whether you have a technical background or not.\n\nSHOW ALL ABOUT INTRODUCTION TO ARTIFICIAL INTELLIGENCE (AI)\nSHOW ALL"
    },
    {
       "Url":"/learn/what-is-datascience?specialization=ibm-ai-foundations-for-business",
       "name":"What is Data Science?",
       "Rating":"What is Data Science?\n4.7\nstars\n48,273 ratings\n•\n9,106 reviews\n\nThe art of uncovering the insights and trends in data has been around since ancient times. The ancient Egyptians used census data to increase efficiency in tax collection and they accurately predicted the flooding of the Nile river every year. Since then, people working in data science have carved out a unique and distinct field for the work they do. This field is data science. In this course, we will meet some data science practitioners and we will get an overview of what data science is today.\n\nSHOW ALL ABOUT WHAT IS DATA SCIENCE? \nSHOW ALL"
    },
    {
       "Url":"/learn/ibm-ai-ladder-framework?specialization=ibm-ai-foundations-for-business",
       "name":"The AI Ladder: A Framework for Deploying AI in your Enterprise",
       "Rating":"The AI Ladder: A Framework for Deploying AI in your Enterprise\n4.7\nstars\n214 ratings\n•\n39 reviews\n\nThis course is intended for business and technical professionals involved in strategic decision-making focused on bringing AI into their enterprises. Through the use of a conceptual model called “The AI Ladder”, participants in this course will learn the requirements, terms and concepts associated with successfully developing and deploying AI solutions in their enterprises.  After completing this course you will be able to explain and describe each of the steps required to ensure success when you build and deploy AI solutions in your business enterprise.\n\nSHOW ALL ABOUT THE AI LADDER: A FRAMEWORK FOR DEPLOYING AI IN YOUR ENTERPRISE\nSHOW ALL"
    },
    "/specializations/it-fundamentals-cybersecurity",
    {
       "Url":"/learn/introduction-cybersecurity-cyber-attacks?specialization=it-fundamentals-cybersecurity",
       "name":"Introduction to Cybersecurity Tools & Cyber Attacks",
       "Rating":"Introduction to Cybersecurity Tools & Cyber Attacks\n4.5\nstars\n7,370 ratings\n•\n2,042 reviews\n\nThis course gives you the background needed to understand basic Cybersecurity.  You will learn the history of Cybersecurity, types and motives of cyber attacks to further your knowledge of current threats to organizations and individuals.  Key terminology, basic system concepts and tools will be examined as an introduction to the Cybersecurity field.\n\nYou will learn about critical thinking and its importance to anyone looking to pursue a career in Cybersecurity.\n\nFinally, you will begin to learn about organizations and resources to further research cybersecurity issues in the Modern era.\n\nThis course is intended for anyone who wants to gain a basic understanding of Cybersecurity or as the first course in a series of courses to acquire the skills to work in the Cybersecurity field as a Jr Cybersecurity Analyst.\n\nThe completion of this course also makes you eligible to earn the Introduction to Cybersecurity Tools & Cyber Attacks IBM digital badge.  More information about the badge can be found https://www.youracclaim.com/org/ibm/badge/introduction-to-cybersecurity-tools-cyber-attacks\n\nSHOW ALL ABOUT INTRODUCTION TO CYBERSECURITY TOOLS & CYBER ATTACKS\nSHOW ALL"
    },
    {
       "Url":"/learn/cybersecurity-roles-processes-operating-system-security?specialization=it-fundamentals-cybersecurity",
       "name":"Cybersecurity Roles, Processes & Operating System Security",
       "Rating":"Cybersecurity Roles, Processes & Operating System Security\n4.6\nstars\n2,871 ratings\n•\n580 reviews\n\nThis course gives you the background needed to understand basic Cybersecurity  around people. process and technology.  You will learn:\n\n●\t Understand the key cybersecurity roles within an Organization. \n●\t List key cybersecurity processes and an example of each process.\n●\t Describe the architecture, file systems, and basic commands for multiple operating systems including Windows, Mac/OS, Linux and Mobile.\n●\t Understand the concept of Virtualization as it relates to cybersecurity \n\nFinally, you will begin to learn about organizations and resources to further research cybersecurity issues in the Modern era.\n\nThis course is intended for anyone who wants to gain a basic understanding of Cybersecurity or as the second course in a series of courses to acquire the skills to work in the Cybersecurity field as a Jr Cybersecurity Analyst.\n\nThe completion of this course also makes you eligible to earn the Cybersecurity Roles, Processes & Operating System Security IBM digital badge.  More information about the badge can be found here:   https://www.youracclaim.com/org/ibm/badge/cybersecurity-roles-processes-operating-system-security\n\nSHOW ALL ABOUT CYBERSECURITY ROLES, PROCESSES & OPERATING SYSTEM SECURITY\nSHOW ALL"
    },
    {
       "Url":"/learn/cybersecurity-compliance-framework-system-administration?specialization=it-fundamentals-cybersecurity",
       "name":"Cybersecurity Compliance Framework & System Administration",
       "Rating":"Cybersecurity Compliance Framework & System Administration\n4.6\nstars\n1,683 ratings\n•\n317 reviews\n\nThis course gives you the background needed to understand the key cybersecurity compliance and industry standards.  This knowledge will be important for you to learn no matter what cybersecurity role you would like to acquire or have within an organization.\n\nYou will learn the basic commands for user and server administration as it relates to security. You will need this skill to be able to understand vulnerabilities within your organizations operating systems.\n\nYou will learn the concepts of endpoint security and patch management.  Both of these topics are important to keep systems current to avoid cybersecurity incidents against an organization.\n\nFinally you will learn in depth skills around cryptography and encryption to understand how these concepts affect software within a company.  \n\nThis course is intended for anyone who wants to gain a basic understanding of Security Frameworks, Compliance, endpoint management, encryption or cryptography or as the third course in a series of courses to gain the skill as a Jr Cybersecurity analyst.\n\nSHOW ALL ABOUT CYBERSECURITY COMPLIANCE FRAMEWORK & SYSTEM ADMINISTRATION\nSHOW ALL"
    },
    {
       "Url":"/learn/network-security-database-vulnerabilities?specialization=it-fundamentals-cybersecurity",
       "name":"Network Security & Database Vulnerabilities",
       "Rating":"Network Security & Database Vulnerabilities\n4.6\nstars\n1,750 ratings\n•\n369 reviews\n\nThis course gives you the background needed to understand basic network security.  You will learn the about Local Area Networks, TCP/IP, the OSI Framework and routing basics.  You will learn how networking affects security systems within an organization.  You will learn the network components that guard an organization from cybersecurity attacks.\n\nIn addition to networking, you will learn about database vulnerabilities and the tools/knowledge needed to research a database vulnerability for a variety of databases including SQL Injection, Oracle, Mongo and Couch.  \n\nYou will learn about various security breach types associated with databases and organizations that define standards and provide tools for cybersecurity professionals.\n\nThis course is intended for anyone who wants to gain a basic understanding of Network Security/Database Vulnerabilities or as the fourth course in a series of courses to acquire the skills to work in the Cybersecurity field as a Jr Cybersecurity Analyst.\n\nSHOW ALL ABOUT NETWORK SECURITY & DATABASE VULNERABILITIES \nSHOW ALL"
    },
    "/specializations/wharton-business-foundations",
    {
       "Url":"/learn/wharton-marketing?specialization=wharton-business-foundations",
       "name":"Introduction to Marketing",
       "Rating":"Introduction to Marketing\n4.8\nstars\n10,929 ratings\n•\n2,145 reviews\n\nTaught by three of Wharton's top faculty in the marketing department, consistently ranked as the #1 marketing department in the world, this course covers three core topics in customer loyalty: branding, customer centricity, and practical, go-to-market strategies.\n\nYou’ll learn key principles in\n\n- Branding: brand equity is one of the key elements of keeping customers in a dynamic world in which new startups are emerging constantly. \n- Customer centricity: not synonymous with customer service, customer centricity starts with customer focus and need-gathering. \n- Go-to-market strategies: understand the drivers that influence customers and see how these are implemented prior to making an investment. \n\nComplete this course as part of Wharton's Business Foundations Specialization, and you'll have the opportunity to take the Capstone Project and prepare a strategic analysis and proposed solution to a real business challenge from Wharton-governed companies like Shazam and SnapDeal or to a challenge faced by your own company or organization. Wharton-trained staff will evaluate the top submissions, and leadership teams at Shazam and SnapDeal will review the highest scoring projects prepared for their companies.\n\nSHOW ALL ABOUT INTRODUCTION TO MARKETING\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-accounting?specialization=wharton-business-foundations",
       "name":"Introduction to Financial Accounting",
       "Rating":"Introduction to Financial Accounting\n4.7\nstars\n7,058 ratings\n•\n1,676 reviews\n\nMaster the technical skills needed to analyze financial statements and disclosures for use in financial analysis, and learn how accounting standards and managerial incentives affect the financial reporting process. By the end of this course, you’ll be able to read the three most common financial statements: the income statement, balance sheet, and statement of cash flows. Then you can apply these skills to a real-world business challenge as part of the Wharton Business Foundations Specialization.\n\nSHOW ALL ABOUT INTRODUCTION TO FINANCIAL ACCOUNTING\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-social-human-capital?specialization=wharton-business-foundations",
       "name":"Managing Social and Human Capital",
       "Rating":"Managing Social and Human Capital\n4.5\nstars\n2,218 ratings\n•\n387 reviews\n\nPeople are the most valuable asset of any business, but they are also the most unpredictable, and the most difficult asset to manage. And although managing people well is critical to the health of any organization, most managers don't get the training they need to make good management decisions. Now, award-winning authors and renowned management Professors Mike Useem and Peter Cappelli of the Wharton School have designed this course to introduce you to the key elements of managing people. Based on their popular course at Wharton, this course will teach you how to motivate individual performance and design reward systems, how to design jobs and organize work for high performance, how to make good and timely management decisions, and how to design and change your organization’s architecture. By the end of this course, you'll have developed the skills you need to start motivating, organizing, and rewarding people in your organization so that you can thrive as a business and as a social organization.\n\nSHOW ALL ABOUT MANAGING SOCIAL AND HUMAN CAPITAL\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-finance?specialization=wharton-business-foundations",
       "name":"Introduction to Corporate Finance",
       "Rating":"Introduction to Corporate Finance\n4.6\nstars\n5,025 ratings\n•\n1,006 reviews\n\nThis course provides a brief introduction to the fundamentals of finance, emphasizing their application to a wide variety of real-world situations spanning personal finance, corporate decision-making, and financial intermediation. Key concepts and applications include: time value of money, risk-return tradeoff, cost of capital, interest rates, retirement savings, mortgage financing, auto leasing, capital budgeting, asset valuation, discounted cash flow (DCF) analysis, net present value, internal rate of return, hurdle rate, payback period.\n\nSHOW ALL ABOUT INTRODUCTION TO CORPORATE FINANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-operations?specialization=wharton-business-foundations",
       "name":"Introduction to Operations Management",
       "Rating":"Introduction to Operations Management\n4.4\nstars\n2,334 ratings\n•\n524 reviews\n\nLearn to analyze and improve business processes in services or in manufacturing by learning how to increase productivity and deliver higher quality standards. Key concepts include process analysis, bottlenecks, flows rates, and inventory levels, and more. After successfully completing this course, you can apply these skills to a real-world business challenge as part of the Wharton Business Foundations Specialization.\n\nSHOW ALL ABOUT INTRODUCTION TO OPERATIONS MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-capstone?specialization=wharton-business-foundations",
       "name":"Wharton Business Foundations Capstone",
       "Rating":"Wharton Business Foundations Capstone\n4.6\nstars\n303 ratings\n•\n62 reviews\n\nWharton's Applied Knowledge Capstone Project enables you to apply your analytic skills to real business challenges – including your own. You’ll use your newly earned business skills to thoughtfully evaluate a real situation or opportunity from Wharton-governed companies like Shazam and SnapDeal."
    },
    "/specializations/finance-accounting",
    {
       "Url":"/learn/finance-fundamentals?specialization=finance-accounting",
       "name":"Fundamentals of Finance",
       "Rating":"Fundamentals of Finance\n3.9\nstars\n381 ratings\n•\n105 reviews\n\nIn this course, you’ll learn the basic fundamentals of corporate finance. Based on the pre-term qualifying courses for Wharton MBA students, Professor Jessica Wachter has designed this course for learners who need a refresher in financial concepts, or for those who are learning about corporate finance for the first time. You’ll identify foundational concepts in corporate finance, such as NPV, Compound and Simple Interest, and Annuities versus Perpetuities. You’ll also learn how to apply the NPV framework to calculating fixed-income valuation and Equity, using hypothetical examples of corporate projects. By the end of this course, you’ll have honed your skills in calculating risk and returns to optimize investments, and be able to assess the right set of financial information to achieve better returns for your firm.\n\nSHOW ALL ABOUT FUNDAMENTALS OF FINANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-finance?specialization=finance-accounting",
       "name":"Introduction to Corporate Finance",
       "Rating":"Introduction to Corporate Finance\n4.6\nstars\n5,025 ratings\n•\n1,006 reviews\n\nThis course provides a brief introduction to the fundamentals of finance, emphasizing their application to a wide variety of real-world situations spanning personal finance, corporate decision-making, and financial intermediation. Key concepts and applications include: time value of money, risk-return tradeoff, cost of capital, interest rates, retirement savings, mortgage financing, auto leasing, capital budgeting, asset valuation, discounted cash flow (DCF) analysis, net present value, internal rate of return, hurdle rate, payback period.\n\nSHOW ALL ABOUT INTRODUCTION TO CORPORATE FINANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-accounting?specialization=finance-accounting",
       "name":"Introduction to Financial Accounting",
       "Rating":"Introduction to Financial Accounting\n4.7\nstars\n7,058 ratings\n•\n1,676 reviews\n\nMaster the technical skills needed to analyze financial statements and disclosures for use in financial analysis, and learn how accounting standards and managerial incentives affect the financial reporting process. By the end of this course, you’ll be able to read the three most common financial statements: the income statement, balance sheet, and statement of cash flows. Then you can apply these skills to a real-world business challenge as part of the Wharton Business Foundations Specialization.\n\nSHOW ALL ABOUT INTRODUCTION TO FINANCIAL ACCOUNTING\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-financial-accounting?specialization=finance-accounting",
       "name":"More Introduction to Financial Accounting",
       "Rating":"More Introduction to Financial Accounting\n4.8\nstars\n459 ratings\n•\n113 reviews\n\nThe course builds on my Introduction to Financial Accounting course, which you should complete first. In this course, you will learn how to read, understand, and analyze most of the information provided by companies in their financial statements.  These skills will help you make more informed decisions using financial information.\n\nSHOW ALL ABOUT MORE INTRODUCTION TO FINANCIAL ACCOUNTING\nSHOW ALL"
    },
    "/specializations/leading-modern-day-business",
    {
       "Url":"/learn/bcg-uva-darden-digital-transformation?specialization=leading-modern-day-business",
       "name":"Digital Transformation",
       "Rating":"Digital Transformation\n4.8\nstars\n4,957 ratings\n•\n1,384 reviews\n\nDigital transformation is a hot topic--but what exactly is it and what does it mean for companies? In this course, developed at the Darden School of Business at the University of Virginia, and led by top-ranked Darden faculty and Boston Consulting Group global management experts, we talk about digital transformation in two ways. First we discuss the pace of change and the imperative it creates for businesses. Next we provide the context for this transformation and what it takes to win in the digital age. Then we walk through BCG's proprietary framework, which helps you identify key areas to digitize, including strategy, core processes, and technology.\n\nBy the end of this course, you'll be able to:\n--describe the underlying economics of innovation, technology, and market disruptions\n--weigh the pros and cons of current digital technologies driving advancement\n--utilize BCG's digital transformation framework as a \"how-to\" for digitizing your organization\n\nSHOW ALL ABOUT DIGITAL TRANSFORMATION\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-design-thinking-innovation?specialization=leading-modern-day-business",
       "name":"Design Thinking for Innovation",
       "Rating":"Design Thinking for Innovation\n4.7\nstars\n7,349 ratings\n•\n2,271 reviews\n\nToday innovation is everyone's business. Whether you are a manager in a global corporation, an entrepreneur starting up, in a government role, or a teacher in an elementary school, everyone is expected to get lean – to do better with less. And that is why we all need design thinking. At every level in every kind of organization, design thinking provides the tools you need to become an innovative thinker and uncover creative opportunities that are there – you're just not seeing them yet.\n\nIn this course, developed at the Darden School of Business at the University of Virginia and taught by top-ranked faculty, we provide an overview of design thinking and work with a model containing four key questions and several tools to help you understand design thinking as a problem solving approach. We also look at several stories from different organizations that used design thinking to uncover compelling solutions.\n\nSHOW ALL ABOUT DESIGN THINKING FOR INNOVATION\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-digital-product-management?specialization=leading-modern-day-business",
       "name":"Digital Product Management: Modern Fundamentals",
       "Rating":"Digital Product Management: Modern Fundamentals\n4.7\nstars\n3,678 ratings\n•\n1,069 reviews\n\nNot so long ago, the job of product manager was about assessing market data, creating requirements, and managing the hand-off to sales/marketing. Maybe you’d talk to a customer somewhere in there and they’d tell you what features they wanted. But companies that manage product that way are dying.\n\nBeing a product person today is a new game, and product managers are at the center of it. Today, particularly if your product is mostly digital, you might update it several times a day. Massive troves of data are available for making decisions and, at the same time, deep insights into customer motivation and experience are more important than ever. The job of the modern product manager is to charter a direction and create a successful working environment for all the actors involved in product success.  It’s not a simple job or an easy job, but it is a meaningful job where you’ll be learning all the time. \n\nThis course will help you along your learning journey and prepare you with the skills and perspective you need to:\n\nCreate the actionable focus to successfully manage your product (week 1)\nFocus your work using modern product management methods (week 2)\nManage new products and explore new product ideas (week 3)\nManage and amplify existing products (week 4)\n\nThis course is ideal for current product or general  managers interested in today's modern product management methods.\n\nThis course was developed with the generous support of the Batten Institute at UVA’s Darden School of Business. The Batten Institute’s mission is to improve the world through entrepreneurship and innovation: www.batteninstitute.org.\n\nSHOW ALL ABOUT DIGITAL PRODUCT MANAGEMENT: MODERN FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-customer-centric-it-strategy?specialization=leading-modern-day-business",
       "name":"Customer-Centric IT Strategy",
       "Rating":"Customer-Centric IT Strategy\n4.6\nstars\n485 ratings\n•\n122 reviews\n\nNow more than ever, corporations are investing heavily in IT. The quality of these investments affect the daily work of millions, yet it’s not uncommon to see industry surveys where the failure rates for IT projects is over 50%. It’s possible to do better and it’s possible to do so consistently. In this two-week course, we’ll step through major challenges within corporate IT and how to address them with the disciplined use of design thinking, Lean Startup, and agile as a team framework. \n\nBy the end of this course, developed at the Darden School of Business at the University of Virginia and taught by top-ranked faculty, you’ll be able to: \nUse the Business Model Canvas to focus your company strategy and facilitate buy-in from stakeholders\nTranslate your work on the Canvas to specific charters in IT\nRapidly prototype strategically-aligned processes for implementation within your IT infrastructure\n\nPlease Note: This is a short-form course, two weeks in duration.\n\nSHOW ALL ABOUT CUSTOMER-CENTRIC IT STRATEGY\nSHOW ALL"
    },
    "/specializations/uva-darden-digital-product-management",
    {
       "Url":"/learn/uva-darden-digital-product-management?specialization=uva-darden-digital-product-management",
       "name":"Digital Product Management: Modern Fundamentals",
       "Rating":"Digital Product Management: Modern Fundamentals\n4.7\nstars\n3,678 ratings\n•\n1,069 reviews\n\nNot so long ago, the job of product manager was about assessing market data, creating requirements, and managing the hand-off to sales/marketing. Maybe you’d talk to a customer somewhere in there and they’d tell you what features they wanted. But companies that manage product that way are dying.\n\nBeing a product person today is a new game, and product managers are at the center of it. Today, particularly if your product is mostly digital, you might update it several times a day. Massive troves of data are available for making decisions and, at the same time, deep insights into customer motivation and experience are more important than ever. The job of the modern product manager is to charter a direction and create a successful working environment for all the actors involved in product success.  It’s not a simple job or an easy job, but it is a meaningful job where you’ll be learning all the time. \n\nThis course will help you along your learning journey and prepare you with the skills and perspective you need to:\n\nCreate the actionable focus to successfully manage your product (week 1)\nFocus your work using modern product management methods (week 2)\nManage new products and explore new product ideas (week 3)\nManage and amplify existing products (week 4)\n\nThis course is ideal for current product or general  managers interested in today's modern product management methods.\n\nThis course was developed with the generous support of the Batten Institute at UVA’s Darden School of Business. The Batten Institute’s mission is to improve the world through entrepreneurship and innovation: www.batteninstitute.org.\n\nSHOW ALL ABOUT DIGITAL PRODUCT MANAGEMENT: MODERN FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-getting-started-agile?specialization=uva-darden-digital-product-management",
       "name":"Agile Meets Design Thinking",
       "Rating":"Agile Meets Design Thinking\n4.7\nstars\n2,909 ratings\n•\n840 reviews\n\nDespite everyone's good intentions, hard work and solid ideas, too many teams end up creating products that no one wants, no one can use, and no one buys. But it doesn't have to be this way. Agile and design thinking offer a different--and effective--approach to product development, one that results in valuable solutions to meaningful problems. In this course, you’ll learn how to determine what's valuable to a user early in the process--to frontload value--by focusing your team on testable narratives about the user and creating a strong shared perspective. \n\nThis course is supported by the Batten Institute at UVA’s Darden School of Business. The Batten Institute’s mission is to improve the world through entrepreneurship and innovation: www.batteninstitute.org.\n\nSHOW ALL ABOUT AGILE MEETS DESIGN THINKING\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-agile-testing?specialization=uva-darden-digital-product-management",
       "name":"Hypothesis-Driven Development",
       "Rating":"Hypothesis-Driven Development\n4.7\nstars\n794 ratings\n•\n143 reviews\n\nTo deliver agile outcomes, you have to do more than implement agile processes- you have to create focus around what matters to your user and constantly test your ideas. This is easier said than done, but most of today’s high-functioning innovators have a strong culture of experimentation.\n\nIn this course, you’ll learn how to identify the right questions at the right time, and pair them with the right methods to do just enough testing to make sure you minimize waste and maximize the outcomes you create with your user.\n\nThis course is supported by the Batten Institute at UVA’s Darden School of Business. The Batten Institute’s mission is to improve the world through entrepreneurship and innovation: www.batteninstitute.org.\n\nSHOW ALL ABOUT HYPOTHESIS-DRIVEN DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-agile-analytics?specialization=uva-darden-digital-product-management",
       "name":"Agile Analytics",
       "Rating":"Agile Analytics\n4.8\nstars\n302 ratings\n•\n72 reviews\n\nFew capabilities focus agile like a strong analytics program. Such a program determines where a team should focus from one agile iteration (sprint) to the next. Successful analytics are rarely hard to understand and are often startling in their clarity. In this course, developed at the Darden School of Business at the University of Virginia, you'll learn how to build a strong analytics infrastructure for your team, integrating it with the core of your drive to value.\n\nSHOW ALL ABOUT AGILE ANALYTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-agile-team-management?specialization=uva-darden-digital-product-management",
       "name":"Managing an Agile Team",
       "Rating":"Managing an Agile Team\n4.7\nstars\n1,087 ratings\n•\n265 reviews\n\nWhile agile has become the de facto standard for managing digital innovation teams, many wonder if they’re doing it ‘right’. Twitter is full of jokes about how teams say they do agile but don’t ‘really’ do it. The reality is that getting the most out of agile is less about observing specific procedures and more about how a team focuses and measures their progress. \n\nRather than just boring you with an accounting of agile methodologies, this course focuses on helping you better charter your team’s focus, definition of success, and practice of agile. While learning about agile mainstays like Scrum, XP, and kanban, you’ll also learn to help your team ask the right questions about how they’re working and facilitate good answers on how agile can help.    \n\nThis course is supported by the Batten Institute at UVA’s Darden School of Business. The Batten Institute’s mission is to improve the world through entrepreneurship and innovation: www.batteninstitute.org.\n\nSHOW ALL ABOUT MANAGING AN AGILE TEAM\nSHOW ALL"
    },
    "/specializations/ibm-cloud-application-development-foundations",
    {
       "Url":"/learn/introduction-to-cloud?specialization=ibm-cloud-application-development-foundations",
       "name":"Introduction to Cloud Computing",
       "Rating":"Introduction to Cloud Computing\n4.8\nstars\n1,133 ratings\n•\n269 reviews\n\nThis course introduces you to the core concepts of cloud computing. You gain the foundational knowledge required for understanding cloud computing from a business perspective as also for becoming a cloud practitioner. You understand the definition and essential characteristics of cloud computing, its history, the business case for cloud computing, and emerging technology usecases enabled by cloud. We introduce you to some of the prominent service providers of our times (e.g. AWS, Google, IBM, Microsoft, etc.) the services they offer, and look at some case studies of cloud computing across industry verticals. \n\nYou learn about the various cloud service models (IaaS, PaaS, SaaS) and deployment models (Public, Private, Hybrid) and the key components of a cloud infrastructure (VMs, Networking, Storage - File, Block, Object, CDN). We also cover emergent cloud trends and practices including - Hybrid Multicloud, Microservices, Serverless, DevOps, Cloud Native and Application Modernization. And we go over the basics of cloud security, monitoring, and different job roles in the cloud industry. \n\nEven though this course does not require any prior cloud computing or programming experience, by the end of the course, you will have created your own account on IBM Cloud and gained some hands-on experience by provisioning a cloud service and working with it.\n\nThis course is suitable for a large variety of audiences - whether you are an executive / manager / student who wants to become familiar with cloud computing terminology and concepts, or someone who wants foundational  grounding in cloud computing to start a career in this field or become a cloud practitioner - such as a cloud engineer, developer, analyst, etc.\n\nThe completion of this course also makes you eligible to earn the Cloud Computing Core IBM digital badge.  More information about the badge can be found here: https://www.youracclaim.com/org/ibm/badge/introduction-to-cloud-computing\n\nSHOW ALL ABOUT INTRODUCTION TO CLOUD COMPUTING\nSHOW ALL"
    },
    {
       "Url":"/learn/introduction-to-web-development-with-html-css-javacript?specialization=ibm-cloud-application-development-foundations",
       "name":"Introduction to Web Development with HTML, CSS, JavaScript",
       "Rating":"Introduction to Web Development with HTML, CSS, JavaScript\n4.4\nstars\n155 ratings\n•\n38 reviews\n\nWant to take the first steps to become a Cloud Application Developer? This course will lead you through the languages and tools you will need to develop your own Cloud Apps.\n\nBeginning with an explanation of how internet servers and clients work together to deliver applications to users, this course then takes you through the context for application development in the Cloud, introducing front-end, back-end, and full-stack development.\n\nYou’ll then focus on the languages you need for front-end development, working with HTML, CSS, and JavaScript.\n\nFinally, you will discover tools that help you to store your projects and keep track of changes made to project files, such as Git and GitHub.\n\nSHOW ALL ABOUT INTRODUCTION TO WEB DEVELOPMENT WITH HTML, CSS, JAVASCRIPT\nSHOW ALL"
    },
    {
       "Url":"/learn/developing-cloud-native-applications?specialization=ibm-cloud-application-development-foundations",
       "name":"Developing Cloud Native Applications",
       "Rating":"Developing Cloud Native Applications\n4.2\nstars\n70 ratings\n•\n28 reviews\n\nDo you want to learn about developing applications that are cloud native right from conception to implementation? In this course, you’ll begin with some crucial cloud concepts. Then, you will dive into specific tools and techniques for developing cloud native apps. Learning about the Cloud Native Computing Foundation, the significance of hybrid cloud infrastructures, and how they affect cloud app developers will be covered You will then look at two key areas of cloud thinking: modernization and continuous integration/continuous delivery.\n\nSHOW ALL ABOUT DEVELOPING CLOUD NATIVE APPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/node-js?specialization=ibm-cloud-application-development-foundations",
       "name":"Developing Cloud Apps with Node.js and React",
       "Rating":"Developing Cloud Apps with Node.js and React\n3.9\nstars\n50 ratings\n•\n17 reviews\n\nIn this course, you will focus on server-side JavaScript and frameworks. You will discover ways to make development faster and easier in web browsers and embedded systems. You may ask, what is the relevance of developing cloud applications with Node.js and React? \n\nIn 2020, the Stack Overflow survey of developers reported that 51.4% of respondents are using Node.js, making it number one in the category of Other Frameworks, Libraries, and Tools.  \n\nIn the Most Loved, Dreaded, and Wanted category for Other Frameworks, Libraries, and Tools, Node.js is in the top ten at 66.8%. In the Web Frameworks category, React is number two at 35.9% in usage and  66.9% in the Most Loved, Dreaded, and Wanted category for Web Frameworks. \n\nThis course is designed to help you achieve success in this fast-growing cloud computing area. You may be an IT person looking to step up in your career,  a new graduate seeking to establish a solid skillset to score a job in the cloud or web development,  an IT decision-maker who needs to manage more cloud-centric projects, or someone in another field who wants to be able to talk about cloud computing knowledgeably.\n\nSHOW ALL ABOUT DEVELOPING CLOUD APPS WITH NODE.JS AND REACT\nSHOW ALL"
    },
    "/specializations/positivepsychology",
    {
       "Url":"/learn/positive-psychology-visionary-science?specialization=positivepsychology",
       "name":"Positive Psychology: Martin E. P. Seligman’s Visionary Science",
       "Rating":"Positive Psychology: Martin E. P. Seligman’s Visionary Science\n4.9\nstars\n4,545 ratings\n•\n1,620 reviews\n\nDr. Martin E.P.  Seligman—renowned worldwide as the “father of Positive Psychology”—has led visionary leaps in the scientific research, empirical data and personal understandings of human flourishing. This course explores the past, present and future of positive psychology as a journey through the key scientific leaps led by Dr. Seligman and his colleagues at the University of Pennsylvania's Positive Psychology Center and Master of Applied Positive Psychology program. \n\nThere are no prerequisites.\n\nSHOW ALL ABOUT POSITIVE PSYCHOLOGY: MARTIN E. P. SELIGMAN’S VISIONARY SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/positive-psychology-applications?specialization=positivepsychology",
       "name":"Positive Psychology: Applications and Interventions",
       "Rating":"Positive Psychology: Applications and Interventions\n4.8\nstars\n1,714 ratings\n•\n474 reviews\n\nPositive interventions are one of the building blocks for the application of positive psychology in our day-to-day lives. In this course taught by Dr. James Pawelski, we explore positive interventions through theory, research and practice. We provide learners the basic tools for using and measuring positive psychology in professional or personal contexts. Suggested prerequisite: Positive Psychology: Martin E. P. Seligman’s Visionary Science.\n\nSHOW ALL ABOUT POSITIVE PSYCHOLOGY: APPLICATIONS AND INTERVENTIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/positive-psychology-methods?specialization=positivepsychology",
       "name":"Positive Psychology: Character, Grit and Research Methods",
       "Rating":"Positive Psychology: Character, Grit and Research Methods\n4.3\nstars\n968 ratings\n•\n295 reviews\n\nLearners discover how apply to research methods to their study of Positive Psychology. In this course, we study with Dr. Angela Duckworth and Dr. Claire Robertson-Kraft. Through an exploration their work \"True Grit\" and interviews with researchers and practitioners, you develop a research hypothesis and learn how to understand the difference between internal and external validity. You also begin to understand and apply the strengths and weaknesses associated with different types of measurements and evaluation designs. You then interpret the results in an empirical study. Suggested prerequisites: Positive Psychology: Martin E. P. Seligman’s Visionary Science and Positive Psychology: Applications and Interventions.\n\nSHOW ALL ABOUT POSITIVE PSYCHOLOGY: CHARACTER, GRIT AND RESEARCH METHODS\nSHOW ALL"
    },
    {
       "Url":"/learn/positive-psychology-resilience?specialization=positivepsychology",
       "name":"Positive Psychology: Resilience Skills",
       "Rating":"Positive Psychology: Resilience Skills\n4.9\nstars\n1,677 ratings\n•\n580 reviews\n\nLearn how to incorporate resilience interventions into your personal and professional life with Dr. Karen Reivich. In this course, you are exposed to the foundational research in resilience, including protective factors such as mental agility and optimism. Several types of resilience interventions are explored including cognitive strategies; strategies to manage anxiety and increase positive emotions such as gratitude; and a critical relationship enhancement skill. Throughout the course, you will hear examples of individuals using resilience skills in their personal and professional lives.  Suggested prerequisites: Positive Psychology: Martin E. P. Seligman’s Visionary Science, Positive Psychology: Applications and Interventions and Positive Psychology: Character, Grit & Research Methods.\n\nSHOW ALL ABOUT POSITIVE PSYCHOLOGY: RESILIENCE SKILLS\nSHOW ALL"
    },
    {
       "Url":"/learn/positive-psychology-project?specialization=positivepsychology",
       "name":"Positive Psychology Specialization Project: Design Your Life for Well-being",
       "Rating":"Positive Psychology Specialization Project: Design Your Life for Well-being\n4.8\nstars\n631 ratings\n•\n154 reviews\n\nYou are encouraged to take the first four courses of the Foundations of Positive Psychology Specialization before starting this course and completing the Specialization Project. This course, taught by Dr. Martin E.P. Seligman brings all the key concepts from the first four courses to practice as you develop and test a new positive intervention for an audience of your choice. You identify opportunities in your daily life to increase the wellbeing by using knowledge you developed in the first four courses of the Specialization. In this final project, you evaluate the efficacy of a positive intervention based on subjective and objective measures. Then, you compare how empirical and non-empirically-based positive interventions can be applied to influence a person's wellbeing. Lastly, you reflect on how the fundamental elements of research methods are important in the everyday application of positive psychology.\n\nAfter completing all five courses, learners earn a certificate signed by Dr. Martin E.P. Seligman, Dr. James Pawelski, Dr. Angela Duckworth, Dr. Claire Robertson-Kraft and Dr. Karen Reivich.\n\nSHOW ALL ABOUT POSITIVE PSYCHOLOGY SPECIALIZATION PROJECT: DESIGN YOUR LIFE FOR WELL-BEING\nSHOW ALL"
    },
    "/specializations/wharton-fintech",
    {
       "Url":"/learn/wharton-fintech-overview-payments-regulations?specialization=wharton-fintech",
       "name":"FinTech: Foundations, Payments, and Regulations",
       "Rating":"FinTech: Foundations, Payments, and Regulations\n4.7\nstars\n1,667 ratings\n•\n380 reviews\n\nIn this course, you’ll learn the key components of modern-day investment strategies which utilize fintech. Professors Natasha Sarin and Chris Geczy  of the Wharton School have designed this course to help you understand the complex structure of  payment methods and financial regulations, so you can determine how fintech plays a role in the future of investing. Through analysis of robo-advising and changing demographic forces, you’ll learn how basic elements of trust underlie complex choice architecture in investments and impact investing. You’ll also explore payment methodologies and how fintech is emerging as an entrepreneurial solution to both investments and payment systems. By the end of this course, you’ll be able to identify different financial technologies, and understand the dynamic between the innovations and regulations,  and  employ best practices in developing a fintech strategy for yourself or your business. No prerequisites are required for this course, although a basic understanding of credit cards and other payment methods is helpful.\n\nSHOW ALL ABOUT FINTECH: FOUNDATIONS, PAYMENTS, AND REGULATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-cryptocurrency-blockchain-introduction-digital-currency?specialization=wharton-fintech",
       "name":"Cryptocurrency and Blockchain: An Introduction to Digital Currencies",
       "Rating":"Cryptocurrency and Blockchain: An Introduction to Digital Currencies\n4.6\nstars\n1,008 ratings\n•\n224 reviews\n\nWhat is Cryptocurrency and how is it an innovative and effective method of currency? This course was designed for individuals and organizations who want to learn how to navigate investment in cryptocurrencies. Professors Jessica Wachter and Sarah Hammer will guide you through developing a framework for understanding both Cryptocurrency and Blockchain. You’ll learn how to define a currency, analyze the foundations of digital signatures and blockchain technology in cryptocurrency, and accurately assess the risks of cryptocurrency in a modern investment portfolio. By the end of this course, you’ll have a deep understanding of the realities of Cryptocurrency, the intricacies of Blockchain technology, and an effective strategy for incorporating Cryptocurrency into your investment plans. No prerequisites are required, although \"Fintech: Foundations, Payments, and Regulations\"  from Wharton's Fintech Specialization is recommended.\n\nSHOW ALL ABOUT CRYPTOCURRENCY AND BLOCKCHAIN: AN INTRODUCTION TO DIGITAL CURRENCIES\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-crowdfunding-marketplace-lending-modern-investing?specialization=wharton-fintech",
       "name":"Lending, Crowdfunding, and Modern Investing",
       "Rating":"Lending, Crowdfunding, and Modern Investing\n4.7\nstars\n436 ratings\n•\n57 reviews\n\nIn this course, you’ll learn the foundational theories behind robo-advising, crowdfunding, and marketplace lending, and how to apply these theories to optimize your investments. Professor David Musto of the Wharton School has designed this course to help you gain a practical understanding of the theoretical frameworks of Modern Portfolio Theory and Financial Technology. You’ll learn how to apply the ideas behind robo-advising and crowdfunding to better assess and leverage a more optimized portfolio while managing risks. You’ll also explore the current consumer credit landscape and learn how to utilize financial technologies in your business. You’ll analyze real-life examples by studying the cases of Square and CommonBond. By the end of this course, you’ll have honed your skills in calculating risks and returns in robo-advising and crowdfunding, and be able to assess the value of marketplace lending to achieve better returns on your investments. No prerequisites are required for this course, although \"Fintech: Foundations, Payments, and Regulations\" and \"Cryptocurrency and Blockchain: An Introduction to Digital Currencies\" from Wharton's Fintech Specialization are recommended.\n\nSHOW ALL ABOUT LENDING, CROWDFUNDING, AND MODERN INVESTING\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-ai-application-insurtech-real-estate-technology?specialization=wharton-fintech",
       "name":"Application of AI, InsurTech, and Real Estate Technology",
       "Rating":"Application of AI, InsurTech, and Real Estate Technology\n4.6\nstars\n394 ratings\n•\n59 reviews\n\nIn this course, you’ll learn about the emerging technologies in Artificial Intelligence and Machine Learning that are utilized in InsurTech and Real Estate Tech. Professor Chris Geczy of the Wharton School has designed this course to help you navigate the complex world of insurance and real estate tech, and understand how FinTech plays a role in the future of the industry. Through study and analysis of Artificial Intelligence and Machine Learning, you’ll learn how InsurTech is redefining the insurance industry. You’ll also explore classifications of insurtech companies and the size of the InsurTech, Real Estate Tech, and AI markets. You will also explore  FinTech specialties with Warren Pennington from Vanguard. By the end of this course, you’ll be able to identify emerging technologies of AI, Machine Learning, and Financial Technologies from a variety of insurance and real estate tech companies and their impact in the future of finance and investments.\n\nSHOW ALL ABOUT APPLICATION OF AI, INSURTECH, AND REAL ESTATE TECHNOLOGY\nSHOW ALL"
    },
    "/specializations/architecting-google-kubernetes-engine",
    {
       "Url":"/learn/gcp-fundamentals?specialization=architecting-google-kubernetes-engine",
       "name":"Google Cloud Fundamentals: Core Infrastructure",
       "Rating":"Google Cloud Fundamentals: Core Infrastructure\n4.7\nstars\n41,631 ratings\n•\n7,152 reviews\n\nThis course introduces you to important concepts and terminology for working with Google Cloud Platform (GCP). You learn about, and compare, many of the computing and storage services available in Google Cloud Platform, including Google App Engine, Google Compute Engine, Google Kubernetes Engine, Google Cloud Storage, Google Cloud SQL, and BigQuery. You learn about important resource and policy management tools, such as the Google Cloud Resource Manager hierarchy and Google Cloud Identity and Access Management. Hands-on labs give you foundational skills for working with GCP.\n\nNote:\n•Google services are currently unavailable in China.\n\nSHOW ALL ABOUT GOOGLE CLOUD FUNDAMENTALS: CORE INFRASTRUCTURE\nSHOW ALL"
    },
    {
       "Url":"/learn/foundations-google-kubernetes-engine-gke?specialization=architecting-google-kubernetes-engine",
       "name":"Architecting with Google Kubernetes Engine: Foundations",
       "Rating":"Architecting with Google Kubernetes Engine: Foundations\n4.7\nstars\n2,003 ratings\n•\n262 reviews\n\nIn this course, \"Architecting with Google Kubernetes Engine: Foundations,\" you get a review of the layout and principles of Google Cloud, followed by an introduction to creating and managing software containers and an introduction to the architecture of Kubernetes."
    },
    {
       "Url":"/learn/deploying-workloads-google-kubernetes-engine-gke?specialization=architecting-google-kubernetes-engine",
       "name":"Architecting with Google Kubernetes Engine: Workloads",
       "Rating":"Architecting with Google Kubernetes Engine: Workloads\n4.7\nstars\n1,078 ratings\n•\n172 reviews\n\nIn this course, \"Architecting with Google Kubernetes Engine: Workloads,\" you learn about performing Kubernetes operations; creating and managing deployments; the tools of GKE networking; and how to give your Kubernetes workloads persistent storage."
    },
    {
       "Url":"/learn/deploying-secure-kubernetes-containers-in-production?specialization=architecting-google-kubernetes-engine",
       "name":"Architecting with Google Kubernetes Engine: Production",
       "Rating":"Architecting with Google Kubernetes Engine: Production\n4.7\nstars\n809 ratings\n•\n79 reviews\n\nIn this course, \"Architecting with Google Kubernetes Engine: Production,\" you'll learn about Kubernetes and Google Kubernetes Engine (GKE) security; logging and monitoring; and using Google Cloud managed storage and database services from within GKE."
    },
    "/specializations/security-google-cloud-platform",
    {
       "Url":"/learn/gcp-fundamentals?specialization=security-google-cloud-platform",
       "name":"Google Cloud Fundamentals: Core Infrastructure",
       "Rating":"Google Cloud Fundamentals: Core Infrastructure\n4.7\nstars\n41,631 ratings\n•\n7,152 reviews\n\nThis course introduces you to important concepts and terminology for working with Google Cloud Platform (GCP). You learn about, and compare, many of the computing and storage services available in Google Cloud Platform, including Google App Engine, Google Compute Engine, Google Kubernetes Engine, Google Cloud Storage, Google Cloud SQL, and BigQuery. You learn about important resource and policy management tools, such as the Google Cloud Resource Manager hierarchy and Google Cloud Identity and Access Management. Hands-on labs give you foundational skills for working with GCP.\n\nNote:\n•Google services are currently unavailable in China.\n\nSHOW ALL ABOUT GOOGLE CLOUD FUNDAMENTALS: CORE INFRASTRUCTURE\nSHOW ALL"
    },
    {
       "Url":"/learn/managing-security-in-google-cloud-platform?specialization=security-google-cloud-platform",
       "name":"Managing Security in Google Cloud",
       "Rating":"Managing Security in Google Cloud\n4.7\nstars\n963 ratings\n•\n144 reviews\n\nThis self-paced training course gives participants broad study of security controls and techniques on Google Cloud. Through recorded lectures, demonstrations, and hands-on labs, participants explore and deploy the components of a secure Google Cloud solution, including Cloud Identity, Resource Manager, Cloud IAM, Virtual Private Cloud firewalls, Cloud Load Balancing, Cloud Peering, Cloud Interconnect, and VPC Service Controls.\n\nSHOW ALL ABOUT MANAGING SECURITY IN GOOGLE CLOUD\nSHOW ALL"
    },
    {
       "Url":"/learn/security-best-practices-in-google-cloud?specialization=security-google-cloud-platform",
       "name":"Security Best Practices in Google Cloud",
       "Rating":"Security Best Practices in Google Cloud\n4.6\nstars\n256 ratings\n•\n39 reviews\n\nThis self-paced training course gives participants broad study of security controls and techniques on Google Cloud. Through recorded lectures, demonstrations, and hands-on labs, participants explore and deploy the components of a secure Google Cloud solution, including Cloud Storage access control technologies, Security Keys, Customer-Supplied Encryption Keys, API access controls, scoping, shielded VMs, encryption, and signed URLs. It also covers securing Kubernetes environments.\n\nSHOW ALL ABOUT SECURITY BEST PRACTICES IN GOOGLE CLOUD\nSHOW ALL"
    },
    {
       "Url":"/learn/mitigating-security-vulnerabilites-gcp?specialization=security-google-cloud-platform",
       "name":"Mitigating Security Vulnerabilities on Google Cloud",
       "Rating":"Mitigating Security Vulnerabilities on Google Cloud\n4.7\nstars\n632 ratings\n•\n81 reviews\n\nIn this self-paced training course, participants learn mitigations for attacks at many points in a Google Cloud-based infrastructure, including Distributed Denial-of-Service attacks, phishing attacks, and threats involving content classification and use. They also learn about the Security Command Center, cloud logging and audit logging, and using Forseti to view overall compliance with your organization's security policies.\n\nSHOW ALL ABOUT MITIGATING SECURITY VULNERABILITIES ON GOOGLE CLOUD\nSHOW ALL"
    },
    "/specializations/networking-google-cloud-platform",
    {
       "Url":"/learn/gcp-fundamentals?specialization=networking-google-cloud-platform",
       "name":"Google Cloud Fundamentals: Core Infrastructure",
       "Rating":"Google Cloud Fundamentals: Core Infrastructure\n4.7\nstars\n41,631 ratings\n•\n7,152 reviews\n\nThis course introduces you to important concepts and terminology for working with Google Cloud Platform (GCP). You learn about, and compare, many of the computing and storage services available in Google Cloud Platform, including Google App Engine, Google Compute Engine, Google Kubernetes Engine, Google Cloud Storage, Google Cloud SQL, and BigQuery. You learn about important resource and policy management tools, such as the Google Cloud Resource Manager hierarchy and Google Cloud Identity and Access Management. Hands-on labs give you foundational skills for working with GCP.\n\nNote:\n•Google services are currently unavailable in China.\n\nSHOW ALL ABOUT GOOGLE CLOUD FUNDAMENTALS: CORE INFRASTRUCTURE\nSHOW ALL"
    },
    {
       "Url":"/learn/networking-gcp-defining-implementing-networks?specialization=networking-google-cloud-platform",
       "name":"Networking in Google Cloud: Defining and Implementing Networks",
       "Rating":"Networking in Google Cloud: Defining and Implementing Networks\n4.8\nstars\n1,375 ratings\n•\n194 reviews\n\nLearn about the broad variety of networking options on Google Cloud. This course uses lectures, demos, and hands-on labs to help you explore and deploy Google Cloud networking technologies, including Virtual Private Cloud (VPC) networks, subnets, and firewalls; interconnection among networks; load balancing; Cloud DNS; Cloud CDN; and Cloud NAT. You'll also learn about common network design patterns and automated deployment using Cloud Deployment Manager or Terraform.\n\nSHOW ALL ABOUT NETWORKING IN GOOGLE CLOUD: DEFINING AND IMPLEMENTING NETWORKS\nSHOW ALL"
    },
    {
       "Url":"/learn/networking-gcp-hybrid-connectivity-network-management?specialization=networking-google-cloud-platform",
       "name":"Networking in Google Cloud: Hybrid Connectivity and Network Management",
       "Rating":"Networking in Google Cloud: Hybrid Connectivity and Network Management\n4.8\nstars\n917 ratings\n•\n111 reviews\n\nLearn about the broad variety of networking options on Google Cloud. This course uses lectures, demos, and hands-on labs to help you explore and deploy Google Cloud networking technologies, including Virtual Private Cloud (VPC) networks, subnets, and firewalls; interconnection among networks; load balancing; Cloud DNS; Cloud CDN; and Cloud NAT. You'll also learn about common network design patterns and automated deployment using Cloud Deployment Manager or Terraform.\n\nSHOW ALL ABOUT NETWORKING IN GOOGLE CLOUD: HYBRID CONNECTIVITY AND NETWORK MANAGEMENT\nSHOW ALL"
    },
    "/specializations/aws-fundamentals",
    {
       "Url":"/learn/aws-cloud-technical-essentials?specialization=aws-fundamentals",
       "name":"AWS Cloud Technical Essentials",
       "Rating":"AWS Cloud Technical Essentials\n4.8\nstars\n858 ratings\n•\n208 reviews\n\nAre you in a technical role and want to learn the fundamentals of AWS? Do you aspire to have a job or career as a cloud developer, architect, or in an operations role? If so, AWS Cloud Technical Essentials is an ideal way to start. This course was designed for those at the beginning of their cloud-learning journey - no prior knowledge of cloud computing or AWS products and services required!\n\nThroughout the course, students will build highly available, scalable, and cost effective application step-by-step. Upon course completion, you will be able to make an informed decision about when and how to apply core AWS services for compute, storage, and database to different use cases. You’ll also learn about cloud security with a review of AWS' shared responsibility model and an introduction to AWS Identity and Access Management (IAM). And, you’ll know how AWS services can be used to monitor and optimize infrastructure in the cloud.\n\nAWS Cloud Technical Essentials is a fundamental-level course and will build your competence, confidence, and credibility with practical cloud skills that help you innovate and advance your professional future. Enroll in AWS Cloud Technical Essentials and start learning the technical fundamentals of AWS today!\n\nNote: This course was designed for learners with a technical background. If you are new to the cloud or come from a business background, we recommend completing AWS Cloud Practitioner Essentials (https://www.coursera.org/learn/aws-cloud-practitioner-essentials) before enrolling in this course.\n\nSHOW ALL ABOUT AWS CLOUD TECHNICAL ESSENTIALS\nSHOW ALL"
    },
    {
       "Url":"/learn/aws-fundamentals-addressing-security-risk?specialization=aws-fundamentals",
       "name":"AWS Fundamentals: Addressing Security Risk",
       "Rating":"AWS Fundamentals: Addressing Security Risk\n4.4\nstars\n2,717 ratings\n•\n519 reviews\n\nWelcome to AWS Fundamentals: Addressing Security Risk!\n\nThis course will give you an overview of security best practices when developing and managing applications on AWS. The course, created by AWS experts and delivered by AWS Solutions Architects, uses video lectures, hands-on exercise guides, demonstrations, and quizzes to dive deep on concepts about security on AWS. You will learn about the concept of “least privilege” and the AWS Shared Responsibility Model, as well as view demonstrations of Amazon GuardDuty, AWS Secrets Manager, and cross-account access.\n\nWe encourage IT professionals and leaders who are interested in learning about best practices for securing an AWS environment and applications developed on AWS to enroll in this course. Before taking this course, we recommend you complete AWS Fundamentals: Going Cloud Native (https://www.coursera.org/learn/aws-fundamentals-going-cloud-native).\n\nClass forums will also allow you to ask questions and interact with AWS training instructors.\n\nSHOW ALL ABOUT AWS FUNDAMENTALS: ADDRESSING SECURITY RISK\nSHOW ALL"
    },
    {
       "Url":"/learn/aws-fundamentals-cloud-migration?specialization=aws-fundamentals",
       "name":"AWS Fundamentals: Migrating to the Cloud",
       "Rating":"AWS Fundamentals: Migrating to the Cloud\n4.6\nstars\n1,735 ratings\n•\n241 reviews\n\nThis four week course focuses on migrating workloads to AWS.  We will focus on  analyzing your current environment, planning your migration, AWS services that are commonly used during your migration, and the actual migration steps.  \n\nHands-on labs are available, though not required for this class.  Access to the labs is limited to paid enrolled students.  You can audit this  course without taking the labs.  As we dive into each of the services covered in this class, there will be links to documentation where you can find example applications and code samples.\n\nThis course is also available in Spanish. To join the fully translated Spanish version, visit this page:\nhttps://www.coursera.org/learn/aws-fundamentals-cloud-migration-es.\n\nSHOW ALL ABOUT AWS FUNDAMENTALS: MIGRATING TO THE CLOUD\nSHOW ALL"
    },
    {
       "Url":"/learn/aws-fundamentals-building-serverless-applications?specialization=aws-fundamentals",
       "name":"AWS Fundamentals: Building Serverless Applications",
       "Rating":"AWS Fundamentals: Building Serverless Applications\n4.7\nstars\n2,596 ratings\n•\n420 reviews\n\nThis course will introduce you to Amazon Web Services (AWS) serverless architecture. Through demonstrations and hands-on exercises you'll learn skills in building and deploying serverless solutions. \n\nUsing real-world examples of a serverless website and chat bot, you'll build upon your existing knowledge of the AWS cloud to take advantage of the benefits of modern architectures for greater agility, innovation, and lower total cost of ownership across a range of AWS services, including AWS Lambda, Amazon API Gateway, Amazon DynamoDB, and Amazon Lex.\n\nIn this course, you'll have the option to complete hands-on exercises. We strongly suggest you take advantage of the AWS Free Tier to follow the lab exercises provided by throughout the course. Be aware that any services used outside of the free tier may result in you incurring charges through your AWS account. Class forums will also allow you to ask questions and interact with AWS training instructors. After completing this course, you'll have the knowledge and skills to build serverless solutions on AWS. \n\nThis course has been developed by AWS, and is delivered by AWS technical instructors who teach cloud computing courses around the globe.\n\nSHOW ALL ABOUT AWS FUNDAMENTALS: BUILDING SERVERLESS APPLICATIONS\nSHOW ALL"
    },
    "/specializations/aws-python-serverless-development",
    {
       "Url":"/learn/aws-cloud-technical-essentials?specialization=aws-python-serverless-development",
       "name":"AWS Cloud Technical Essentials",
       "Rating":"AWS Cloud Technical Essentials\n4.8\nstars\n858 ratings\n•\n208 reviews\n\nAre you in a technical role and want to learn the fundamentals of AWS? Do you aspire to have a job or career as a cloud developer, architect, or in an operations role? If so, AWS Cloud Technical Essentials is an ideal way to start. This course was designed for those at the beginning of their cloud-learning journey - no prior knowledge of cloud computing or AWS products and services required!\n\nThroughout the course, students will build highly available, scalable, and cost effective application step-by-step. Upon course completion, you will be able to make an informed decision about when and how to apply core AWS services for compute, storage, and database to different use cases. You’ll also learn about cloud security with a review of AWS' shared responsibility model and an introduction to AWS Identity and Access Management (IAM). And, you’ll know how AWS services can be used to monitor and optimize infrastructure in the cloud.\n\nAWS Cloud Technical Essentials is a fundamental-level course and will build your competence, confidence, and credibility with practical cloud skills that help you innovate and advance your professional future. Enroll in AWS Cloud Technical Essentials and start learning the technical fundamentals of AWS today!\n\nNote: This course was designed for learners with a technical background. If you are new to the cloud or come from a business background, we recommend completing AWS Cloud Practitioner Essentials (https://www.coursera.org/learn/aws-cloud-practitioner-essentials) before enrolling in this course.\n\nSHOW ALL ABOUT AWS CLOUD TECHNICAL ESSENTIALS\nSHOW ALL"
    },
    {
       "Url":"/learn/building-modern-python-applications-on-aws?specialization=aws-python-serverless-development",
       "name":"Building Modern Python Applications on AWS",
       "Rating":"Building Modern Python Applications on AWS\n4.5\nstars\n579 ratings\n•\n117 reviews\n\nIn modern cloud native application development, it’s oftentimes the goal to build out serverless architectures that are scalable, are highly available, and are fully managed. This means less operational overhead for you and your business, and more focusing on the applications and business specific projects that differentiate you in your marketplace. In this course, we will be covering how to build a modern, greenfield serverless backend on AWS. \n\nBuilding brand new applications on AWS is a different task than lifting and shifting existing applications into AWS. When you have an existing application that you need to move to AWS, you might first look to using Amazon EC2 as your virtual machines, or maybe you might look into using docker containers and container hosting services like Amazon Elastic Container Service or Amazon Elastic Kubernetes Service. Those are all great application hosting options, but in most cases, they still require you to have some kind of pulse on the underlying infrastructure hosting your application. \t`\n\nBuilding Modern Python Applications on AWS will explore how to build an API driven application using Amazon API Gateway for serverless API hosting, AWS Lambda for serverless computing, and Amazon Cognito for serverless authentication. We will follow an API driven development process and first mock up what the API will look like. We will cover all the ins and outs of the service Amazon API Gateway, and as you’ll learn- it does a lot more than just hosting an API. \n\nThen we will add authentication to the API using Amazon Cognito. You’ll learn about how the authorization flow works with Cognito, and how to build it into your APIs. From there, we will add a Lambda backend that will be triggered by API Gateway. The lambda functions will be using the AWS SDKs to perform various data processing tasks. You’ll learn about the different configurations that exist for Lambda, and we will show you how to create and manage lambda functions. Some of the features of our API will require multiple lambda functions to execute in a specific order, like a workflow, and we will use AWS Step Functions to create a serverless workflow. Finally, we will talk about how to optimize your APIs at every layer using AWS features.\n\nNote: There are four versions of this class, \"Building Modern Node.js Applications on AWS\" for Node.js developers, Building Modern Java Applications on AWS\" for Java developers, \"Building Modern .NET Applications on AWS\" for .NET developers, and this course, \"Building Modern Python Applications on AWS\" for Python developers. The courses do for a large part, overlap and in general, we recommend that you take the course that focuses on the SDK you plan to use to develop your AWS Cloud based applications.\n\nWe expect that you have basic knowledge of AWS already. Some examples of concepts you should be familiar with are: you should know the basics of the AWS Global infrastructure, like what regions and availability zones are. You also should know the at a high-level AWS Identity and Access Management, or IAM, and how it is used to control access to AWS resources. You should also understand what an Amazon EC2 instance is, what Amazon S3 is, what a VPC is, as well as other basic AWS terminology.\n\nSHOW ALL ABOUT BUILDING MODERN PYTHON APPLICATIONS ON AWS\nSHOW ALL"
    },
    {
       "Url":"/learn/dynamodb-nosql-database-driven-apps?specialization=aws-python-serverless-development",
       "name":"Amazon DynamoDB: Building NoSQL Database-Driven Applications",
       "Rating":"Amazon DynamoDB: Building NoSQL Database-Driven Applications\n4.8\nstars\n128 ratings\n•\n29 reviews\n\nThis course introduces you to NoSQL databases and the challenges they solve. Expert instructors will dive deep into Amazon DynamoDB topics such as recovery, SDKs, partition keys, security and encryption, global tables, stateless applications, streams, and best practices.\n\nDynamoDB is a key-value and document database that delivers single-digit millisecond performance at any scale. It's a fully managed, multiregion, multimaster database with built-in security, backup and restore, and in-memory caching for internet-scale applications. DynamoDB can handle more than 10 trillion requests per day and support peaks of more than 20 million requests per second.\n\nThis course uses a combination of video-based lectures delivered by Amazon Web Services expert technical trainers, demonstrations, and hands-on lab exercises, that you run in your own AWS account  to enable you to build, deploy and manage your own DynamoDB-powered application.\n\nSHOW ALL ABOUT AMAZON DYNAMODB: BUILDING NOSQL DATABASE-DRIVEN APPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/aws-improve-python-code-amazon-codeguru?specialization=aws-python-serverless-development",
       "name":"Improve Your Python Code Using Amazon CodeGuru",
       "Rating":"Improve Your Python Code Using Amazon CodeGuru\n\nLearn how to use Amazon CodeGuru Reviewer to automatically identify issues and vulnerabilities to improve your code quality with our new digital course, Improve your Python Code using Amazon CodeGuru. This course is designed for Python developers who are interested in learning how to use CodeGuru Reviewer to save time and improve their code review process.\n\nIn this course, you’ll learn how to use CodeGuru Reviewer to detect issues and identify recommendations to improve the quality and security of your code. The course demonstrates how CodeGuru Reviewer finds code anomalies and explains how to understand and apply its automated suggestions.\n\nDeveloped at the source, this new digital course empowers you to learn about Amazon CodeGuru from the experts at AWS whenever, wherever you want. Advance your skills and knowledge to build your future in the AWS Cloud. Enroll today!\n\nNote: There are two versions of this course: \"Improve Your Java Code Using Amazon CodeGuru\" for Java developers and \"Improve Your Python Code Using Amazon CodeGuru\" for Python developers. The courses do for a large part, overlap and in general, we recommend that you take the course that focuses on the SDK you plan to use to develop your AWS Cloud based applications.\n\nSHOW ALL ABOUT IMPROVE YOUR PYTHON CODE USING AMAZON CODEGURU\nSHOW ALL"
    },
    "/specializations/ai-healthcare",
    {
       "Url":"/learn/intro-to-healthcare?specialization=ai-healthcare",
       "name":"Introduction to Healthcare",
       "Rating":"Introduction to Healthcare\n4.8\nstars\n361 ratings\n•\n92 reviews\n\nSolving the problems and challenges within the U.S. healthcare system requires a deep understanding of how the system works. Successful solutions and strategies must take into account the realities of the current system. \n\nThis course explores the fundamentals of the U.S. healthcare system. It will introduce the principal institutions and participants in healthcare systems, explain what they do, and discuss the interactions between them. The course will cover physician practices, hospitals, pharmaceuticals, and insurance and financing arrangements. \n\nWe will also discuss the challenges of healthcare cost management, quality of care, and access to care. While the course focuses on the U.S. healthcare system, we will also refer to healthcare systems in other developed countries.\n\n\n\nThe Stanford University School of Medicine is accredited by the Accreditation Council for Continuing Medical Education (ACCME) to provide continuing medical education for physicians.  Visit the FAQs below for important information regarding 1) Date of original release and Termination or expiration date; 2) Accreditation and Credit Designation statements; 3) Disclosure of financial relationships for every person in control of activity content.\n\nSHOW ALL ABOUT INTRODUCTION TO HEALTHCARE\nSHOW ALL"
    },
    {
       "Url":"/learn/introduction-clinical-data?specialization=ai-healthcare",
       "name":"Introduction to Clinical Data",
       "Rating":"Introduction to Clinical Data\n4.6\nstars\n126 ratings\n•\n26 reviews\n\nThis course introduces you to a framework for successful and ethical medical data mining. We will explore the variety of clinical data collected during the delivery of healthcare. You will learn to construct analysis-ready datasets and apply computational procedures to answer clinical questions. We will also explore issues of fairness and bias that may arise when we leverage healthcare data to make decisions about patient care.\n\nThe Stanford University School of Medicine is accredited by the Accreditation Council for Continuing Medical Education (ACCME) to provide continuing medical education for physicians.  Visit the FAQs below for important information regarding 1) Date of original release and Termination or expiration date; 2) Accreditation and Credit Designation statements; 3) Disclosure of financial relationships for every person in control of activity content.\n\nSHOW ALL ABOUT INTRODUCTION TO CLINICAL DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/fundamental-machine-learning-healthcare?specialization=ai-healthcare",
       "name":"Fundamentals of Machine Learning for Healthcare",
       "Rating":"Fundamentals of Machine Learning for Healthcare\n4.8\nstars\n156 ratings\n•\n44 reviews\n\nMachine learning and artificial intelligence hold the potential to transform healthcare and open up a world of incredible promise. But we will never realize the potential of these technologies unless all stakeholders have basic competencies in both healthcare and machine learning concepts and principles. \n\nThis course will introduce the fundamental concepts and principles of machine learning as it applies to medicine and healthcare. We will explore machine learning approaches, medical use cases, metrics unique to healthcare, as well as best practices for designing, building, and evaluating machine learning applications in healthcare.\n\nThe course will empower those with non-engineering backgrounds in healthcare, health policy, pharmaceutical development, as well as data science with the knowledge to critically evaluate and use these technologies.\n\n \nCo-author: Geoffrey Angus\n \nContributing Editors:\nMars Huang\nJin Long\nShannon Crawford\nOge Marques\n\n\nThe Stanford University School of Medicine is accredited by the Accreditation Council for Continuing Medical Education (ACCME) to provide continuing medical education for physicians.  Visit the FAQs below for important information regarding 1) Date of original release and Termination or expiration date; 2) Accreditation and Credit Designation statements; 3) Disclosure of financial relationships for every person in control of activity content.\n\nSHOW ALL ABOUT FUNDAMENTALS OF MACHINE LEARNING FOR HEALTHCARE\nSHOW ALL"
    },
    {
       "Url":"/learn/evaluations-ai-applications-healthcare?specialization=ai-healthcare",
       "name":"Evaluations of AI Applications in Healthcare",
       "Rating":"Evaluations of AI Applications in Healthcare\n4.5\nstars\n99 ratings\n•\n29 reviews\n\nWith artificial intelligence applications proliferating throughout the healthcare system, stakeholders are faced with both opportunities and challenges of these evolving technologies. This course explores the principles of AI deployment in healthcare and the framework used to evaluate downstream effects of AI healthcare solutions.\n\nThe Stanford University School of Medicine is accredited by the Accreditation Council for Continuing Medical Education (ACCME) to provide continuing medical education for physicians.  Visit the FAQs below for important information regarding 1) Date of original release and Termination or expiration date; 2) Accreditation and Credit Designation statements; 3) Disclosure of financial relationships for every person in control of activity content.\n\nSHOW ALL ABOUT EVALUATIONS OF AI APPLICATIONS IN HEALTHCARE\nSHOW ALL"
    },
    {
       "Url":"/learn/ai-in-healthcare-capstone?specialization=ai-healthcare",
       "name":"AI in Healthcare Capstone",
       "Rating":"AI in Healthcare Capstone\n4.6\nstars\n76 ratings\n•\n22 reviews\n\nThis capstone project takes you on a guided tour exploring all the concepts we have covered in the different classes up till now. We have organized this experience around the journey of a patient who develops some respiratory symptoms and given the concerns around COVID19 seeks care with a primary care provider. We will follow the patient's journey from the lens of the data that are created at each encounter, which will bring us to a unique de-identified dataset created specially for this specialization. The data set spans EHR as well as image data and using this dataset, we will build models that enable risk-stratification decisions for our patient. We will review how the different choices you make -- such as those around feature construction, the data types to use, how the model evaluation is set up and how you handle the patient timeline -- affect the care that would be recommended by the model. During this exploration, we will also discuss the regulatory as well as ethical issues that come up as we attempt to use AI to help us make better care decisions for our patient. This course will be a hands-on experience in the day of a medical data miner.\n\nThe Stanford University School of Medicine is accredited by the Accreditation Council for Continuing Medical Education (ACCME) to provide continuing medical education for physicians.  Visit the FAQs below for important information regarding 1) Date of original release and Termination or expiration date; 2) Accreditation and Credit Designation statements; 3) Disclosure of financial relationships for every person in control of activity content.\n\nSHOW ALL ABOUT AI IN HEALTHCARE CAPSTONE\nSHOW ALL"
    },
    "/specializations/aws-java-serverless-development",
    {
       "Url":"/learn/aws-cloud-technical-essentials?specialization=aws-java-serverless-development",
       "name":"AWS Cloud Technical Essentials",
       "Rating":"AWS Cloud Technical Essentials\n4.8\nstars\n858 ratings\n•\n208 reviews\n\nAre you in a technical role and want to learn the fundamentals of AWS? Do you aspire to have a job or career as a cloud developer, architect, or in an operations role? If so, AWS Cloud Technical Essentials is an ideal way to start. This course was designed for those at the beginning of their cloud-learning journey - no prior knowledge of cloud computing or AWS products and services required!\n\nThroughout the course, students will build highly available, scalable, and cost effective application step-by-step. Upon course completion, you will be able to make an informed decision about when and how to apply core AWS services for compute, storage, and database to different use cases. You’ll also learn about cloud security with a review of AWS' shared responsibility model and an introduction to AWS Identity and Access Management (IAM). And, you’ll know how AWS services can be used to monitor and optimize infrastructure in the cloud.\n\nAWS Cloud Technical Essentials is a fundamental-level course and will build your competence, confidence, and credibility with practical cloud skills that help you innovate and advance your professional future. Enroll in AWS Cloud Technical Essentials and start learning the technical fundamentals of AWS today!\n\nNote: This course was designed for learners with a technical background. If you are new to the cloud or come from a business background, we recommend completing AWS Cloud Practitioner Essentials (https://www.coursera.org/learn/aws-cloud-practitioner-essentials) before enrolling in this course.\n\nSHOW ALL ABOUT AWS CLOUD TECHNICAL ESSENTIALS\nSHOW ALL"
    },
    {
       "Url":"/learn/building-modern-java-applications-on-aws?specialization=aws-java-serverless-development",
       "name":"Building Modern Java Applications on AWS",
       "Rating":"Building Modern Java Applications on AWS\n4.5\nstars\n33 ratings\n•\n8 reviews\n\nIn modern cloud native application development, it’s oftentimes the goal to build out serverless architectures that are scalable, are highly available, and are fully managed. This means less operational overhead for you and your business, and more focusing on the applications and business specific projects that differentiate you in your marketplace. In this course, we will be covering how to build a modern, greenfield serverless backend on AWS. \n\nBuilding brand new applications on AWS is a different task than lifting and shifting existing applications into AWS. When you have an existing application that you need to move to AWS, you might first look to using Amazon EC2 as your virtual machines, or maybe you might look into using docker containers and container hosting services like Amazon Elastic Container Service or Amazon Elastic Kubernetes Service. Those are all great application hosting options, but in most cases, they still require you to have some kind of pulse on the underlying infrastructure hosting your application. \t`\n\nBuilding Modern Java Applications on AWS will explore how to build an API driven application using Amazon API Gateway for serverless API hosting, AWS Lambda for serverless computing, and Amazon Cognito for serverless authentication. We will follow an API driven development process and first mock up what the API will look like. We will cover all the ins and outs of the service Amazon API Gateway, and as you’ll learn- it does a lot more than just hosting an API. \n\nThen we will add authentication to the API using Amazon Cognito. You’ll learn about how the authorization flow works with Cognito, and how to build it into your APIs. From there, we will add a Lambda backend that will be triggered by API Gateway. The lambda functions will be using the AWS SDKs to perform various data processing tasks. You’ll learn about the different configurations that exist for Lambda, and we will show you how to create and manage lambda functions. Some of the features of our API will require multiple lambda functions to execute in a specific order, like a workflow, and we will use AWS Step Functions to create a serverless workflow. Finally, we will talk about how to optimize your APIs at every layer using AWS features.\n\nNote: There are four versions of this class, \"Building Modern Node.js Applications on AWS\" for Node.js developers, \"Building Modern Python Applications on AWS\" for Python developers, \"Building Modern .NET Applications on AWS\" for .NET developers, and this course, \"Building Modern Java Applications on AWS\" for Java developers. The courses do for a large part, overlap and in general, we recommend that you take the course that focuses on the SDK you plan to use to develop your AWS Cloud based applications.\n\nWe expect that you have basic knowledge of AWS already. Some examples of concepts you should be familiar with are: you should know the basics of the AWS Global infrastructure, like what regions and availability zones are. You also should know the at a high-level AWS Identity and Access Management, or IAM, and how it is used to control access to AWS resources. You should also understand what an Amazon EC2 instance is, what Amazon S3 is, what a VPC is, as well as other basic AWS terminology.\n\nSHOW ALL ABOUT BUILDING MODERN JAVA APPLICATIONS ON AWS\nSHOW ALL"
    },
    {
       "Url":"/learn/dynamodb-nosql-database-driven-apps?specialization=aws-java-serverless-development",
       "name":"Amazon DynamoDB: Building NoSQL Database-Driven Applications",
       "Rating":"Amazon DynamoDB: Building NoSQL Database-Driven Applications\n4.8\nstars\n128 ratings\n•\n29 reviews\n\nThis course introduces you to NoSQL databases and the challenges they solve. Expert instructors will dive deep into Amazon DynamoDB topics such as recovery, SDKs, partition keys, security and encryption, global tables, stateless applications, streams, and best practices.\n\nDynamoDB is a key-value and document database that delivers single-digit millisecond performance at any scale. It's a fully managed, multiregion, multimaster database with built-in security, backup and restore, and in-memory caching for internet-scale applications. DynamoDB can handle more than 10 trillion requests per day and support peaks of more than 20 million requests per second.\n\nThis course uses a combination of video-based lectures delivered by Amazon Web Services expert technical trainers, demonstrations, and hands-on lab exercises, that you run in your own AWS account  to enable you to build, deploy and manage your own DynamoDB-powered application.\n\nSHOW ALL ABOUT AMAZON DYNAMODB: BUILDING NOSQL DATABASE-DRIVEN APPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/aws-improve-java-code-amazon-codeguru?specialization=aws-java-serverless-development",
       "name":"Improve Your Java Code Using Amazon CodeGuru",
       "Rating":"Improve Your Java Code Using Amazon CodeGuru\n\nLearn how to use Amazon CodeGuru Reviewer to automatically identify issues and vulnerabilities to improve your code quality with Improve your Python Code using Amazon CodeGuru. This course is designed for Python developers who are interested in learning how to use CodeGuru Reviewer to save time and improve their code review process.\n\nIn this course, you’ll learn how to use CodeGuru Reviewer to detect issues and identify recommendations to improve the quality and security of your code. The course demonstrates how CodeGuru Reviewer finds code anomalies and explains how to understand and apply its automated suggestions.\n\nDeveloped at the source, this new digital course empowers you to learn about Amazon CodeGuru from the experts at AWS whenever, wherever you want. Advance your skills and knowledge to build your future in the AWS Cloud. Enroll today!\n\nNote: There are two versions of this course: \"Improve Your Java Code Using Amazon CodeGuru\" for Java developers and \"Improve Your Python Code Using Amazon CodeGuru\" for Python developers. The courses do for a large part, overlap and in general, we recommend that you take the course that focuses on the SDK you plan to use to develop your AWS Cloud based applications.\n\nSHOW ALL ABOUT IMPROVE YOUR JAVA CODE USING AMAZON CODEGURU\nSHOW ALL"
    },
    "/specializations/aws-net-serverless-development",
    {
       "Url":"/learn/aws-cloud-technical-essentials?specialization=aws-net-serverless-development",
       "name":"AWS Cloud Technical Essentials",
       "Rating":"AWS Cloud Technical Essentials\n4.8\nstars\n858 ratings\n•\n208 reviews\n\nAre you in a technical role and want to learn the fundamentals of AWS? Do you aspire to have a job or career as a cloud developer, architect, or in an operations role? If so, AWS Cloud Technical Essentials is an ideal way to start. This course was designed for those at the beginning of their cloud-learning journey - no prior knowledge of cloud computing or AWS products and services required!\n\nThroughout the course, students will build highly available, scalable, and cost effective application step-by-step. Upon course completion, you will be able to make an informed decision about when and how to apply core AWS services for compute, storage, and database to different use cases. You’ll also learn about cloud security with a review of AWS' shared responsibility model and an introduction to AWS Identity and Access Management (IAM). And, you’ll know how AWS services can be used to monitor and optimize infrastructure in the cloud.\n\nAWS Cloud Technical Essentials is a fundamental-level course and will build your competence, confidence, and credibility with practical cloud skills that help you innovate and advance your professional future. Enroll in AWS Cloud Technical Essentials and start learning the technical fundamentals of AWS today!\n\nNote: This course was designed for learners with a technical background. If you are new to the cloud or come from a business background, we recommend completing AWS Cloud Practitioner Essentials (https://www.coursera.org/learn/aws-cloud-practitioner-essentials) before enrolling in this course.\n\nSHOW ALL ABOUT AWS CLOUD TECHNICAL ESSENTIALS\nSHOW ALL"
    },
    {
       "Url":"/learn/aws-building-modern-net-applications?specialization=aws-net-serverless-development",
       "name":"Building Modern .NET Applications on AWS",
       "Rating":"Building Modern .NET Applications on AWS\n\nIn modern cloud native application development, it’s oftentimes the goal to build out serverless architectures that are scalable, are highly available, and are fully managed. This means less operational overhead for you and your business, and more focusing on the applications and business specific projects that differentiate you in your marketplace. In this course, we will be covering how to build a modern, greenfield serverless backend on AWS. \n\nBuilding brand new applications on AWS is a different task than lifting and shifting existing applications into AWS. When you have an existing application that you need to move to AWS, you might first look to using Amazon EC2 as your virtual machines, or maybe you might look into using docker containers and container hosting services like Amazon Elastic Container Service or Amazon Elastic Kubernetes Service. Those are all great application hosting options, but in most cases, they still require you to have some kind of pulse on the underlying infrastructure hosting your application. \t`\n\nBuilding Modern .NET Applications on AWS will explore how to build an API driven application using Amazon API Gateway for serverless API hosting, AWS Lambda for serverless computing, and Amazon Cognito for serverless authentication. We will follow an API driven development process and first mock up what the API will look like. We will cover all the ins and outs of the service Amazon API Gateway, and as you’ll learn- it does a lot more than just hosting an API. \n\nThen we will add authentication to the API using Amazon Cognito. You’ll learn about how the authorization flow works with Cognito, and how to build it into your APIs. From there, we will add a Lambda backend that will be triggered by API Gateway. The lambda functions will be using the AWS SDKs to perform various data processing tasks. You’ll learn about the different configurations that exist for Lambda, and we will show you how to create and manage lambda functions. Some of the features of our API will require multiple lambda functions to execute in a specific order, like a workflow, and we will use AWS Step Functions to create a serverless workflow. Finally, we will talk about how to optimize your APIs at every layer using AWS features.\n\nNote: There are four versions of this class, \"Building Modern Node.js Applications on AWS\" for Node.js developers, \"Building Modern Python Applications on AWS\" for Python developers, \"Building Modern Java Applications on AWS\" for Java developers, and this course, \"Building Modern .NET Applications on AWS\" for .NET developers.  The courses do for a large part, overlap and in general, we recommend that you take the course that focuses on the SDK you plan to use to develop your AWS Cloud based applications.\n\nWe expect that you have basic knowledge of AWS already. Some examples of concepts you should be familiar with are: you should know the basics of the AWS Global infrastructure, like what regions and availability zones are. You also should know the at a high-level AWS Identity and Access Management, or IAM, and how it is used to control access to AWS resources. You should also understand what an Amazon EC2 instance is, what Amazon S3 is, what a VPC is, as well as other basic AWS terminology.\n\nSHOW ALL ABOUT BUILDING MODERN .NET APPLICATIONS ON AWS\nSHOW ALL"
    },
    {
       "Url":"/learn/dynamodb-nosql-database-driven-apps?specialization=aws-net-serverless-development",
       "name":"Amazon DynamoDB: Building NoSQL Database-Driven Applications",
       "Rating":"Amazon DynamoDB: Building NoSQL Database-Driven Applications\n4.8\nstars\n128 ratings\n•\n29 reviews\n\nThis course introduces you to NoSQL databases and the challenges they solve. Expert instructors will dive deep into Amazon DynamoDB topics such as recovery, SDKs, partition keys, security and encryption, global tables, stateless applications, streams, and best practices.\n\nDynamoDB is a key-value and document database that delivers single-digit millisecond performance at any scale. It's a fully managed, multiregion, multimaster database with built-in security, backup and restore, and in-memory caching for internet-scale applications. DynamoDB can handle more than 10 trillion requests per day and support peaks of more than 20 million requests per second.\n\nThis course uses a combination of video-based lectures delivered by Amazon Web Services expert technical trainers, demonstrations, and hands-on lab exercises, that you run in your own AWS account  to enable you to build, deploy and manage your own DynamoDB-powered application.\n\nSHOW ALL ABOUT AMAZON DYNAMODB: BUILDING NOSQL DATABASE-DRIVEN APPLICATIONS\nSHOW ALL"
    },
    "/specializations/pwc-analytics",
    {
       "Url":"/learn/decision-making?specialization=pwc-analytics",
       "name":"Data-driven Decision Making",
       "Rating":"Data-driven Decision Making\n4.6\nstars\n5,592 ratings\n•\n1,068 reviews\n\nWelcome to Data-driven Decision Making. In this course, you'll get an introduction to Data Analytics and its role in business decisions. You'll learn why data is important and how it has evolved. You'll be introduced to “Big Data” and how it is used. You'll also be introduced to a framework for conducting Data Analysis and what tools and techniques are commonly used. Finally, you'll have a chance to put your knowledge to work in a simulated business setting.\n\nThis course was created by PricewaterhouseCoopers LLP with an address at 300 Madison Avenue, New York, New York, 10017.\n\nSHOW ALL ABOUT DATA-DRIVEN DECISION MAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/excel-analysis?specialization=pwc-analytics",
       "name":"Problem Solving with Excel",
       "Rating":"Problem Solving with Excel\n4.7\nstars\n4,870 ratings\n•\n883 reviews\n\nThis course explores Excel as a tool for solving business problems. In this course you will learn the basic functions of excel through guided demonstration. Each week you will build on your excel skills and be provided an opportunity to practice what you’ve learned. Finally, you will have a chance to put your knowledge to work in a final project.  Please note, the content in this course was developed using a Windows version of Excel 2013.  \n\nThis course was created by PricewaterhouseCoopers LLP with an address at 300 Madison Avenue, New York, New York, 10017.\n\nSHOW ALL ABOUT PROBLEM SOLVING WITH EXCEL \nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-excel?specialization=pwc-analytics",
       "name":"Data Visualization with Advanced Excel",
       "Rating":"Data Visualization with Advanced Excel\n4.8\nstars\n2,703 ratings\n•\n430 reviews\n\nIn this course, you will get hands-on instruction of advanced Excel 2013 functions.  You’ll learn to use PowerPivot to build databases and data models.  We’ll show you how to perform different types of scenario and simulation analysis and you’ll have an opportunity to practice these skills by leveraging some of Excel's built in tools including, solver, data tables, scenario manager and goal seek.  In the second half of the course, will cover how to visualize data, tell a story and explore data by reviewing core principles of data visualization and dashboarding.  You’ll use Excel to build complex graphs and Power View reports and then start to combine them into dynamic dashboards.\n\nNote: Learners will need PowerPivot to complete some of the exercises. Please use MS Excel 2013 version. If you have other MS Excel versions or a MAC you might not be able to complete all assignments.\n\nThis course was created by PricewaterhouseCoopers LLP with an address at 300 Madison Avenue, New York, New York, 10017.\n\nSHOW ALL ABOUT DATA VISUALIZATION WITH ADVANCED EXCEL\nSHOW ALL"
    },
    {
       "Url":"/learn/powerpoint-presentations?specialization=pwc-analytics",
       "name":"Effective Business Presentations with Powerpoint",
       "Rating":"Effective Business Presentations with Powerpoint\n4.6\nstars\n973 ratings\n•\n169 reviews\n\nThis course is all about presenting the story of the data, using PowerPoint. You'll learn how to structure a presentation, to include insights and supporting data. You'll also learn some design principles for effective visuals and slides. You'll gain skills for client-facing communication - including public speaking, executive presence and compelling storytelling. Finally, you'll be given a client profile, a business problem, and a set of basic Excel charts, which you'll need to turn into a presentation - which you'll deliver with iterative peer feedback.\n\nThis course was created by PricewaterhouseCoopers LLP with an address at 300 Madison Avenue, New York, New York, 10017.\n\nSHOW ALL ABOUT EFFECTIVE BUSINESS PRESENTATIONS WITH POWERPOINT\nSHOW ALL"
    },
    {
       "Url":"/learn/data-analysis-project-pwc?specialization=pwc-analytics",
       "name":"Data Analysis and Presentation Skills: the PwC Approach Final Project",
       "Rating":"Data Analysis and Presentation Skills: the PwC Approach Final Project\n4.8\nstars\n224 ratings\n•\n46 reviews\n\nIn this Capstone Project, you'll bring together all the new skills and insights you've learned through the four courses. You'll be given a 'mock' client problem and a data set. You'll need to analyze the data to gain business insights, research the client's domain area, and create recommendations. You'll then need to visualize the data in a client-facing presentation. You'll bring it all together in a recorded video presentation.\n\nThis course was created by PricewaterhouseCoopers LLP with an address at 300 Madison Avenue, New York, New York, 10017.\n\nSHOW ALL ABOUT DATA ANALYSIS AND PRESENTATION SKILLS: THE PWC APPROACH FINAL PROJECT\nSHOW ALL"
    },
    "/specializations/generative-adversarial-networks-gans",
    {
       "Url":"/learn/build-basic-generative-adversarial-networks-gans?specialization=generative-adversarial-networks-gans",
       "name":"Build Basic Generative Adversarial Networks (GANs)",
       "Rating":"Build Basic Generative Adversarial Networks (GANs)\n4.7\nstars\n1,243 ratings\n•\n304 reviews\n\nIn this course, you will:\n\n- Learn about GANs and their applications\n- Understand the intuition behind the fundamental components of GANs\n- Explore and implement multiple GAN architectures\n- Build conditional GANs capable of generating examples from determined categories\n\nThe DeepLearning.AI Generative Adversarial Networks (GANs) Specialization provides an exciting introduction to image generation with GANs, charting a path from foundational concepts to advanced techniques through an easy-to-understand approach. It also covers social implications, including bias in ML and the ways to detect it, privacy preservation, and more.\n\nBuild a comprehensive knowledge base and gain hands-on experience in GANs. Train your own model using PyTorch, use it to create images, and evaluate a variety of advanced GANs. \n\nThis Specialization provides an accessible pathway for all levels of learners looking to break into the GANs space or apply GANs to their own projects, even without prior familiarity with advanced math and machine learning research.\n\nSHOW ALL ABOUT BUILD BASIC GENERATIVE ADVERSARIAL NETWORKS (GANS)\nSHOW ALL"
    },
    {
       "Url":"/learn/build-better-generative-adversarial-networks-gans?specialization=generative-adversarial-networks-gans",
       "name":"Build Better Generative Adversarial Networks (GANs)",
       "Rating":"Build Better Generative Adversarial Networks (GANs)\n4.7\nstars\n459 ratings\n•\n69 reviews\n\nIn this course, you will:\n\n- Assess the challenges of evaluating GANs and compare different generative models\n- Use the Fréchet Inception Distance (FID) method to evaluate the fidelity and diversity of GANs\n- Identify sources of bias and the ways to detect it in GANs\n- Learn and implement the techniques associated with the state-of-the-art StyleGANs\n\nThe DeepLearning.AI Generative Adversarial Networks (GANs) Specialization provides an exciting introduction to image generation with GANs, charting a path from foundational concepts to advanced techniques through an easy-to-understand approach. It also covers social implications, including bias in ML and the ways to detect it, privacy preservation, and more.\n\nBuild a comprehensive knowledge base and gain hands-on experience in GANs. Train your own model using PyTorch, use it to create images, and evaluate a variety of advanced GANs. \n\nThis Specialization provides an accessible pathway for all levels of learners looking to break into the GANs space or apply GANs to their own projects, even without prior familiarity with advanced math and machine learning research.\n\nSHOW ALL ABOUT BUILD BETTER GENERATIVE ADVERSARIAL NETWORKS (GANS)\nSHOW ALL"
    },
    {
       "Url":"/learn/apply-generative-adversarial-networks-gans?specialization=generative-adversarial-networks-gans",
       "name":"Apply Generative Adversarial Networks (GANs)",
       "Rating":"Apply Generative Adversarial Networks (GANs)\n4.8\nstars\n357 ratings\n•\n74 reviews\n\nIn this course, you will:\n\n- Explore the applications of GANs and examine them wrt data augmentation, privacy, and anonymity\n- Leverage the image-to-image translation framework and identify applications to modalities beyond images\n- Implement Pix2Pix, a paired image-to-image translation GAN, to adapt satellite images into map routes (and vice versa)\n- Compare paired image-to-image translation to unpaired image-to-image translation and identify how their key difference necessitates different GAN architectures\n- Implement CycleGAN, an unpaired image-to-image translation model, to adapt horses to zebras (and vice versa) with two GANs in one\n\nThe DeepLearning.AI Generative Adversarial Networks (GANs) Specialization provides an exciting introduction to image generation with GANs, charting a path from foundational concepts to advanced techniques through an easy-to-understand approach. It also covers social implications, including bias in ML and the ways to detect it, privacy preservation, and more.\n\nBuild a comprehensive knowledge base and gain hands-on experience in GANs. Train your own model using PyTorch, use it to create images, and evaluate a variety of advanced GANs. \n\nThis Specialization provides an accessible pathway for all levels of learners looking to break into the GANs space or apply GANs to their own projects, even without prior familiarity with advanced math and machine learning research.\n\nSHOW ALL ABOUT APPLY GENERATIVE ADVERSARIAL NETWORKS (GANS)\nSHOW ALL"
    },
    "/specializations/tensorflow-advanced-techniques",
    {
       "Url":"/learn/custom-models-layers-loss-functions-with-tensorflow?specialization=tensorflow-advanced-techniques",
       "name":"Custom Models, Layers, and Loss Functions with TensorFlow",
       "Rating":"Custom Models, Layers, and Loss Functions with TensorFlow\n4.9\nstars\n524 ratings\n•\n119 reviews\n\nIn this course, you will:\n\n• Compare Functional and Sequential APIs, discover new models you can build with the Functional API, and build a model that produces multiple outputs including a Siamese network.\n• Build custom loss functions (including the contrastive loss function used in a Siamese network) in order to measure how well a model is doing and help your neural network learn from training data. \n• Build off of existing standard layers to create custom layers for your models, customize a network layer with a lambda layer, understand the differences between them, learn what makes up a custom layer, and explore activation functions. \n• Build off of existing models to add custom functionality, learn how to define your own custom class instead of using the Functional or Sequential APIs, build models that can be inherited from the TensorFlow Model class, and build a residual network (ResNet) through defining a custom model class. \n\n\nThe DeepLearning.AI TensorFlow: Advanced Techniques Specialization introduces the features of TensorFlow that provide learners with more control over their model architecture and tools that help them create and train advanced ML models.  \n\nThis Specialization is for early and mid-career software and machine learning engineers with a foundational understanding of TensorFlow who are looking to expand their knowledge and skill set by learning advanced TensorFlow features to build powerful models.\n\nSHOW ALL ABOUT CUSTOM MODELS, LAYERS, AND LOSS FUNCTIONS WITH TENSORFLOW\nSHOW ALL"
    },
    {
       "Url":"/learn/custom-distributed-training-with-tensorflow?specialization=tensorflow-advanced-techniques",
       "name":"Custom and Distributed Training with TensorFlow",
       "Rating":"Custom and Distributed Training with TensorFlow\n4.8\nstars\n215 ratings\n•\n29 reviews\n\nIn this course, you will:\n\n• Learn about Tensor objects, the fundamental building blocks of TensorFlow, understand the difference between the eager and graph modes in TensorFlow, and learn how to use a TensorFlow tool to calculate gradients.\n• Build your own custom training loops using GradientTape and TensorFlow Datasets to gain more flexibility and visibility with your model training. \n• Learn about the benefits of generating code that runs in graph mode, take a peek at what graph code looks like, and practice generating this more efficient code automatically with TensorFlow’s tools.\n• Harness the power of distributed training to process more data and train larger models, faster, get an overview of various distributed training strategies, and practice working with a strategy that trains on multiple GPU cores, and another that trains on multiple TPU cores.\n\n\nThe DeepLearning.AI TensorFlow: Advanced Techniques Specialization introduces the features of TensorFlow that provide learners with more control over their model architecture and tools that help them create and train advanced ML models.  \n\nThis Specialization is for early and mid-career software and machine learning engineers with a foundational understanding of TensorFlow who are looking to expand their knowledge and skill set by learning advanced TensorFlow features to build powerful models.\n\nSHOW ALL ABOUT CUSTOM AND DISTRIBUTED TRAINING WITH TENSORFLOW\nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-computer-vision-with-tensorflow?specialization=tensorflow-advanced-techniques",
       "name":"Advanced Computer Vision with TensorFlow",
       "Rating":"Advanced Computer Vision with TensorFlow\n4.8\nstars\n239 ratings\n•\n44 reviews\n\nIn this course, you will:\n\na) Explore image classification, image segmentation, object localization, and object detection. Apply transfer learning to object localization and detection.\nb) Apply object detection models such as regional-CNN and ResNet-50, customize existing models, and build your own models to detect, localize, and label your own rubber duck images.\nc) Implement image segmentation using variations of the fully convolutional network (FCN) including U-Net and d) Mask-RCNN to identify and detect numbers, pets, zombies, and more.\nd) Identify which parts of an image are being used by your model to make its predictions using class activation maps and saliency maps and apply these ML interpretation methods to inspect and improve the design of a famous network, AlexNet.\n\n\nThe DeepLearning.AI TensorFlow: Advanced Techniques Specialization introduces the features of TensorFlow that provide learners with more control over their model architecture and tools that help them create and train advanced ML models.  \n\nThis Specialization is for early and mid-career software and machine learning engineers with a foundational understanding of TensorFlow who are looking to expand their knowledge and skill set by learning advanced TensorFlow features to build powerful models.\n\nSHOW ALL ABOUT ADVANCED COMPUTER VISION WITH TENSORFLOW\nSHOW ALL"
    },
    {
       "Url":"/learn/generative-deep-learning-with-tensorflow?specialization=tensorflow-advanced-techniques",
       "name":"Generative Deep Learning with TensorFlow",
       "Rating":"Generative Deep Learning with TensorFlow\n4.9\nstars\n124 ratings\n•\n18 reviews\n\nIn this course, you will: \n\na) Learn neural style transfer using transfer learning: extract the content of an image (eg. swan), and the style of a painting (eg. cubist or impressionist), and combine the content and style into a new image. \nb) Build simple AutoEncoders on the familiar MNIST dataset, and more complex deep and convolutional architectures on the Fashion MNIST dataset, understand the difference in results of the DNN and CNN AutoEncoder models, identify ways to de-noise noisy images, and build a CNN AutoEncoder using TensorFlow to output a clean image from a noisy one.\nc) Explore Variational AutoEncoders (VAEs) to generate entirely new data, and generate anime faces to compare them against reference images. \nd) Learn about GANs; their invention, properties, architecture, and how they vary from VAEs, understand the function of the generator and the discriminator within the model, the concept of 2 training phases and the role of introduced noise, and build your own GAN that can generate faces.\n\nThe DeepLearning.AI TensorFlow: Advanced Techniques Specialization introduces the features of TensorFlow that provide learners with more control over their model architecture, and gives them the tools to create and train advanced ML models.  \n\nThis Specialization is for early and mid-career software and machine learning engineers with a foundational understanding of TensorFlow who are looking to expand their knowledge and skill set by learning advanced TensorFlow features to build powerful models.\n\nSHOW ALL ABOUT GENERATIVE DEEP LEARNING WITH TENSORFLOW\nSHOW ALL"
    },
    "/specializations/business-strategy",
    {
       "Url":"/learn/uva-darden-foundations-business-strategy?specialization=business-strategy",
       "name":"Foundations of Business Strategy",
       "Rating":"Foundations of Business Strategy\n4.8\nstars\n2,486 ratings\n•\n544 reviews\n\nDevelop your ability to think strategically, analyze the competitive environment, and recommend firm positioning and value creation. In this course, developed at the Darden School of Business at the University of Virginia, top-ranked faculty will help you explore the underlying theory and frameworks that provide the foundations of a successful business strategy and provide the tools you need to understand that strategy: SWOT, Competitor, Environmental, Five Forces, and Capabilities Analyses, as well as Strategy Maps.\n\nSHOW ALL ABOUT FOUNDATIONS OF BUSINESS STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-advanced-business-strategy?specialization=business-strategy",
       "name":"Advanced Business Strategy",
       "Rating":"Advanced Business Strategy\n4.8\nstars\n956 ratings\n•\n177 reviews\n\nAdvance your strategic analysis skills in this follow-up to Foundations of Business Strategy. In this course, developed at the Darden School of Business at the University of Virginia, you'll learn the tools to analyze strategy across time (competitive dynamics), industries (corporate strategy), geographies (international strategy), and institutions (non-market strategy). Top-ranked faculty will introduce the tools you need to complete a comprehensive evaluation and understand the strategy dynamics of an industry: Competitive Lifecycle, Internationalization and Stakeholder Analyses, and Diversification Matrices.\n\nSHOW ALL ABOUT ADVANCED BUSINESS STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-business-growth-strategy?specialization=business-strategy",
       "name":"Business Growth Strategy",
       "Rating":"Business Growth Strategy\n4.7\nstars\n562 ratings\n•\n112 reviews\n\nGet the tools you need to analyze, evaluate and recommend specific actions organizations can take to grow their value and avoid common growth pitfalls. In this course, developed at the Darden School of Business at the University of Virginia and taught by top-ranked faculty, you will learn to determine how best to build value, whether by scaling existing markets, entering established markets or creating new markets through innovation and acquisitions.\n\nSHOW ALL ABOUT BUSINESS GROWTH STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-strategic-planning-execution?specialization=business-strategy",
       "name":"Strategic Planning and Execution",
       "Rating":"Strategic Planning and Execution\n4.7\nstars\n492 ratings\n•\n112 reviews\n\nAvoid the pitfalls of strategy planning and execution with the tools and skills from this course. In this course, developed at the Darden School of Business at the University of Virginia and taught by top-ranked faculty, you'll learn the pillars of strategy execution--analysis, formulation, and implementation--and how to use the 4A model to effectively approach strategy execution. Finally, a panel of leaders from entrepreneurs, nonprofits, and industry, share their expertise gleaned from years of successful strategy planning and execution.\n\nSHOW ALL ABOUT STRATEGIC PLANNING AND EXECUTION\nSHOW ALL"
    },
    {
       "Url":"/learn/uva-darden-business-strategy-capstone?specialization=business-strategy",
       "name":"Business Strategy in Practice (Project-centered Course)",
       "Rating":"Business Strategy in Practice (Project-centered Course)\n4.6\nstars\n153 ratings\n•\n46 reviews\n\nA Capstone Project is an assignment designed specifically to apply and showcase the skills you learned in the Specialization. To this end, the Business Strategy Capstone Project, a comprehensive Strategic Analysis, provides an opportunity for you to synthesize concepts and knowledge from the four prerequisite courses in the specialization. In this course, developed at the Darden School of Business at the University of Virginia, you will be guided through your project by top-ranked faculty. You may continue with the organization you selected for previous assignments or select a new organization for this project. You will analyze the current state of the organization, strategic issues facing the organization, strategic paths the organization might pursue, make a recommendation of the best path for the organization to pursue, and write an Executive Summary. Your finished project will serve as an artifact showcasing your ability to conduct research on/within an organization, select and apply the most appropriate analytical tools, build a well-supported case for a specific position, and effectively communicate key points with executive leadership.\n\nSHOW ALL ABOUT BUSINESS STRATEGY IN PRACTICE (PROJECT-CENTERED COURSE)\nSHOW ALL"
    },
    "/specializations/social-science",
    {
       "Url":"/learn/quantitative-methods?specialization=social-science",
       "name":"Quantitative Methods",
       "Rating":"Quantitative Methods\n4.7\nstars\n1,899 ratings\n•\n671 reviews\n\nDiscover the principles of solid scientific methods in the behavioral and social sciences. Join us and learn to separate sloppy science from solid research!\n\nThis course will cover the fundamental principles of science, some history and philosophy of science, research designs, measurement, sampling and ethics. The course is comparable to a university level introductory course on quantitative research methods in the social sciences, but has a strong focus on research integrity. We will use examples from sociology, political sciences, educational sciences, communication sciences and psychology.\n\nSHOW ALL ABOUT QUANTITATIVE METHODS\nSHOW ALL"
    },
    {
       "Url":"/learn/qualitative-methods?specialization=social-science",
       "name":"Qualitative Research Methods",
       "Rating":"Qualitative Research Methods\n4.6\nstars\n1,076 ratings\n•\n375 reviews\n\nIn this course you will be introduced to the basic ideas behind the qualitative research in social science. You will learn about data collection, description, analysis and interpretation in qualitative research. Qualitative research often involves an iterative process. We will focus on the ingredients required for this process: data collection and analysis.\n\nYou won't learn how to use qualitative methods by just watching video's, so we put much stress on collecting data through observation and interviewing and on analysing and interpreting the collected data in other assignments.\nObviously, the most important concepts in qualitative research will be discussed, just as we will discuss quality criteria, good practices, ethics, writing some methods of analysis, and mixing methods.\nWe hope to take away some prejudice, and enthuse many students for qualitative research.\n\nSHOW ALL ABOUT QUALITATIVE RESEARCH METHODS\nSHOW ALL"
    },
    {
       "Url":"/learn/basic-statistics?specialization=social-science",
       "name":"Basic Statistics",
       "Rating":"Basic Statistics\n4.6\nstars\n3,912 ratings\n•\n984 reviews\n\nUnderstanding statistics is essential to understand research in the social and behavioral sciences. In this course you will learn the basics of statistics; not just how to calculate them, but also how to evaluate them. This course will also prepare you for the next course in the specialization - the course Inferential Statistics. \n\nIn the first part of the course we will discuss methods of descriptive statistics. You will learn what cases and variables are and how you can compute measures of central tendency (mean, median and mode) and dispersion (standard deviation and variance). Next, we discuss how to assess relationships between variables, and we introduce the concepts correlation and regression. \n\nThe second part of the course is concerned with the basics of probability: calculating probabilities, probability distributions and sampling distributions. You need to know about these things in order to understand how inferential statistics work. \n\nThe third part of the course consists of an introduction to methods of inferential statistics - methods that help us decide whether the patterns we see in our data are strong enough to draw conclusions about the underlying population we are interested in. We will discuss confidence intervals and significance tests.\n\nYou will not only learn about all these statistical concepts, you will also be trained to calculate and generate these statistics yourself using freely available statistical software.\n\nSHOW ALL ABOUT BASIC STATISTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/inferential-statistics?specialization=social-science",
       "name":"Inferential Statistics",
       "Rating":"Inferential Statistics\n4.3\nstars\n513 ratings\n•\n148 reviews\n\nInferential statistics are concerned with making inferences based on relations found in the sample, to relations in the population. Inferential statistics help us decide, for example, whether the differences between groups that we see in our data are strong enough to provide support for our hypothesis that group differences exist in general, in the entire population.\n\nWe will start by considering the basic principles of significance testing: the sampling and test statistic distribution, p-value, significance level, power and type I and type II errors. Then we will consider a large number of statistical tests and techniques that help us make inferences for different types of data and different types of research designs. For each individual statistical test we will consider how it works, for what data and design it is appropriate and how results should be interpreted. You will also learn how to perform these tests using freely available software. \n\nFor those who are already familiar with statistical testing: We will look at z-tests for 1 and 2 proportions,  McNemar's test for dependent proportions, t-tests for 1 mean (paired differences) and 2 means, the Chi-square test for independence, Fisher’s exact test, simple regression (linear and exponential) and multiple regression (linear and logistic), one way and factorial analysis of variance, and non-parametric tests (Wilcoxon, Kruskal-Wallis, sign test,  signed-rank test, runs test).\n\nSHOW ALL ABOUT INFERENTIAL STATISTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/social-science-capstone?specialization=social-science",
       "name":"Methods and Statistics in Social Science - Final Research Project",
       "Rating":"Methods and Statistics in Social Science - Final Research Project\n4.3\nstars\n38 ratings\n•\n12 reviews\n\nThe Final Research Project consists of a research study that you will perform in collaboration with fellow learners. Together you will formulate a research hypothesis and design, come up with operationalizations, create manipulation and measurement instruments, collect data, perform statistical analyses and document the results. \n\nIn this course you will go through the entire research process and will be able to help determine what research question we will investigate and how we design and perform the research. This is an invaluable experience if you want to be able to critically evaluate scientific research in the social and behavioral sciences or design and perform your own studies in the future.\n\nSHOW ALL ABOUT METHODS AND STATISTICS IN SOCIAL SCIENCE - FINAL RESEARCH PROJECT\nSHOW ALL"
    },
    "/specializations/security-analyst-fundamentals",
    {
       "Url":"/learn/ibm-penetration-testing-incident-response-forensics?specialization=security-analyst-fundamentals",
       "name":"Penetration Testing, Incident Response and Forensics",
       "Rating":"Penetration Testing, Incident Response and Forensics\n4.6\nstars\n852 ratings\n•\n207 reviews\n\nThis course gives you the background needed to gain Cybersecurity skills as part of the Cybersecurity Security Analyst Professional Certificate program. \n\nYou will learn about the different phases of penetration testing, how to gather data for your penetration test and popular penetration testing tools.  Furthermore, you will learn the phases of an incident response, important documentation to collect, and the components of an incident response policy and team.  Finally, you will learn key steps in the forensic process and important data to collect.  \n\nThis course also gives you a first look at scripting and the importance to a system analyst.\n\nThis course is intended for anyone who wants to gain a basic understanding of Cybersecurity or as the fifth course in a series of courses to acquire the skills to work in the Cybersecurity field as a Cybersecurity Analyst.\n\nThe completion of this course also makes you eligible to earn the Penetration Testing, Incident Response and Forensics IBM digital badge.  More information about the badge can be found https://www.youracclaim.com/org/ibm/badge/penetration-testing-incident-response-and-forensics.\n\n\nIn this course you will learn to:\n•\tDescribe penetration testing tools and the benefits to an organization\n•\tDescribe a deep dive into incident response techniques and tools\n•\tDescribe digital forensics and digital evidence.\n•\tDiscuss the power of scripting.\n\nSHOW ALL ABOUT PENETRATION TESTING, INCIDENT RESPONSE AND FORENSICS\nSHOW ALL"
    },
    {
       "Url":"/learn/ibm-cyber-threat-intelligence?specialization=security-analyst-fundamentals",
       "name":"Cyber Threat Intelligence",
       "Rating":"Cyber Threat Intelligence\n4.7\nstars\n545 ratings\n•\n116 reviews\n\nThis course gives you the background needed to gain Cybersecurity skills as part of the Cybersecurity Security Analyst Professional Certificate program. \n\nYou will understand network defensive tactics, define network access control and use network monitoring tools. You will understand data protection risks and explore mobile endpoint protection. Finally you will recognize various scanning technologies, application security vulnerabilities and threat intelligence platforms.\n\nThis course also gives you hands on access to cybersecurity tools important to a system analyst.\n\nThis course is intended for anyone who wants to gain a basic understanding of Cybersecurity or as the sixth course in a series of courses to acquire the skills to work in the Cybersecurity field as a Cybersecurity Analyst.\n\nThe completion of this course also makes you eligible to earn the Cyber Threat Intelligence IBM digital badge.  More information about the badge can be found https://www.youracclaim.com/org/ibm/badge/cyber-threat-intelligence.\n\nIn this course, you will learn to:\n\n•\tDescribe examples of network defensive tactics.\n•\tDiscuss data loss prevention and endpoint protection concepts and tools. \n•\tExplore a data loss prevention tool and learn how to classify data in your database environment. \n•\tDescribe security vulnerability scanning technologies and tools.\n•\tRecognize application security threats and common vulnerabilities.\n•\tIdentify the key concepts around threat intelligence.\n•\tExplore a SIEM product and review suspicious alerts and how to take action.\n\nSHOW ALL ABOUT CYBER THREAT INTELLIGENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/ibm-cybersecurity-breach-case-studies?specialization=security-analyst-fundamentals",
       "name":"Cybersecurity Capstone: Breach Response Case Studies",
       "Rating":"Cybersecurity Capstone: Breach Response Case Studies\n4.8\nstars\n354 ratings\n•\n65 reviews\n\nThis course gives you the background needed to gain Cybersecurity skills as part of the Cybersecurity Security Analyst Professional Certificate program. \n\nYou will explore incident response methodologies and security models.  You will learn to recognize and categorize key types of vulnerabilities and associated attacks against today's organizations.  You will explore in depth several past and recent breaches to learn how they were detected and what was done or could have been done to reduce the threat risk to the organization.\nFinally, you will explore the costs of data breaches through research studies and well known breaches.\n\nThis course requires you to select and research a cybersecurity breach in the news today and apply your knowledge and skills from this course and previous cybersecurity courses to analyze the type of attack, attack timeline, vulnerable systems, and any missed opportunities.  This project will be graded by your peers in the course.\n\nThis course is intended for anyone who wants to gain a basic understanding of Cybersecurity or as the seventh and final course in a series of courses to acquire the skills to work in the Cybersecurity field as a Cybersecurity Analyst.\n\nThe completion of this course also makes you eligible to earn the Cybersecurity Capstone:  Breach Response Case Studies IBM digital badge.  More information about the badge can be found https://www.youracclaim.com/org/ibm/badge/cybersecurity-breach-case-studies .\n\nIn this course, you will learn to:\n\n●\tApply incident response methodologies.\n●\tResearch and describe a watering hole attack.\n●\tResearch and describe ransomware threats and the consequences to organization.\n●\tResearch and describe 3rd party breaches and how they affect an organization.\n●\tResearch and describe the effects of a phishing attack.\n●\tResearch and describe a point of sale attack and approximate cost of data breaches.\n●\tPerform a case study on a current cyber attack and breach.\n\nSHOW ALL ABOUT CYBERSECURITY CAPSTONE:  BREACH RESPONSE CASE STUDIES\nSHOW ALL"
    },
    "/specializations/reinforcement-learning",
    {
       "Url":"/learn/fundamentals-of-reinforcement-learning?specialization=reinforcement-learning",
       "name":"Fundamentals of Reinforcement Learning",
       "Rating":"Fundamentals of Reinforcement Learning\n4.8\nstars\n2,092 ratings\n•\n521 reviews\n\nReinforcement Learning is a subfield of Machine Learning, but is also a general purpose formalism for automated decision-making and AI. This course introduces you to statistical learning techniques where an agent explicitly takes actions and interacts with the world. Understanding the importance and challenges of learning agents that make decisions is of vital importance today, with more and more companies interested in interactive agents and intelligent decision-making. \n\nThis course introduces you to the fundamentals of Reinforcement Learning. When you finish this course, you will:\n- Formalize problems as Markov Decision Processes \n- Understand basic exploration methods and the exploration/exploitation tradeoff\n- Understand value functions, as a general-purpose tool for optimal decision-making\n- Know how to implement dynamic programming as an efficient solution approach to an industrial control problem\n\nThis course teaches you the key concepts of Reinforcement Learning, underlying classic and modern algorithms in RL. After completing this course, you will be able to start using RL for real problems, where you have or can specify the MDP. \n\nThis is the first course of the Reinforcement Learning Specialization.\n\nSHOW ALL ABOUT FUNDAMENTALS OF REINFORCEMENT LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/sample-based-learning-methods?specialization=reinforcement-learning",
       "name":"Sample-based Learning Methods",
       "Rating":"Sample-based Learning Methods\n4.7\nstars\n984 ratings\n•\n202 reviews\n\nIn this course, you will learn about several algorithms that can learn near optimal policies based on trial and error interaction with the environment---learning from the agent’s own experience. Learning from actual experience is striking because it requires no prior knowledge of the environment’s dynamics, yet can still attain optimal behavior. We will cover intuitively simple but powerful Monte Carlo methods, and temporal difference learning methods including Q-learning. We will wrap up this course investigating how we can get the best of both worlds: algorithms that can combine model-based planning (similar to dynamic programming) and temporal difference updates to radically accelerate learning.\n\nBy the end of this course you will be able to:\n \n- Understand Temporal-Difference learning and Monte Carlo as two strategies for estimating value functions from sampled experience\n- Understand the importance of exploration, when using sampled experience rather than dynamic programming sweeps within a model\n- Understand the connections between Monte Carlo and Dynamic Programming and TD. \n- Implement and apply the TD algorithm, for estimating value functions\n- Implement and apply Expected Sarsa and Q-learning (two TD methods for control) \n- Understand the difference between on-policy and off-policy control\n- Understand planning with simulated experience (as opposed to classic planning strategies)\n- Implement a model-based approach to RL, called Dyna, which uses simulated experience \n- Conduct an empirical study to see the improvements in sample efficiency when using Dyna\n\nSHOW ALL ABOUT SAMPLE-BASED LEARNING METHODS\nSHOW ALL"
    },
    {
       "Url":"/learn/prediction-control-function-approximation?specialization=reinforcement-learning",
       "name":"Prediction and Control with Function Approximation",
       "Rating":"Prediction and Control with Function Approximation\n4.8\nstars\n670 ratings\n•\n123 reviews\n\nIn this course, you will learn how to solve problems with large, high-dimensional, and potentially infinite state spaces. You will see that estimating value functions can be cast as a supervised learning problem---function approximation---allowing you to build agents that carefully balance generalization and discrimination in order to maximize reward. We will begin this journey by investigating how our policy evaluation or prediction methods like Monte Carlo and TD can be extended to the function approximation setting. You will learn about feature construction techniques for RL, and representation learning via neural networks and backprop. We conclude this course with a deep-dive into policy gradient methods; a way to learn policies directly without learning a value function. In this course you will solve two continuous-state control tasks and investigate the benefits of policy gradient methods in a continuous-action environment. \n\nPrerequisites: This course strongly builds on the fundamentals of Courses 1 and 2, and learners should have completed these before starting this course.  Learners should also be comfortable with probabilities & expectations, basic linear algebra, basic calculus, Python 3.0 (at least 1 year), and  implementing algorithms from pseudocode.\n\nBy the end of this course, you will be able to: \n\n-Understand how to use supervised learning approaches to approximate value functions\n-Understand objectives for prediction (value estimation) under function approximation\n-Implement TD with function approximation (state aggregation), on an environment with an infinite state space (continuous state space)\n-Understand fixed basis and neural network approaches to feature construction \n-Implement TD with neural network function approximation in a continuous state environment\n-Understand new difficulties in exploration when moving to function approximation\n-Contrast discounted problem formulations for control versus an average reward problem formulation\n-Implement expected Sarsa and Q-learning with function approximation on a continuous state control task\n-Understand objectives for directly estimating policies (policy gradient objectives)\n-Implement a policy gradient method (called Actor-Critic) on a discrete state environment\n\nSHOW ALL ABOUT PREDICTION AND CONTROL WITH FUNCTION APPROXIMATION\nSHOW ALL"
    },
    {
       "Url":"/learn/complete-reinforcement-learning-system?specialization=reinforcement-learning",
       "name":"A Complete Reinforcement Learning System (Capstone)",
       "Rating":"A Complete Reinforcement Learning System (Capstone)\n4.7\nstars\n511 ratings\n•\n109 reviews\n\nIn this final course, you will put together your knowledge from Courses 1, 2 and 3 to implement a complete RL solution to a problem. This capstone will let you see how each component---problem formulation, algorithm selection, parameter selection and representation design---fits together into a complete solution, and how to make appropriate choices when deploying RL in the real world. This project will require you to implement both the environment to stimulate your problem, and a control agent with Neural Network function approximation. In addition, you will conduct a scientific study of your learning system to develop your ability to assess the robustness of RL agents. To use RL in the real world, it is critical to (a) appropriately formalize the problem as an MDP, (b) select appropriate algorithms, (c ) identify what choices in your implementation will have large impacts on performance and (d) validate the expected behaviour of your algorithms. This capstone is valuable for anyone who is planning on using RL to solve real problems.\n\nTo be successful in this course, you will need to have completed Courses 1, 2, and 3 of this Specialization or the equivalent.\n\nBy the end of this course, you will be able to: \n\nComplete an RL solution to a problem, starting from problem formulation, appropriate algorithm selection and implementation and empirical study into the effectiveness of the solution.\n\nSHOW ALL ABOUT A COMPLETE REINFORCEMENT LEARNING SYSTEM (CAPSTONE)\nSHOW ALL"
    },
    "/specializations/blockchain-revolution-enterprise",
    {
       "Url":"/learn/introduction-blockchain-technologies?specialization=blockchain-revolution-enterprise",
       "name":"Introduction to Blockchain Technologies",
       "Rating":"Introduction to Blockchain Technologies\n4.7\nstars\n1,762 ratings\n•\n419 reviews\n\nIn this first course of the specialization, we will discuss the limitations of the Internet for business and economic activity, and explain how blockchain technology represents the way forward. After completing this course, you will be able to explain what blockchain is, how it works, and why it is revolutionary. You will learn key concepts such as mining, hashing, proof-of-work, public key cryptography, and the double-spend problem. You’ll be able to describe seven design principles for blockchain technology, and the challenges facing the people developing it. You’ll also meet the players in the blockchain ecosystem, and consider your own role in stewarding the blockchain revolution.\n\nSHOW ALL ABOUT INTRODUCTION TO BLOCKCHAIN TECHNOLOGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/transacting-blockchain?specialization=blockchain-revolution-enterprise",
       "name":"Transacting on the Blockchain",
       "Rating":"Transacting on the Blockchain\n4.8\nstars\n747 ratings\n•\n132 reviews\n\nToday, large intermediaries establish trust in our economy and control the movement, storage, and allocation of money and assets. The status quo, however, is rife with inefficiencies. In this course, we’ll address the many challenges of the status quo and discuss how cryptoassets, smart contracts, new identity systems, and new financial business models can help overcome them. You’ll learn how blockchain technology empowers individuals, entrepreneurs, and businesses with the tools they need to help level the playing field and to participate in the value they create. By the end of this course, you’ll learn how and why transacting on the blockchain can help us bring about a future that is faster, fairer, and more distributed than the world we inhabit today.\n\nSHOW ALL ABOUT TRANSACTING ON THE BLOCKCHAIN\nSHOW ALL"
    },
    {
       "Url":"/learn/blockchain-business?specialization=blockchain-revolution-enterprise",
       "name":"Blockchain and Business: Applications and Implications",
       "Rating":"Blockchain and Business: Applications and Implications\n4.7\nstars\n332 ratings\n•\n63 reviews\n\nBlockchain will bring about profound changes to business, and even to the nature of business itself.  This technology will disrupt how enterprises are funded and managed, how they create value, and even how they perform basic functions like marketing and accounting.  In this course you will learn how blockchain technology will penetrate into the structures of organizations. You will explore how blockchain will transform the roles of the C-Suite, and how a blockchain can be used to manage and protect intellectual property.  You will be able to identify the different layers of the blockchain technology stack, and explain how these affect the governance of blockchain systems.  As well, you will be able to identify seven qualities that a region in the world needs in order to attract technology startups and to build a vibrant blockchain ecosystem.\n\nSHOW ALL ABOUT BLOCKCHAIN AND BUSINESS: APPLICATIONS AND IMPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/blockchain-opportunity-analysis?specialization=blockchain-revolution-enterprise",
       "name":"Blockchain Opportunity Analysis",
       "Rating":"Blockchain Opportunity Analysis\n4.6\nstars\n156 ratings\n•\n34 reviews\n\nIn this fourth and final course of the specialization, you will synthesize your learning into a project deliverable called a Blockchain Opportunity Analysis.  The goals of this course are twofold: One, it’s for you to identify a specific need or problem in your chosen industry that can potentially be solved using blockchain technology. Two, it’s for you to investigate possible solutions to this problem, including how these solutions might be executed. You will accomplish different project milestones each week, and will be introduced to several tools that entrepreneurs use to organize their findings. Throughout this process, you will hear from real-world practitioners who have hands-on experience in the blockchain ecosystem.  Additionally, by participating in this course you will gain access to our Blockchain Case Commons—a crowdsourced collection of blockchain applications and use-cases spanning multiple industries.  As an outcome of this course, you’ll walk away with a consolidated, peer-reviewed Blockchain Opportunity Analysis, which you can use to pitch your idea to your organization or even to potential investors.\n\nSHOW ALL ABOUT BLOCKCHAIN OPPORTUNITY ANALYSIS\nSHOW ALL"
    },
    "/specializations/ai-foundations-for-everyone",
    {
       "Url":"/learn/introduction-to-ai?specialization=ai-foundations-for-everyone",
       "name":"Introduction to Artificial Intelligence (AI)",
       "Rating":"Introduction to Artificial Intelligence (AI)\n4.7\nstars\n7,964 ratings\n•\n1,759 reviews\n\nIn this course you will learn what Artificial Intelligence (AI) is, explore use cases and applications of AI, understand AI concepts and terms like machine learning, deep learning and neural networks. You will be exposed to various issues and concerns surrounding AI such as ethics and bias, & jobs, and get advice from experts about learning and starting a career in AI.  You will also demonstrate AI in action with a mini project.\n\nThis course does not require any programming or computer science expertise and is designed to introduce the basics of AI to anyone whether you have a technical background or not.\n\nSHOW ALL ABOUT INTRODUCTION TO ARTIFICIAL INTELLIGENCE (AI)\nSHOW ALL"
    },
    {
       "Url":"/learn/ai-with-ibm-watson?specialization=ai-foundations-for-everyone",
       "name":"Getting Started with AI using IBM Watson",
       "Rating":"Getting Started with AI using IBM Watson\n4.5\nstars\n2,193 ratings\n•\n428 reviews\n\nIn this course you will learn how to quickly and easily get started with Artificial Intelligence using IBM Watson. You will understand how Watson works, become familiar with its use cases and real life client examples, and be introduced to several of Watson AI services from IBM that enable anyone to easily apply AI and build smart apps. You will also work with several Watson services to demonstrate AI in action.\n\nThis course does not require any programming or computer science expertise and is designed for anyone whether you have a technical background or not.\n\nSHOW ALL ABOUT GETTING STARTED WITH AI USING IBM WATSON\nSHOW ALL"
    },
    {
       "Url":"/learn/building-ai-powered-chatbots?specialization=ai-foundations-for-everyone",
       "name":"Building AI Powered Chatbots Without Programming",
       "Rating":"Building AI Powered Chatbots Without Programming\n4.8\nstars\n1,983 ratings\n•\n449 reviews\n\nThis course will teach you how to create useful chatbots without the need to write any code.\n\nLeveraging IBM Watson's Natural Language Processing capabilities, you'll learn how to plan, implement, test, and deploy chatbots that delight your users, rather than frustrate them.\n\nTrue to our promise of not requiring any code, you'll learn how to visually create chatbots with Watson Assistant (formerly Watson Conversation) and how to deploy them on your own website through a handy WordPress plugin. Don't have a website? No worries, one will be provided to you.\n\nChatbots are a hot topic in our industry and are about to go big. New jobs requiring this specific skill are being added every day, consultants demand premium rates, and the interest in chatbots is quickly exploding.\n\nGartner predicts that by 2020, 85% of customer interactions with the enterprise will be through automated means (that's chatbots and related technologies).\n\nHere is your chance to learn this highly in demand set of skills with a gentle introduction to the topic that leaves no stone unturned.\n\nSHOW ALL ABOUT BUILDING AI POWERED CHATBOTS WITHOUT PROGRAMMING\nSHOW ALL"
    },
    "/specializations/cs-fundamentals",
    {
       "Url":"/learn/cs-fundamentals-1?specialization=cs-fundamentals",
       "name":"Object-Oriented Data Structures in C++",
       "Rating":"Object-Oriented Data Structures in C++\n4.7\nstars\n2,131 ratings\n•\n551 reviews\n\nThis course teaches learners how to write a program in the C++ language, including how to set up a development environment for writing and debugging C++ code and how to implement data structures as C++ classes. It is the first course in the Accelerated CS Fundamentals specialization, and subsequent courses in this specialization will be using C++ as the language for implementing the data structures covered in class.\n\nSHOW ALL ABOUT OBJECT-ORIENTED DATA STRUCTURES IN C++\nSHOW ALL"
    },
    {
       "Url":"/learn/cs-fundamentals-2?specialization=cs-fundamentals",
       "name":"Ordered Data Structures",
       "Rating":"Ordered Data Structures\n4.8\nstars\n656 ratings\n•\n127 reviews\n\nIn this course, you will learn new data structures for efficiently storing and retrieving data that is structured in an ordered sequence. Such data includes an alphabetical list of names, a family tree, a calendar of events or an inventory organized by part numbers. The specific data structures covered by this course include arrays, linked lists, queues, stacks, trees, binary trees, AVL trees, B-trees and heaps. This course also shows, through algorithm complexity analysis, how these structures enable the fastest algorithms to search and sort data.\n\nSHOW ALL ABOUT ORDERED DATA STRUCTURES\nSHOW ALL"
    },
    {
       "Url":"/learn/cs-fundamentals-3?specialization=cs-fundamentals",
       "name":"Unordered Data Structures",
       "Rating":"Unordered Data Structures\n4.7\nstars\n427 ratings\n•\n89 reviews\n\nThe Unordered Data Structures course covers the data structures and algorithms needed to implement hash tables, disjoint sets and graphs. These fundamental data structures are useful for unordered data. For example, a hash table provides immediate access to data indexed by an arbitrary key value, that could be a number (such as a memory address for cached memory), a URL (such as for a web cache) or a dictionary. Graphs are used to represent relationships between items, and this course covers several different data structures for representing graphs and several different algorithms for traversing graphs, including finding the shortest route from one node to another node. These graph algorithms will also depend on another concept called disjoint sets, so this course will also cover its data structure and associated algorithms.\n\nSHOW ALL ABOUT UNORDERED DATA STRUCTURES\nSHOW ALL"
    },
    "/specializations/tesol",
    {
       "Url":"/learn/english-principles?specialization=tesol",
       "name":"Teach English Now! Foundational Principles",
       "Rating":"Teach English Now! Foundational Principles\n4.9\nstars\n10,257 ratings\n•\n3,683 reviews\n\nThrough a series of engaging metaphors and stories, prospective and current EFL/ESL teachers will identify, summarize, and evaluate 7 basic language learning paradigms.  Learners will be presented information on such foundational principles as motivation, risk taking, two different modes of learning, and balancing the teacher profession.  Learners are also given an understanding of basic techniques founded on those principles, such as teacher talk, looking “ridiculous” in order to lower the affective filter, and networking.   With these foundational principles in mind, ESL/EFL teachers will scrutinize common assumptions about language learning by comparing how they stack up to research-based core principles.\n\nSHOW ALL ABOUT TEACH ENGLISH NOW! FOUNDATIONAL PRINCIPLES\nSHOW ALL"
    },
    {
       "Url":"/learn/language-theories?specialization=tesol",
       "name":"Teach English Now! Theories of Second Language Acquisition",
       "Rating":"Teach English Now! Theories of Second Language Acquisition\n4.9\nstars\n5,414 ratings\n•\n1,645 reviews\n\nIn this course learners are introduced to second or foreign language theories and practices for teaching and assessing listening, speaking, and pronunciation.  Learners will also be introduced to basic studies in second language acquisition and their pedagogical implications.  Teachers will be invited to recognize the importance of grounding their own teaching philosophy through an examination of purpose, content, and technique.\n\nSHOW ALL ABOUT TEACH ENGLISH NOW! THEORIES OF SECOND LANGUAGE ACQUISITION\nSHOW ALL"
    },
    {
       "Url":"/learn/lesson-design?specialization=tesol",
       "name":"Teach English Now! Lesson Design and Assessment",
       "Rating":"Teach English Now! Lesson Design and Assessment\n4.9\nstars\n3,629 ratings\n•\n946 reviews\n\nLearners will be introduced to designing lesson plans based on principles and knowledge of learning objectives, assessment plans, methods, materials, and learning activities. Learners will find and prepare appropriate teaching materials through careful analysis, adaptation and creation of professional resources. Learners will also reflect on the cohesion between lesson design and teaching philosophies.\n\nSHOW ALL ABOUT TEACH ENGLISH NOW! LESSON DESIGN AND ASSESSMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/teaching-english-capstone?specialization=tesol",
       "name":"Teach English Now! Capstone Project 1",
       "Rating":"Teach English Now! Capstone Project 1\n4.9\nstars\n1,702 ratings\n•\n522 reviews\n\nIn the final Capstone Project, you will apply the skills you learned by observing teachers at work (a total of six hours of observation).  You will build on the concepts learned from the previous courses to analyze the lessons.  You will also submit your teaching philosophy, a five-day lesson plan, and a teaching tip. You will deliver a portion of your lesson, submitting a 6-10 minute video for peer review.  If you have completed Teach English Now! Part 1 and Teach English Now! Part 2, you will submit your work for expert review to receive your ASU 150-hour TESOL Certificate from ASU, in addition to your Coursera certificates.\n\nSHOW ALL ABOUT TEACH ENGLISH NOW! CAPSTONE PROJECT 1\nSHOW ALL"
    },
    "/specializations/career-success",
    {
       "Url":"/learn/project-management-basics?specialization=career-success",
       "name":"Project Management: The Basics for Success",
       "Rating":"Project Management: The Basics for Success\n4.6\nstars\n9,912 ratings\n•\n1,941 reviews\n\nThis course combines the essential elements of Project Management and Team Leadership into one course. Through class engagement and reflection, you will acquire further understanding of the responsibilities of leadership and become better prepared to apply this knowledge to the project environment.\n\nUpon completing this course, you will be able to:\n1.       Learn about the role of high performance teams and leadership in project management\n2.       Learn about the tools and techniques for developing and strengthening high performance teams and team members\n3.       Learn about the stages in project cycle\n4.       Apply best practices to develop competencies and skills in planning and controlling projects to ensure successful outcomes\n5.       Learn how to monitor project activities and assess progress\n6.       Learn to communicate proficiently to report project status and performance to stakeholders and contribute to organizational knowledge base\n\nSHOW ALL ABOUT PROJECT MANAGEMENT: THE BASICS FOR SUCCESS\nSHOW ALL"
    },
    {
       "Url":"/learn/work-smarter-not-harder?specialization=career-success",
       "name":"Work Smarter, Not Harder: Time Management for Personal & Professional Productivity",
       "Rating":"Work Smarter, Not Harder: Time Management for Personal & Professional Productivity\n4.5\nstars\n13,063 ratings\n•\n2,711 reviews\n\nYou will be able to gain and apply your knowledge and understanding of personal and professional awareness, organization and commitment, and use the tools, methods and techniques that you have learned in goal setting, prioritization, scheduling, and delegation to overcome time management challenges and enhance productivity.\n\nUpon completing this course, you will be able to:\n1.       Learn to plan effectively to achieve your personal and professional goals\n2.       Learn to recognize and overcome barriers to successful time management\n3.       Identify specific time management tools and use them effectively\n4.       Manage resources both effectively and efficiently\n5.       Keep your sense of perspective to prevent and manage crises\n6.       Learn to delegate effectively\n7.       Learn to manage expectations and say “No” when appropriate\n\nSHOW ALL ABOUT WORK SMARTER, NOT HARDER: TIME MANAGEMENT FOR PERSONAL & PROFESSIONAL PRODUCTIVITY\nSHOW ALL"
    },
    {
       "Url":"/learn/finance-for-non-finance-managers?specialization=career-success",
       "name":"Finance for Non-Financial Professionals",
       "Rating":"Finance for Non-Financial Professionals\n4.6\nstars\n4,029 ratings\n•\n832 reviews\n\nImpact your financial decisions and learn how to affect the performance of your unit's profitability and of your organization. In this course gain a basic understanding of finance and accounting concepts to drive your organization's growth. Upon completion of this course, you will have gained general financial knowledge and an in-depth understanding of the impact of your decisions outside your functional area. Content of the course includes selected aspects of finance from a non-financial specialist perspective. Specific topics include: financial analysis; planning, forecasting, and budgeting; cash flow, and strategic financing. This class will be interactive and will require the active involvement of the participants in finance related activities.\n\nUpon completing this course, you will be able to:\n1.       Explain the importance of finance and interpretation of financial information\n2.       Apply the concepts of accounting and finance to analyze financials\n3.       Learn about key accounting and finance terms\n4.       Examine financial statements by using key ratios\n5.       Explain the importance of budgeting process\n6.       Learn about key components needed to improve profitability\n\nSHOW ALL ABOUT FINANCE FOR NON-FINANCIAL PROFESSIONALS\nSHOW ALL"
    },
    {
       "Url":"/learn/communication-in-the-workplace?specialization=career-success",
       "name":"Communication in the 21st Century Workplace",
       "Rating":"Communication in the 21st Century Workplace\n4.4\nstars\n2,576 ratings\n•\n494 reviews\n\nIn today's fast-paced business environment, employees at all levels find themselves being asked to handle more tasks, meet more deadlines, take on more responsibilities, and adapt to more change. Added to these challenges is the constantly shifting diversity of the workplace, where coworkers cope with generational, gender, age and cultural differences. Communication, both verbal and nonverbal, is at the foundation of everything we do and say, and is especially important in the 21st century workplace. The good news is that communication is a learned skill, and can be improved upon with the right training. The focus of this course is to heighten students’ awareness of workplace communication, and add new interpersonal skills, with the end result of becoming a more competent communicator overall. Target areas include: the process and functions of communication, behavioral patterns, perceptions as reality, verbal and nonverbal cues and behaviors, confidence, assertiveness, tact, anger management, criticism and constructive feedback, conflict resolution, team building, leadership, interviewing, and communicating more effectively with technology (email, Skype, texting, etc.).\n\nUpon completing this course, you will be able to:\n1.       Define communication and its role in the workplace\n2.       Describe benefits of effective communication in the workplace\n3.       Identify and explain most common audiences and techniques for communicating with each audience\n4.       Identify and solve common obstacles to effective communication\n5.       Summarize the 5 Step Technique and explain its usefulness in communicating with your manager\n6.       Discuss the best approaches and communication techniques for delivering bad news to your manager\n7.       Describe ways to make positive connections with your staff.\n8.       Discuss techniques for deciphering the communication styles of executive managers\n9.       Discuss techniques for identifying the characteristics and drivers of executive managers \n10.     Discuss techniques for persuading executive management \n11.     Identify best practices for working successfully with virtual/remote teams\n12.     Apply proven techniques for effective conference calls and webinars\n\nSHOW ALL ABOUT COMMUNICATION IN THE 21ST CENTURY WORKPLACE\nSHOW ALL"
    },
    {
       "Url":"/learn/business-writing?specialization=career-success",
       "name":"High-Impact Business Writing",
       "Rating":"High-Impact Business Writing\n4.5\nstars\n3,289 ratings\n•\n587 reviews\n\nEffective writing is a powerful tool in the business environment. Learn how to articulate your thoughts in a clear and concise manner that will allow your ideas to be better understood by your readers. Improve your business writing skill by learning to select and use appropriate formats for your audience, use the correct medium and adjust your writing style accordingly, as well as identify your objective and communicate it clearly. You'll also learn to spot, correct and avoid the most common writing pitfalls, and gain valuable experience analyzing, writing and revising a wide spectrum of business documents. From a simple interoffice memo to a twenty-page business proposal, learn how to put good business writing to work for you.\n\nUpon completing this course, you will be able to:\n1.       Write effective business communications, including bad news, good news, persuasive writing, presentations, emails, memos, business reports and press releases\n2.       Learn how to edit and proofread business documents\n3.       Learn how to write for a global market\n\nSHOW ALL ABOUT HIGH-IMPACT BUSINESS WRITING\nSHOW ALL"
    },
    {
       "Url":"/learn/art-of-negotiation?specialization=career-success",
       "name":"The Art of Negotiation",
       "Rating":"The Art of Negotiation\n4.5\nstars\n2,645 ratings\n•\n429 reviews\n\nThe art of negotiation comes into play daily in the life of employees at all levels and in every position. Participants explore how current approaches to negotiation strategy and tactics are used, what negotiation entails, types of negotiation relationships that exist from hard bargain to win-win, to fully partnered relationships and personal ones. The course explores the personal and behavioral characteristics of an effective negotiator. Participants discuss how empowerment, power, and authority affect the negotiation process and outcome. Topics include how important it is to plan and prepare for a negotiation session.\n\nUpon completing this course, you will be able to:\n1.       Learn about the nature of negotiation and how it differs from selling\n2.       Gain awareness of the basic doctrines of negotiation and barriers to effective negotiation\n3.       Explain the role of authority and how to address it in negotiations\n4.       Explain the role of power in negotiations and how to address power inequities\n5.       Explain the positive and negative influences of empowerment\n6.       Learn the different “stances” or negotiation styles negotiators might adopt\n7.       Demonstrate the factors that influence which negotiation style is implemented\n8.       Describe the personal and behavioral characteristics of an effective negotiator\n9.       Demonstrate your grasp of emotional intelligence and how it impacts the effectiveness of a negotiator\n10.     Assess your own values and personal style and how they affect the negotiation process\n11.     Learn about the critical importance of planning and preparation in the negotiation process\n\nSHOW ALL ABOUT THE ART OF NEGOTIATION\nSHOW ALL"
    },
    {
       "Url":"/learn/fundamentals-of-management?specialization=career-success",
       "name":"Fundamentals of Management",
       "Rating":"Fundamentals of Management\n4.6\nstars\n3,142 ratings\n•\n546 reviews\n\nAre you about to enter the workforce? Are you an emerging professional? Are you new to your role in the organization? All prospective new employees benefit from understanding management principles, roles and responsibilities, regardless of position.  Now you can acquire an in-depth understanding of the basic concepts and theories of management while exploring the manager's operational role in all types of organizations. Gain insight into the manager's responsibility in planning, organizing, leading, staffing and controlling within the workplace. It’s never too soon to plan your professional path by learning how the best managers manage for success!\n\nUpon completing this course, you will be able to:\n1.       Describe the difference between managers and leaders\n2.       Explore the focus of a manager’s job\n3.       Cite the required skills for a new manager’s success\n4.       Describe the five functions of management\n5.       Explain the new model management operating philosophy\n6.       Describe the hierarchy of planning\n7.       Use the SMART goal setting technique\n8.       Discuss the concept of evolution of leadership\n9.       Explain how customer satisfaction is linked to controlling\n10.     Discuss the power of building a network\n\nSHOW ALL ABOUT FUNDAMENTALS OF MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/problem-solving?specialization=career-success",
       "name":"Effective Problem-Solving and Decision-Making",
       "Rating":"Effective Problem-Solving and Decision-Making\n4.5\nstars\n4,749 ratings\n•\n796 reviews\n\nCritical thinking – the application of scientific methods and logical reasoning to problems and decisions – is the foundation of effective problem solving and decision making. Critical thinking enables us to avoid common obstacles, test our beliefs and assumptions, and correct distortions in our thought processes. Gain confidence in assessing problems accurately, evaluating alternative solutions, and anticipating likely risks. Learn how to use analysis, synthesis, and positive inquiry to address individual and organizational problems and develop the critical thinking skills needed in today’s turbulent times. Using case studies and situations encountered by class members, explore successful models and proven methods that are readily transferable on-the-job.\n\nUpon completing this course, you will be able to:\n1.       Choose and apply appropriate problem solving and decision making processes and methods\n2.       Identify common obstacles to effective problem solving and decision making\n3.       Recognize the human variable in problem solving and decision making\n4.       Assess major conceptual blocks and significant situational challenges\n5.       Apply concepts to enhancing personal development and organizational performance\n6.       Explain the key elements of problem solving and decision making and the barriers associated with them\n\nSHOW ALL ABOUT EFFECTIVE PROBLEM-SOLVING AND DECISION-MAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/entrepreneurial-thinking?specialization=career-success",
       "name":"Essentials of Entrepreneurship: Thinking & Action",
       "Rating":"Essentials of Entrepreneurship: Thinking & Action\n4.6\nstars\n2,479 ratings\n•\n425 reviews\n\nSuccess in business can be greatly enhanced with an understanding of key entrepreneurial characteristics and competencies solutions.  This interactive course provides potential entrepreneurs with the knowledge of succeeding in an entrepreneurial opportunity.  Topics include: how creativity, opportunity and feasibility are best evaluated; business strategies for new businesses; importance of a business plan; achieving success in a new business.  At the end of the course students will have the skills and confidence to evaluate starting a business, in addition to becoming more enterprising in how they approach their roles should they decide to work in organizations.\n\nUpon completing this course, you will be able to:\n1.       Learn about the many faces of and contexts for entrepreneurship\n2.       Learn about the entrepreneurial process and how to manage it\n3.       Learn about what it takes to be an entrepreneur and your own potential to be one\n4.       Learn to recognize opportunities to generate and assess your own business idea\n5.       Explain the business planning process\n6.       Apply entrepreneurial approaches, concepts and methods to your own business idea\n7.       Learn about the operational issues in developing new business ventures\n\nSHOW ALL ABOUT ESSENTIALS OF ENTREPRENEURSHIP: THINKING & ACTION\nSHOW ALL"
    },
    {
       "Url":"/learn/career-success-capstone?specialization=career-success",
       "name":"Career Success Project",
       "Rating":"Career Success Project\n4.7\nstars\n268 ratings\n•\n39 reviews\n\nThe purpose of the Capstone Project in the Career Success Specialization is for you to apply the methods and techniques you learned in the series of courses to a personal experience, giving you a way to communicate your value to potential employers. You’ll focus your communication, management, negotiation, problem solving, business writing, time management, finance, entrepreneurship, and project management skills into a single project that demonstrates your career readiness.\n\nUpon completing this course, you will be able to:\n1.       Apply the methods, techniques and skills you have learned throughout the Specialization to add value, every day, to your organization by effectively gathering, synthesizing, analyzing and presenting information\n2.       Develop and hone your critical thinking skills as you evaluate ideas, concepts, approaches and assumptions to arrive at a practical, yet innovative, solution to an organizational problem\n3.       Learn to skillfully use a powerful strategic planning tool\n4.       Effectively communicate information, ideas, problems and solutions to senior-level decision makers\n\nSHOW ALL ABOUT CAREER SUCCESS PROJECT\nSHOW ALL"
    },
    "/specializations/business-music-production",
    {
       "Url":"/learn/music-business-foundations?specialization=business-music-production",
       "name":"Music Business Foundations",
       "Rating":"Music Business Foundations\n4.9\nstars\n2,224 ratings\n•\n591 reviews\n\nThis course has been developed to provide students with the latest instruction on the best way for creators, consumers, and facilitators to navigate the resurgence of one of the world’s most exciting industries: the music business. Three things are clear about today’s music industry: The consumption of music is expanding at the greatest rate in history and from the most portals ever imagined, the cost of producing music is decreasing, and the number of artists creating and seeking to expose their work and develop careers through the Internet has increased dramatically. Whether you’re a music creator, consumer, or facilitator of this process, you’ll want to understand the history, underpinnings, and basics of the music business. Course author John Kellogg—administrator, educator, entertainment lawyer, performer, and radio and television personality—offers students the opportunity to learn the fundamental principles of the developing new music business, for now and into the future.\n\nWhat you'll learn: \n-- The basic history of the music industry and today's business trends\n-- How recording agreements are formulated\n-- The basics of copyright law as it pertains to the music business\n-- The role of agents, managers, attorneys, and specific business entities\n\nSHOW ALL ABOUT MUSIC BUSINESS FOUNDATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/producing-music?specialization=business-music-production",
       "name":"The Art of Music Production",
       "Rating":"The Art of Music Production\n4.8\nstars\n1,747 ratings\n•\n539 reviews\n\nExplore the art of record production and how to make recordings that other people will love listening to. This course will teach you how to make emotionally moving recordings on almost any recording equipment, including your phone or laptop. The emphasis is on mastering tangible artistic concepts; the gear you use is up to you. You will learn to develop the most important tool in the recording studio: your ears. You will learn to enhance every aspect of your own productions, both sonically and musically, by employing deeper listening skills. \n\nAssignments will include posting your own recordings for peer review, and reviewing your classmates’ work by employing specific tools and strategies. If you use a digital audio workstation to record and mix, that’s great, but as long as you can record into your computer and post an MP3, you can complete the assignments. \n\nAs you learn about the art of record production in this 4-week course, you will also learn about yourself and who you are as an artist and producer. It is not necessary that you read music or play an instrument to take this course.\n\nSHOW ALL ABOUT THE ART OF MUSIC PRODUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/copyright-law-music-business?specialization=business-music-production",
       "name":"Copyright Law in the Music Business",
       "Rating":"Copyright Law in the Music Business\n4.8\nstars\n526 ratings\n•\n120 reviews\n\nIn this course taught by E. Michael Harrington, students will learn the basis for copyright including what is and is not covered by copyright law. This course will help clarify what rights artists have as creators as well as what the public is free to take from their work. Students will also learn what to do if someone copies their work and what to do if they are accused of copying someone else. Finally, the course will discuss how technology has changed copyright for the better (and worse) and how copyright laws may change in the coming years.\n\nSHOW ALL ABOUT COPYRIGHT LAW IN THE MUSIC BUSINESS\nSHOW ALL"
    },
    {
       "Url":"/learn/protools?specialization=business-music-production",
       "name":"Pro Tools Basics",
       "Rating":"Pro Tools Basics\n4.7\nstars\n528 ratings\n•\n191 reviews\n\nProducing music is an incredibly creative process, and knowing the tools of the trade is essential in order to transmit the musical ideas in your head into the DAW in a creative and uninhibited way.  Whether you have used a computer to create music before, or you have been curious about production for years, this 4-week course will give you an introductory look into the world of Avid Pro Tools and Pro Tools First.\n\nSHOW ALL ABOUT PRO TOOLS BASICS\nSHOW ALL"
    },
    "/specializations/regulatory-compliance",
    {
       "Url":"/learn/what-is-compliance?specialization=regulatory-compliance",
       "name":"What is Compliance?",
       "Rating":"What is Compliance?\n4.8\nstars\n798 ratings\n•\n174 reviews\n\nCompliance isn’t only about preventing problems and ensuring that everyone is abiding by laws, rules, and regulations.  It’s also about the positive impact a robust and ethical compliance program can have on a business or organization.\n\nIn this course we will discuss why compliance is important – from the needs facing businesses in highly regulated industries to avoiding fines and penalties to preventing reputational and economic nightmares. We’ll examine real-world examples of compliance and governance failures and their impact, and consider strategies for avoiding similar situations in our own organizations. You’ll be able to think about risk management in new ways and apply strategies to manage it.\n\nSHOW ALL ABOUT WHAT IS COMPLIANCE?\nSHOW ALL"
    },
    {
       "Url":"/learn/effective-compliance-programs?specialization=regulatory-compliance",
       "name":"Effective Compliance Programs",
       "Rating":"Effective Compliance Programs\n4.9\nstars\n464 ratings\n•\n77 reviews\n\nOnce you have an understanding of what compliance is, and why it may be important, it is natural to wonder next, “What should I do about it?”  In this course, we’ll explore one of the key factors for creating a positive culture of compliance: human psychology. We’ll think about what drives us, what makes us pay attention, what distracts, and how all of these pieces help build a strong belief in an organizational culture of compliance. \n\nWe will examine formal compliance programs, diving into the nuances of how they are applied in practice. We’ll also explore the technologies, workflows, policies, monitoring, and training necessary to create a toolkit for designing an effective compliance program.\n\nSHOW ALL ABOUT EFFECTIVE COMPLIANCE PROGRAMS\nSHOW ALL"
    },
    {
       "Url":"/learn/privacy-law-data-protection?specialization=regulatory-compliance",
       "name":"Privacy Law and Data Protection",
       "Rating":"Privacy Law and Data Protection\n4.8\nstars\n507 ratings\n•\n93 reviews\n\nWhat does it take to comply with privacy laws? \n\nIn this course, we’ll look at the practical aspects of navigating the complex landscape of privacy requirements. Better understanding privacy laws and data protection will enable you to protect your organization and the constituents that depend on your organization to safeguard their personal information. First, we will examine the historical context that drove the creation of laws, best practices, and other standards for protecting personal information.  We will also consider where in the U.S. privacy laws exist and which sectors remain unregulated.  Next, we will focus on the federal health privacy law, the Health Insurance Portability and Accountability Act of 1996 (HIPAA) – and what it takes to comply with it.  How do you know the scope of the requirements?  And once you know HIPAA applies, how do you actually put measures in place to ensure compliance?  \n\nWe’ll explore the notion that one cannot have privacy without strong security and examine various models that promote the security of personal information.  We’ll look closely at breach notification laws – one of the most significant drivers of change in organizations – and discuss strategies for the improvement of data protection overall.  Lastly, we will look at international law, state law, the unique and important role of the Federal Trade Commission in protecting privacy.  Most importantly, we get practical – we will discuss real-world, practical approaches to how compliance professionals can navigate the complex landscape of privacy requirements to best protect their organizations.\n\nSHOW ALL ABOUT PRIVACY LAW AND DATA PROTECTION\nSHOW ALL"
    },
    {
       "Url":"/learn/what-is-corruption-anti-corruption-compliance?specialization=regulatory-compliance",
       "name":"What is Corruption: Anti-Corruption and Compliance",
       "Rating":"What is Corruption: Anti-Corruption and Compliance\n4.9\nstars\n354 ratings\n•\n67 reviews\n\nHave you ever paid someone for doing you a favor? \n\nYou may be accustomed to tipping wait staff or other service providers, but what if you paid a police officer for NOT issuing a parking ticket?  Or if you gave a “gift” to a government official for signing a contract with your company? Tipping might be okay, but paying a bribe is a violation of the law.  \n Bribery is widespread and exists almost everywhere and in many forms.  Compliance programs address this and other forms of corruption. \n \nIn this course we’ll discuss what corruption actually is by examining, for example, the difference between a tip and an illegal bribe.  We will examine where corruption exists, how it exists, its ramifications, and the genesis of today’s anti-corruption laws.  We’ll also focus on practical strategies for creating compliance policies and procedures that address and prevent corruption.\n\nWe will learn about the U.S. Foreign Corrupt Practices Act, the UK Bribery Act, and many other anti-corruption laws.  Much of the course will focus on building out compliance policies and procedures that address corruption.  We will also look at practical methods for preventing corruption in an organization as well as red flags and other mechanisms for identifying corruption early so that it can be adequately addressed.\n\nSHOW ALL ABOUT WHAT IS CORRUPTION: ANTI-CORRUPTION AND COMPLIANCE\nSHOW ALL"
    },
    "/specializations/healthcare-administration-management",
    {
       "Url":"/learn/finance-healthcare-managers?specialization=healthcare-administration-management",
       "name":"Financial Acumen for Non-Financial Managers",
       "Rating":"Financial Acumen for Non-Financial Managers\n4.5\nstars\n698 ratings\n•\n138 reviews\n\nIn this course, you’ll explore how financial statement data and non-financial metrics can be linked to financial performance. Professors Rick Lambert and Chris Ittner of the Wharton School have designed this course to help you gain a practical understanding of how data is used to assess what drives financial performance and forecast future financial scenarios. You’ll learn more about the frameworks of financial reporting, income statements, and cash reporting, and apply different approaches to analyzing financial performance using real-life examples to see the concepts in action. By the end of this course, you’ll have honed your skills in understanding how financial data and non-financial data interact to forecast events and be able to determine the best financial strategy for your organization.\n\nSHOW ALL ABOUT FINANCIAL ACUMEN FOR NON-FINANCIAL MANAGERS\nSHOW ALL"
    },
    {
       "Url":"/learn/health-economics-us-healthcare-systems?specialization=healthcare-administration-management",
       "name":"The Economics of Health Care Delivery",
       "Rating":"The Economics of Health Care Delivery\n4.8\nstars\n470 ratings\n•\n86 reviews\n\nIn this course, you’ll learn about the key components of health care, and the economics behind their principles and pricing strategies. Professors Ezekiel Emanuel of Penn Medicine and Guy David of  the Wharton School have designed this course to help you understand the complex structure of the health care system and health insurance. Through study and analysis of providers and insurance through an economic lens, you’ll learn how basic economic principles apply to both principles and payment methods. By the end of this course, you’ll be able to identify different types of health care providers and understand the dynamic between the providers and patient so you can employ best practices and maximize profit for your health care organization.\n\nSHOW ALL ABOUT THE ECONOMICS OF HEALTH CARE DELIVERY\nSHOW ALL"
    },
    {
       "Url":"/learn/management-fundamentals-healthcare-administrators?specialization=healthcare-administration-management",
       "name":"Management Fundamentals",
       "Rating":"Management Fundamentals\n4.7\nstars\n372 ratings\n•\n69 reviews\n\nPeople are the most valuable asset of any business, but they are also the most unpredictable, and the most difficult asset to manage. And although managing people well is critical to the health of any organization, most managers don't get the training they need to make good management decisions. Now, award-winning authors and renowned management Professors Mike Useem and Peter Cappelli of the Wharton School have designed this course to introduce you to the key elements of managing people. Based on their popular course at Wharton, this course will teach you how to motivate individual performance and design reward systems, how to design jobs and organize work for high performance, how to make good and timely management decisions, and how to design and change your organization’s architecture. By the end of this course, you'll have developed the skills you need to start motivating, organizing, and rewarding people in your organization so that you can thrive as a business and as a social organization.\n\nSHOW ALL ABOUT MANAGEMENT FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/wo-pmo-healthcareinnovation?specialization=healthcare-administration-management",
       "name":"Health Care Innovation",
       "Rating":"Health Care Innovation\n4.6\nstars\n231 ratings\n•\n35 reviews\n\nIn this course, you’ll learn the foundational economic theories behind health care innovation and how to optimize your own health care practice or organization. Designed to help you gain a practical understanding of the theoretical frameworks of behavioral economics and operations management in the health care setting, this course will help you apply these frameworks to assess health care practices and apply innovation while managing risk. You’ll also explore the best practices for evaluating one’s innovative practices, using real-life examples of success to see the concepts in action. By the end of this course, you’ll have honed your skills in optimizing health care operations, and be able to develop the right set of evaluations and questions to achieve best innovative practices within your organization.\n\nSHOW ALL ABOUT HEALTH CARE INNOVATION\nSHOW ALL"
    },
    "/specializations/diy-musician",
    {
       "Url":"/learn/songwriting-lyrics?specialization=diy-musician",
       "name":"Songwriting: Writing the Lyrics",
       "Rating":"Songwriting: Writing the Lyrics\n4.8\nstars\n712 ratings\n•\n235 reviews\n\nThere’s a songwriter lurking somewhere inside you, peeking around corners, wondering if it’s safe to come out. Now it is. This course is an invitation to let your inner songwriter step into the sunlight. All it takes is a simple “yes” and you’ll be climbing that windy hill, marveling at the view.\n\nIf you haven’t written any or many songs, this course will show you an efficient, effective process for tailoring songs to express your ideas and emotions. If you have, you’ll look at your process differently, taking control of aspects of the process you may have not noticed.\n\nThe course will start by examining the tools available to you, all revolving around the essential concept of prosody. You’ll learn to use your tools to enhance your message—to work compositionally at the same time you’re developing your ideas.\n\nYou’ll be working both lyrically and musically, though musically it’s not necessary that you either read music or play an instrument. If you play, great, and you’ll be encouraged to play and record your musical responses to the assignments. If you don’t play, the course offers you a number of musical loops to work with. All you’ll have to do is sing your melodies over the loops.\n\nAssignments will ask you to post something for peer review—sometimes lyric lines or sections, sometimes melodies, sometimes both. None of it has to be polished. The course is about writing, not performing.\n\nMost important, you’ll have a lot of fun.\n\nSHOW ALL ABOUT SONGWRITING: WRITING THE LYRICS\nSHOW ALL"
    },
    {
       "Url":"/learn/producing-music?specialization=diy-musician",
       "name":"The Art of Music Production",
       "Rating":"The Art of Music Production\n4.8\nstars\n1,747 ratings\n•\n539 reviews\n\nExplore the art of record production and how to make recordings that other people will love listening to. This course will teach you how to make emotionally moving recordings on almost any recording equipment, including your phone or laptop. The emphasis is on mastering tangible artistic concepts; the gear you use is up to you. You will learn to develop the most important tool in the recording studio: your ears. You will learn to enhance every aspect of your own productions, both sonically and musically, by employing deeper listening skills. \n\nAssignments will include posting your own recordings for peer review, and reviewing your classmates’ work by employing specific tools and strategies. If you use a digital audio workstation to record and mix, that’s great, but as long as you can record into your computer and post an MP3, you can complete the assignments. \n\nAs you learn about the art of record production in this 4-week course, you will also learn about yourself and who you are as an artist and producer. It is not necessary that you read music or play an instrument to take this course.\n\nSHOW ALL ABOUT THE ART OF MUSIC PRODUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/protools?specialization=diy-musician",
       "name":"Pro Tools Basics",
       "Rating":"Pro Tools Basics\n4.7\nstars\n528 ratings\n•\n191 reviews\n\nProducing music is an incredibly creative process, and knowing the tools of the trade is essential in order to transmit the musical ideas in your head into the DAW in a creative and uninhibited way.  Whether you have used a computer to create music before, or you have been curious about production for years, this 4-week course will give you an introductory look into the world of Avid Pro Tools and Pro Tools First.\n\nSHOW ALL ABOUT PRO TOOLS BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/navigate-music-industry-independent-artist?specialization=diy-musician",
       "name":"Building Your Career in Music: Developing A Brand and Funding Your Music",
       "Rating":"Building Your Career in Music: Developing A Brand and Funding Your Music\n4.4\nstars\n404 ratings\n•\n90 reviews\n\nThis course shares practical tips and strategies to help you take your first step into launching your career as a musical artist. We’ll cover everything from developing your unique identity as an artist and how to lead a band all the way to planning and recording your first independent record with the help of crowdfunding. \n\nThe course curriculum is modeled from the real-world experience of Leah Waldo (also known as the emerging country artist, Elisa Smith) and features interviews with industry executives, artists, producers, and engineers — all designed to help you navigate the music industry.\n\nSHOW ALL ABOUT BUILDING YOUR CAREER IN MUSIC: DEVELOPING A BRAND AND FUNDING YOUR MUSIC\nSHOW ALL"
    },
    "/specializations/data-visualization",
    {
       "Url":"/learn/data-visualization-tableau?specialization=data-visualization",
       "name":"Fundamentals of Visualization with Tableau",
       "Rating":"Fundamentals of Visualization with Tableau\n4.5\nstars\n5,144 ratings\n•\n1,172 reviews\n\nIn this first course of this specialization, you will discover what data visualization is, and how we can use it to better see and understand data. Using Tableau, we’ll examine the fundamental concepts of data visualization and explore the Tableau interface, identifying and applying the various tools Tableau has to offer. By the end of the course you will be able to prepare and import data into Tableau and explain the relationship between data analytics and data visualization. This course is designed for the learner who has never used Tableau before, or who may need a refresher or want to explore Tableau in more depth. No prior technical or analytical background is required. The course will guide you through the steps necessary to create your first visualization from the beginning based on data context, setting the stage for you to advance to the next course in the Specialization.\n\nSHOW ALL ABOUT FUNDAMENTALS OF VISUALIZATION WITH TABLEAU\nSHOW ALL"
    },
    {
       "Url":"/learn/dataviz-design?specialization=data-visualization",
       "name":"Essential Design Principles for Tableau",
       "Rating":"Essential Design Principles for Tableau\n4.5\nstars\n1,699 ratings\n•\n285 reviews\n\nIn this course, you will analyze and apply essential design principles to your Tableau visualizations. This course assumes you understand the tools within Tableau and have some knowledge of the fundamental concepts of data visualization. You will define and examine the similarities and differences of exploratory and explanatory analysis as well as begin to ask the right questions about what’s needed in a visualization. You will assess how data and design work together, including how to choose the appropriate visual representation for your data, and the difference between effective and ineffective visuals. You will apply effective best practice design principles to your data visualizations and be able to illustrate examples of strategic use of contrast to highlight important elements. You will evaluate pre-attentive attributes and why they are important in visualizations. You will exam the importance of using the \"right\" amount of color and in the right place and be able to apply design principles to de-clutter your data visualization.\n\nSHOW ALL ABOUT ESSENTIAL DESIGN PRINCIPLES FOR TABLEAU\nSHOW ALL"
    },
    {
       "Url":"/learn/dataviz-visual-analytics?specialization=data-visualization",
       "name":"Visual Analytics with Tableau",
       "Rating":"Visual Analytics with Tableau\n4.6\nstars\n1,572 ratings\n•\n299 reviews\n\nIn this third course of the specialization, we’ll drill deeper into the tools Tableau offers in the areas of charting, dates, table calculations and mapping. We’ll explore the best choices for charts, based on the type of data you are using. We’ll look at specific types of charts including scatter plots, Gantt charts, histograms, bullet charts and several others, and we’ll address charting guidelines. We’ll define discrete and continuous dates, and examine when to use each one to explain your data.  You’ll learn how to create custom and quick table calculations and how to create parameters. We’ll also introduce mapping and explore how Tableau can use different types of geographic data, how to connect to multiple data sources and how to create custom maps.\n\nSHOW ALL ABOUT VISUAL ANALYTICS WITH TABLEAU\nSHOW ALL"
    },
    {
       "Url":"/learn/dataviz-dashboards?specialization=data-visualization",
       "name":"Creating Dashboards and Storytelling with Tableau",
       "Rating":"Creating Dashboards and Storytelling with Tableau\n4.6\nstars\n841 ratings\n•\n155 reviews\n\nLeveraging the visualizations you created in the previous course, Visual Analytics with Tableau, you will create dashboards that help you identify the story within your data, and you will discover how to use Storypoints to create a powerful story to leave a lasting impression with your audience.\n\nYou will balance the goals of your stakeholders with the needs of your end-users, and be able to structure and organize your story for maximum impact. Throughout the course you will apply more advanced functions within Tableau, such as hierarchies, actions and parameters to guide user interactions.  For your final project, you will create a compelling narrative to be delivered in a meeting, as a static report, or in an interactive display online.\n\nSHOW ALL ABOUT CREATING DASHBOARDS AND STORYTELLING WITH TABLEAU\nSHOW ALL"
    },
    {
       "Url":"/learn/dataviz-project?specialization=data-visualization",
       "name":"Data Visualization with Tableau Project",
       "Rating":"Data Visualization with Tableau Project\n4.6\nstars\n396 ratings\n•\n65 reviews\n\nIn this project-based course, you will follow your own interests to create a portfolio worthy single-frame viz or multi-frame data story that will be shared on Tableau Public. You will use all the skills taught in this Specialization to complete this project step-by-step, with guidance from your instructors along the way. You will first create a project proposal to identify your goals for the project, including the question you wish to answer or explore with data. You will then find data that will provide the information you are seeking. You will then import that data into Tableau and  prepare it for analysis. Next you will create a dashboard that will allow you to explore the data in depth and identify meaningful insights. You will then give structure to your data story by writing the story arc in narrative form. Finally, you will consult your design checklist to craft the final viz or data story in Tableau. This is your opportunity to show the world what you’re capable of - so think big, and have confidence in your skills!\n\nSHOW ALL ABOUT DATA VISUALIZATION WITH TABLEAU PROJECT\nSHOW ALL"
    },
    "/specializations/supply-chain-management",
    {
       "Url":"/learn/supply-chain-logistics?specialization=supply-chain-management",
       "name":"Supply Chain Logistics",
       "Rating":"Supply Chain Logistics\n4.7\nstars\n7,423 ratings\n•\n1,976 reviews\n\nHave you ever wondered how goods get delivered to us so quickly as soon as we order them? One word: Logistics! In this introductory Supply Chain Logistics course, I will take you on a journey to this fascinating backbone of global trade. We cover the three major building blocks of logistics networks: transportation, warehousing, and inventory. After completing this course, you will be able to differentiate the advantages and disadvantages of different modes of transportation. You will understand what goes into designing and setting up a warehousing facility. Finally, you will be able to select the options that enable you to develop logistics networks, that minimize costs and deliver top customer service. This is an introductory course designed to provide you with a start on your learning journey in logistics. You do not need to have any background in logistics, but it would be beneficial if you had a basic understanding of business concepts. Join me and we will learn together about logistics!\n\nInterested in learning advanced supply chain topics? Check out the Supply Chain Excellence MasterTrack™ Certificate: https://www.coursera.org/mastertrack/supply-chain-excellence-rutgers\n\nSHOW ALL ABOUT SUPPLY CHAIN LOGISTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/operations?specialization=supply-chain-management",
       "name":"Supply Chain Operations",
       "Rating":"Supply Chain Operations\n4.8\nstars\n3,053 ratings\n•\n680 reviews\n\nHave you ever wondered how products and services are created exactly the same thousands of times over? And how companies are able to smooth out operations to manufacture efficiently, effectively, and without any waste? How is such precision possible? The answer lies at the heart of operations. In the Supply Chain Operations course, we introduce and apply essential process improvement tools to achieve perfection. After completing this course, you will be able to apply the Six Sigma methodology for process improvement. You will demonstrate that you understand the basic tenets of the Lean philosophy that enables manufacturers to eliminate waste and make processes more efficient.  Finally, you will be able to apply the tools that you just gained to improve a process of your own. This is an introductory course designed to provide you with a start on your learning journey in operations. You do not need to have any background in operations, but it would be beneficial if you had a basic understanding of business concepts, a working knowledge of spreadsheets, and ideally have mastered the Supply Chain Logistics course. Join me and we will learn together about operations!\n\nSHOW ALL ABOUT SUPPLY CHAIN OPERATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/planning?specialization=supply-chain-management",
       "name":"Supply Chain Planning",
       "Rating":"Supply Chain Planning\n4.7\nstars\n2,241 ratings\n•\n490 reviews\n\nHave you ever wondered how companies know how much to produce in advance so that they do not make too much or too little? Matching supply and demand requires planning. This course introduces you to the exciting area of supply chain planning. Part of a broader specialization on Supply Chain Management, you will master different forecasting techniques, essential for building a Sales and Operations Plan. At the completion of this course you will have the tools and techniques to analyze demand data, construct different forecasting techniques, and choose the most suitable one for projecting future demand.\n\nSHOW ALL ABOUT SUPPLY CHAIN PLANNING\nSHOW ALL"
    },
    {
       "Url":"/learn/sourcing?specialization=supply-chain-management",
       "name":"Supply Chain Sourcing",
       "Rating":"Supply Chain Sourcing\n4.7\nstars\n1,520 ratings\n•\n318 reviews\n\nHave you ever wondered how companies manage relationships with their thousands of suppliers? Sourcing is an important part of managing a successful supply chain. This course introduces you to the exciting area of supply chain sourcing. Part of a broader specialization on Supply Chain Management, you will master the supplier selection process and supplier segmentation. At the completion of this course you will have the tools and techniques to find the right vendors and maintain the right relationship with any one of your existing suppliers.\n\nSHOW ALL ABOUT SUPPLY CHAIN SOURCING\nSHOW ALL"
    },
    {
       "Url":"/learn/supply-chain-management-strategy?specialization=supply-chain-management",
       "name":"Supply Chain Management Strategy",
       "Rating":"Supply Chain Management Strategy\n4.8\nstars\n780 ratings\n•\n184 reviews\n\nHave you ever wondered what it takes to manage a successful supply chain? It all comes down to the right strategy. Supply Chain Management Strategy is the indispensable direction for managing a successful supply chain.  This course is the capstone of the Supply Chain Management specialization. While, it is strongly recommended that you take all courses in this specialization, you do not have to if you believe you already have those skills. You will use the tools acquired in the previous four courses to create a supply chain management strategy in a real-life case scenario. At the completion of this course you will have shown mastery of the tools and techniques to successfully manage a complex network of companies that we call the supply chain.\n\nSHOW ALL ABOUT SUPPLY CHAIN MANAGEMENT STRATEGY\nSHOW ALL"
    },
    "/specializations/human-resource-management",
    {
       "Url":"/learn/managing-human-resources?specialization=human-resource-management",
       "name":"Preparing to Manage Human Resources",
       "Rating":"Preparing to Manage Human Resources\n4.8\nstars\n7,224 ratings\n•\n1,975 reviews\n\nOne way or another, all employees are managed. But approaches to managing employees varying from employee-to-employee, job-to-job, manager-to-manager, organization-to-organization, and country-to-country. This course provides a foundation for developing your own approach to skillfully managing employees by illustrating alternative human resource management (HRM) strategies, introducing the importance of the legal context, and thinking about what motivates employees. This will then give you the factual and conceptual basis for developing specific, critical HRM skills in subsequent courses on hiring employees, managing performance, and rewarding employees. Don't know anything about HRM? That's OK! Leave this course with a new-found understanding of the range of options available for managing employees, a grasp of what makes workers tick, and the readiness to develop your own HRM skills.\n\nSHOW ALL ABOUT PREPARING TO MANAGE HUMAN RESOURCES\nSHOW ALL"
    },
    {
       "Url":"/learn/recruiting-hiring-onboarding-employees?specialization=human-resource-management",
       "name":"Recruiting, Hiring, and Onboarding Employees",
       "Rating":"Recruiting, Hiring, and Onboarding Employees\n4.7\nstars\n3,144 ratings\n•\n755 reviews\n\nFinding and hiring the right people is often cited as the number one concern of businesses today. It seems we are all competing for the best and brightest workers.  As you will see in our time together in the second course, a critical component of the People Manager Value Proposition is to hire talented people who enable the organization to achieve its strategic goals. This course is an introduction into the topic of recruitment, selection and onboarding. \n\nAt the outset of the course we will explore the importance of linking recruitment goals with overall company strategy. We then look at a number of options to recruit and select employees both effectively and legally. Throughout the course we will examine current issues in talent acquisition, such as how companies are now leveraging social media and hiring analytics to ensure better quality hires.\n\nAt the conclusion of the course, we look at how to onboard employees to promote employee commitment and engagement.\n\nSHOW ALL ABOUT RECRUITING, HIRING, AND ONBOARDING EMPLOYEES\nSHOW ALL"
    },
    {
       "Url":"/learn/employee-performance?specialization=human-resource-management",
       "name":"Managing Employee Performance",
       "Rating":"Managing Employee Performance\n4.7\nstars\n1,994 ratings\n•\n486 reviews\n\nOnce you have hired good employees, the next step that successful people managers take is to develop the full potential of their employees.  Performance management is a process that helps managers achieve the goal of getting the best from their employees. \n\nIn this third course in the Human Resources for People Managers specialization,  we will discuss the skills and key processes you will need to develop your employees to attain department and organizational goals.  These skills will include setting clear expectations, providing positive and corrective feedback, and delivering an effective performance appraisal.\n\nSHOW ALL ABOUT MANAGING EMPLOYEE PERFORMANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/compensation-management?specialization=human-resource-management",
       "name":"Managing Employee Compensation",
       "Rating":"Managing Employee Compensation\n4.7\nstars\n1,447 ratings\n•\n347 reviews\n\nWhether you're writing paychecks or wondering where yours comes from, this course is for you! \n\nWe begin by asking: \"To succeed, what kind of a person does your organization need to attract, retain, and motivate?\" From there, we'll explain how to align your organization's objectives, its pay philosophy, and ultimately the way it designs and implements its salary structure, short-term incentives, long-term incentives, and benefits. \n\nInterested in learning more about the technical aspects of compensation, but don't know where to begin? We'll give an overview of key the key technical skills: compliance with pay regulations, understanding stock options, shopping for health insurance and pension providers, and designing incentive plans. Lastly, we'll discuss non-monetary methods of motivating employees. \n\nUpon completing the course, you should be able to have an understanding of compensation both strategically and technically. Learners will also gain introductory familiarity with pay regulation in the US.\n\nSHOW ALL ABOUT MANAGING EMPLOYEE COMPENSATION\nSHOW ALL"
    },
    {
       "Url":"/learn/human-resources-management-capstone?specialization=human-resource-management",
       "name":"Human Resources Management Capstone: HR for People Managers",
       "Rating":"Human Resources Management Capstone: HR for People Managers\n4.8\nstars\n446 ratings\n•\n141 reviews\n\nThis specialization provides a robust introduction to the key principles, policies, and practices of human resource management, with a focus on understanding managerial choices and constraints, acquiring and onboarding talent, managing employee performance, and rewarding employees. The capstone project provides learners with the opportunity to apply these key principles and practices to a real-world workplace (including a learner's own workplace if desired). Specifically, the capstone project will involve identifying the key human resources challenges for a workplace--including the most pressing motivational, selection, performance evaluation, and reward issues. And for each of these areas, learners will devise a multi-step action plan for addressing the challenges identified.\n\nSHOW ALL ABOUT HUMAN RESOURCES MANAGEMENT CAPSTONE: HR FOR PEOPLE MANAGERS\nSHOW ALL"
    }
 ]