[
    "/specializations/product-ideation-design-and-management",
    {
       "Url":"/learn/developing-innovative-ideas-for-product-leaders?specialization=product-ideation-design-and-management",
       "name":"Developing Innovative Ideas for Product Leaders",
       "Rating":"Developing Innovative Ideas for Product Leaders\n\nFor product leaders, creating new new products and improving existing products are imperatives for success. Maturing technologies and aging product portfolios are requiring companies to discover, develop, and deliver products that customers love. This course is focused on the first step of this journey, identifying and evaluating new product opportunities.  \n\nThis course is primarily aimed at professionals who are inspired, or tasked, to develop and lead products. This include aspiring and active product managers, product designers, product developers, and others in the product arena. This course is also valuable to anyone interested in how to developing innovative ideas for new products.\n\nWe will focus on four important areas to develop and enhance your capabilities as a product leader:\n\n• Introducing the skills for identifying and analyzing entrepreneurial ideas for new or improved products;\n• Examining entrepreneurial thinking within yourself and your colleagues with an awareness of entrepreneurial mindset, entrepreneurial motivations, and entrepreneurial behaviors;\n• Cultivating seeing entrepreneurially within yourself and your colleagues with attention to industry conditions, industry status, macroeconomic change, and competition; and\n• Championing acting entrepreneurially within the corporate environment with an understanding of value innovation and opportunity identification.\n\nSHOW ALL ABOUT DEVELOPING INNOVATIVE IDEAS FOR PRODUCT LEADERS\nSHOW ALL"
    },
    {
       "Url":"/learn/product-management-essentials?specialization=product-ideation-design-and-management",
       "name":"Product Management Essentials",
       "Rating":"Product Management Essentials\n4.6\nstars\n14 ratings\n•\n2 reviews\n\nProduct management is one of the fastest growing and most lucrative jobs available today. Companies have awoken to the desperate need for product managers to create products that customers love, that integrate design, functionality, and business solutions. In our course, we define the fundamentals of product management and why this role is so coveted as a launch pad for future CEOs and startup founders.\n\nTo be effective, product managers need a clear understanding of their jobs and duties. They also need a clear understanding of the required skills and competencies. An appreciation of these roles, responsibilities, skills, and capabilities is also beneficial for stakeholders and team members who collaborate with product managers.\n\nThis course investigates the framework for success in product management by defining the product manager’s position in an organization and the key responsibilities. We will examine the skills and competencies most critical to carrying out those responsibilities. To further improve your understanding of product management, we will discuss how product managers engage with the product team and stakeholders to create and manage successful products.\n\nProduct managers must also know how to establish, organize, and lead a team. They must know the typical product development life cycle and be able to select the right development methodology for the product and the target market. To meet these challenges to product team leadership, we will consider the phases of product development and the roles that product managers play in each step. We’ll examine a variety of team structures and product development methodologies, and the importance of establishing a team charter. Lastly, we will also explore the opportunities and challenges of market development and commercialization. We’ll provide an orientation to key marketing concepts critical to developing and commercializing innovative products and services.\n\nSHOW ALL ABOUT PRODUCT MANAGEMENT ESSENTIALS\nSHOW ALL"
    },
    {
       "Url":"/learn/establishing-product-market-fit?specialization=product-ideation-design-and-management",
       "name":"Establishing Product-Market Fit",
       "Rating":"Establishing Product-Market Fit\n\nEntrepreneur and investor Marc Andreessen coined the term product-market fit in 2007 when he said, “Product-market fit means being in a good market with a product that can satisfy that market.” While there are ample articles that mention the term, detailed guidance on how to actually achieve product-market fit is scarce.\n\nThrough our course we will explore an actionable model that defines product-market fit using five key components. From bottom to top, we will examine the layers of product-market fit beginning with your target customer and transitioning through your customer’s underserved needs, your value proposition, your feature set, and ultimately your user experience (UX).\n\nOur process is an iterative, easy-to-follow guide through each layer to achieve product-market fit. This process helps you to articulate, test, and revise your key hypotheses about your product and the market so you can define and improve your product-market fit.\n\nUsing the principles of Lean Product Process, our course is structured in seven steps: determining your target customer, identifying underserved customer needs, defining your value proposition, specifying your minimum viable product (MVP) feature set, creating your MVP prototype, testing your MVP with customers, and iterating to improve product-market fit.\n\nSHOW ALL ABOUT ESTABLISHING PRODUCT-MARKET FIT\nSHOW ALL"
    },
    {
       "Url":"/learn/creative-design-prototyping-testing?specialization=product-ideation-design-and-management",
       "name":"Creative Design, Prototyping, and Testing",
       "Rating":"Creative Design, Prototyping, and Testing\n4.1\nstars\n14 ratings\n•\n3 reviews\n\nDesigning the customer and user experience is essential to creating great products today. Gone is the old paradigm of “form follows function” model of design. The process must be iterative and follow the best product design and development processes. While designing a great user experience can be a lengthy and expensive process, there are approaches to doing it faster and smarter, without compromising results.\n\nThis essential product management course explains key design thinking principles around personas, story mapping, and prototyping. Product managers need to know and appreciate product designer tools and processes. By combining these principles with good scrum processes, you’ll learn to create great products that don’t sacrifice design for functionality or feasibility.\n\nThis course enables students to transition from ideas to prototyping and concept testing of their products and services. Students learn how best to effectively translate ideas into marketable offerings so that the best product and service ideas are harnessed and create real value for customers and the organization. Emphasis is placed on an integrated and interdisciplinary approach to engineering design, concurrent engineering, design for manufacturing, industrial design, and the business of new product development. Topics include design methods, modeling and simulation, material and manufacturing process selection, platform and modular design, mass customization, planning and scheduling.\n\nSHOW ALL ABOUT CREATIVE DESIGN, PROTOTYPING, AND TESTING\nSHOW ALL"
    },
    {
       "Url":"/learn/financial-management-for-product-leaders?specialization=product-ideation-design-and-management",
       "name":"Financial Management for Product Leaders",
       "Rating":"Financial Management for Product Leaders\n\nThis course is for aspiring or active product leaders who wants to understand how to secure and manage funding for their activities. We will demystify key accounting and financing concepts to give product leaders a guide to developing the business case for their ideas, and securing funding to translate ideas into reality. \n\nThis course focuses on four key areas:\n\n• Learning the fundamentals and how to create financial statements for new ventures within the corporate environment;\n• Examining valuation techniques for understanding how to assess and grow the value of the corporate venture;\n• Exploring the different sources of internal and external financing for the corporate venture; and\n• Applying lessons learned in the course to structure a funding deal and pitch the corporate venture.\n\nSHOW ALL ABOUT FINANCIAL MANAGEMENT FOR PRODUCT LEADERS\nSHOW ALL"
    },
    "/specializations/unity-xr",
    {
       "Url":"/learn/xr-introduction?specialization=unity-xr",
       "name":"Introduction to XR: VR, AR, and MR Foundations",
       "Rating":"Introduction to XR: VR, AR, and MR Foundations\n4.3\nstars\n158 ratings\n•\n45 reviews\n\nWhat is XR? It’s shorthand for a related set of new technologies that are changing the way we interact with the world and with each other: Virtual Reality, Augmented Reality, and Mixed Reality.\n\nTo understand XR, you need to understand the technologies that enable it. If you understand the available technologies, how they are used, and what their future holds, you’ll be well equipped to deal with XR as it rapidly evolves and converges.\n\nIn this course, we will present an introduction to XR using a broadly chronological approach, focusing on how all of the underlying technologies came together at key moments in the history of XR to launch the concepts of Virtual Reality and Augmented Reality into the mainstream consciousness. Throughout the course, we’ll give a brief description of each of the supporting technologies, some history about when it first came into use, limitations and future potential for improvement, and how it’s used for AR, VR, and MR.  \n\nAs you learn about the technology, you’ll also develop hands on experience in the field along two tracks. First, you will use Unity to build and run two simple XR applications on your own smartphone: a “VR Museum” app and a handheld Augmented Reality app. Second, you will brainstorm, define, visualize, and iterate your own original concept for an XR application, ending the course with a thorough and peer-reviewed XR Product Brief that you could use as the basis for future development.\n\nThis is the first of three planned courses in Unity's XR Specialization, which include the Mobile VR App Development with Unity course as well as a future course focused on developing Augmented Reality (AR) applications with Unity.\n\nSHOW ALL ABOUT INTRODUCTION TO XR: VR, AR, AND MR FOUNDATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/mobile-vr-app-development-unity?specialization=unity-xr",
       "name":"Mobile VR App Development with Unity",
       "Rating":"Mobile VR App Development with Unity\n3.9\nstars\n34 ratings\n•\n12 reviews\n\n\"The virtual reality and augmented reality industries are growing by leaps and bounds — but finding workers with the right skills can be a challenge.\" - CNBC report \n\nVirtual and Augmented Reality are poised to revolutionize how we interact with computers, with the world and with each other, and Unity is at the forefront of this technology; an estimated 90% of Samsung Gear VR games and 53% of Oculus Rift (games at launch) were Made With Unity. And according to labor market analytics company Burning Glass, \"there’s nothing virtual about the jobs in this field. They’re here and now and very real.\" \n\nIn this course, you'll learn how to design, develop, troubleshoot, and publish your own mobile VR applications in Unity for Google Daydream, Gear VR, or Oculus Go devices. Using the very latest techniques recommended by Unity's VR engineers, you'll build a complete VR environment that you can continue to use after the course, while learning to apply best practices in user experience, interaction, teleportation and navigation design for VR. In short, this course will take you from software developer to VR developer. \n\nThis is the second of three courses in Unity's XR Specialization, which includes an Introduction to XR course as well as a planned course focused on developing handheld Augmented Reality (AR) applications with Unity. \n\nThe course assumes that you already have experience developing applications with Unity and that you are comfortable with basic C# programming. It will also be helpful if you are familiar with building other types of apps to run on mobile devices.\n\nSHOW ALL ABOUT MOBILE VR APP DEVELOPMENT WITH UNITY \nSHOW ALL"
    },
    {
       "Url":"/learn/handheld-ar?specialization=unity-xr",
       "name":"Handheld AR App Development with Unity",
       "Rating":"Handheld AR App Development with Unity\n4.0\nstars\n65 ratings\n•\n22 reviews\n\nAugmented Reality, or AR, will transform how we see and interact with the world. And the hardware that makes AR possible is the smartphone that you may already have in your pocket. In this course, you'll learn how to develop your own mobile AR applications in Unity for iOS and Android devices. You'll learn about the features offered by Unity's AR Foundation, and about additional features in ARKit and ARCore. \n\nUsing the very latest techniques recommended by Unity engineers, you'll build a complete AR environment that you can continue to use after the course, while learning to apply best practices in user experience and interaction.\n\nThis is the last of three courses in Unity's XR Specialization, which includes an Introduction to XR course as well as a course focused on developing VR applications with Unity. \n\nNote that, to complete this course, you will need a smartphone capable of running ARKit or ARCore. Compatible devices are listed in the links below:\nhttps://developers.google.com/ar/discover/supported-devices\nhttps://developer.apple.com/library/archive/documentation/DeviceInformation/Reference/iOSDeviceCompatibility/DeviceCompatibilityMatrix/DeviceCompatibilityMatrix.html\n\nThe course also assumes that you already have experience developing applications with Unity and that you are comfortable with basic C# programming. It will also be helpful if you are familiar with building other types of apps to run on mobile devices.\n\nSHOW ALL ABOUT HANDHELD AR APP DEVELOPMENT WITH UNITY\nSHOW ALL"
    },
    "/specializations/emarketing",
    {
       "Url":"/learn/identifying-attracting-and-growing-your-digital-audience?specialization=emarketing",
       "name":"Identifying, Attracting, and Growing Your Digital Audience",
       "Rating":"Identifying, Attracting, and Growing Your Digital Audience\n4.7\nstars\n117 ratings\n•\n35 reviews\n\nWelcome to Course 1 of the E-Marketing Specialization: Identifying, Attracting, and Growing Your Digital Audience. In this course, we will begin with a brief introduction to digital marketing and how a brand’s identity is closely linked to its digital presence. We will explore strategies to identify, grow, and maintain an online audience to help achieve your marketing goals. \n\nYou are highly encouraged to use this course experience to begin building a digital marketing plan for your current or future business. The activities in this course are all designed to guide you through different sections of a digital marketing plan. \n\nOur learning goals for this course are to:\n\n- Recognize the current landscape of the digital business environment.\n- Develop an audience persona based on a target audience.\n- Identify strategies to define, attract, and engage your audience online.\n- Review an e-commerce experience and discuss how to improve customer experience.\n- Compare social networks and develop a social media strategy designed to meet your marketing goals and objectives.\n\nSHOW ALL ABOUT IDENTIFYING, ATTRACTING, AND GROWING YOUR DIGITAL AUDIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/strategies-for-converting-and-retaining-customers-online?specialization=emarketing",
       "name":"Strategies for Converting and Retaining Customers Online",
       "Rating":"Strategies for Converting and Retaining Customers Online\n4.7\nstars\n28 ratings\n•\n3 reviews\n\nWelcome to Course 2 of the E-Marketing Specialization: Strategies for Converting and Retaining Customers Online. In this course, we will begin with an introduction to Search Engine Marketing. We will then explore elements of an effective marketing campaign, landing pages, and strategies for converting and retaining your customer base. \n\nYou are highly encouraged to use this course experience to begin building a digital marketing plan for your current or future business. The activities in this course are all designed to guide you through different sections of a digital marketing plan. \n\nOur learning goals for this course are to:\n- Explore how to leverage keywords and search engine marketing in your ad campaigns\n- Develop a sample pay per click (PPC) ad campaign that aligns with your marketing goals\n- Analyze a landing page and identify successful and unsuccessful elements\n- Recognize how to apply calls-to-action to increase customer conversion\n- Identify tactics of customer conversion and retention to add to your digital marketing plan\n\nSHOW ALL ABOUT STRATEGIES FOR CONVERTING AND RETAINING CUSTOMERS ONLINE\nSHOW ALL"
    },
    {
       "Url":"/learn/mobile-marketing-optimization-tactics-and-analytics?specialization=emarketing",
       "name":"Mobile Marketing, Optimization Tactics, and Analytics",
       "Rating":"Mobile Marketing, Optimization Tactics, and Analytics\n4.6\nstars\n13 ratings\n•\n2 reviews\n\nWelcome to Course 3 of the E-Marketing Specialization: Mobile Marketing Optimization Tactics, and Analytics. Our final course will start with an introduction to mobile marketing. The remaining modules will provide you with the knowledge needed to increase sales, boost engagement, and interpret website analytics. This course will culminate in a peer-reviewed activity, in which you will have the opportunity to apply all the skills you have learned throughout the previous courses in this series. \n\nYou are highly encouraged to use this course experience to begin building a digital marketing plan for your current or future business. The activities in this course are all designed to guide you through different sections of a digital marketing plan. \n\nOur learning goals for this course are to:\n- Identify the elements of a mobile marketing strategy and examine the various considerations associated with choosing a mobile platform\n- Explore the various methods to enhance a mobile experience\n- Analyze and optimize marketing efforts to improve business outcomes\n- Develop a digital marketing plan designed to meet your goals and objectives\n\nSHOW ALL ABOUT MOBILE MARKETING, OPTIMIZATION TACTICS, AND ANALYTICS\nSHOW ALL"
    },
    "/specializations/wharton-entrepreneurship",
    {
       "Url":"/learn/wharton-entrepreneurship-opportunity?specialization=wharton-entrepreneurship",
       "name":"Entrepreneurship 1: Developing the Opportunity",
       "Rating":"Entrepreneurship 1: Developing the Opportunity\n4.8\nstars\n3,703 ratings\n•\n801 reviews\n\nHow does a good idea become a viable business opportunity? What is entrepreneurship and who fits the profile of an entrepreneur? This introductory course is designed to introduce you to the foundational concepts of entrepreneurship, including the definition of entrepreneurship, the profile of the entrepreneur, the difference between entrepreneurship and entrepreneurial management, and the role of venture creation in society. You’ll explore where technology entrepreneurship and impact entrepreneurship align and where they diverge, and you’ll learn proven techniques for identifying the opportunity, assessing the opportunity, hypothesis testing and creating a prototype.\n\nBy the end of this course, you’ll know how to test, validate and prototype your idea, and also whether or not you fit the profile of an entrepreneur! You’ll also be ready to move on to the next phase of entrepreneurship in Entrepreneurship 2: Launching the Start-Up.\n\nSHOW ALL ABOUT ENTREPRENEURSHIP 1: DEVELOPING THE OPPORTUNITY\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-launching-startup?specialization=wharton-entrepreneurship",
       "name":"Entrepreneurship 2: Launching your Start-Up",
       "Rating":"Entrepreneurship 2: Launching your Start-Up\n4.8\nstars\n1,796 ratings\n•\n245 reviews\n\nOnce you have a prototype and a clearer vision of the opportunity, you’ll need to create a small organization to discover how to create a repeatable and scalable business model. Designed to provide you with a comprehensive overview of the critical components of creating a start-up, Entrepreneurship 2: Launching the Start-up, provides practical, real-world knowledge about the lean approach, the minimum viable product, when to pivot, when to quit your day job, the art of the pitch, building and managing a team, allocating equity, and building your external team, advisory board members, professional services, and entrepreneurial strategy. At the end of this course, you’ll be able to create a strategy for launch, including knowing who you need to hire, how to manage them to provide the greatest value, and what legal aspects are involved. You’ll also be prepared for Entrepreneurship 3: Growth Strategies.\n\nSHOW ALL ABOUT ENTREPRENEURSHIP 2: LAUNCHING YOUR START-UP\nSHOW ALL"
    },
    {
       "Url":"/learn/growth-strategy?specialization=wharton-entrepreneurship",
       "name":"Entrepreneurship 3: Growth Strategies",
       "Rating":"Entrepreneurship 3: Growth Strategies\n4.8\nstars\n1,285 ratings\n•\n152 reviews\n\nStart-ups are designed to grow quickly, but successful start-ups grow smart. This course is designed to provide you with an understanding of the essential elements of successful scaling, including an overview of demand generation, customer acquisition, adoption, diffusion and forecasting demand. You’ll also learn how to market effectively using best practices of digital marketing, social media, PR, SEO, and pricing. Finally, you’ll cover the nuts and bolts of building a sales process, partnerships and supply relationships, and examine the crucial components of attracting, developing and retaining talent. By the end of this course, you’ll have an outline of an expansion strategy for your idea or enterprise, and also be ready for Entrepreneurship 4: Financing and Profitability\n\nSHOW ALL ABOUT ENTREPRENEURSHIP 3: GROWTH STRATEGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-entrepreneurship-financing-profitabilty?specialization=wharton-entrepreneurship",
       "name":"Entrepreneurship 4: Financing and Profitability",
       "Rating":"Entrepreneurship 4: Financing and Profitability\n4.8\nstars\n1,048 ratings\n•\n132 reviews\n\nStart-ups can benefit from a wide variety of financing options on the path to profitability, but how do you know which one to choose? This course explores different financing models, including bootstrapping, organic growth, debt and risk capital, and also provides a clear overview of equity financing including the key types of investors: angels, venture capital, and crowdfunding. You’ll learn about terms, and term sheets, exit modes and what exit strategy might be best for you. By the end of this course, you’ll have an understanding of what success looks like and how it can be financed. You’ll also be ready for the capstone project, in which you will get feedback on your own pitch deck, and may even be selected to pitch to investors from venture capital firms.\n\nSHOW ALL ABOUT ENTREPRENEURSHIP 4: FINANCING AND PROFITABILITY\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-entrepreneurship-capstone?specialization=wharton-entrepreneurship",
       "name":"Wharton Entrepreneurship Capstone",
       "Rating":"Wharton Entrepreneurship Capstone\n4.8\nstars\n214 ratings\n•\n54 reviews\n\nIn this Capstone project, you will be assembling a pitch deck for a new venture, including the key deliverables (e.g., customer needs, concept description, financials, and so forth).  You will review your peers' projects according to a rubric develop by Wharton Entrepreneurship and practice applying the same criteria VC’s use in evaluating potential investments.\n\nSHOW ALL ABOUT WHARTON ENTREPRENEURSHIP CAPSTONE\nSHOW ALL"
    },
    "/specializations/gis",
    {
       "Url":"/learn/gis?specialization=gis",
       "name":"Fundamentals of GIS",
       "Rating":"Fundamentals of GIS\n4.8\nstars\n4,681 ratings\n•\n1,454 reviews\n\nExplore the world of spatial analysis and cartography with geographic information systems (GIS). In this class you will learn the basics of the industry’s leading software tool, ArcGIS, during four week-long modules: \n\nWeek 1: Learn how GIS grew from paper maps to the globally integrated electronic software packages of today. You will install ArcGIS on your computer and learn how to use online help to answer technical questions.\n\nWeek 2: Open up ArcGIS and explore data using ArcMap. Learn the foundational concepts of GIS, how to analyze data, and make your first map.\n\nWeek 3: Make your own maps! Symbolize data and create an eye-catching final product. \n\nWeek 4: Share your data and maps and learn to store and organize your data.\n\nTake Fundamentals of GIS as a standalone course or as part of the Geographic Information Systems (GIS) Specialization. By completing the first class in the Specialization you will gain the skills needed to succeed in the full program.\n\nStudents who need an ArcGIS license will receive a non-commercial, 1 year student license for participation in this course and specialization.\n\nSHOW ALL ABOUT FUNDAMENTALS OF GIS\nSHOW ALL"
    },
    {
       "Url":"/learn/gis-data?specialization=gis",
       "name":"GIS Data Formats, Design and Quality",
       "Rating":"GIS Data Formats, Design and Quality\n4.9\nstars\n1,851 ratings\n•\n402 reviews\n\nIn this course, the second in the Geographic Information Systems (GIS) Specialization, you will go in-depth with common data types (such as raster and vector data), structures, quality and storage during four week-long modules: \n\nWeek 1: Learn about data models and formats, including a full understanding of vector data and raster concepts. You will also learn about the implications of a data’s scale and how to load layers from web services. \n\nWeek 2: Create a vector data model by using vector attribute tables, writing query strings, defining queries, and adding and calculating fields. You'll also learn how to create new data through the process of digitizing and you'll use the built-in Editor tools in ArcGIS.\n\nWeek 3: Learn about common data storage mechanisms within GIS, including geodatabases and shapefiles. Learn how to choose between them for your projects and how to optimize them for speed and size. You'll also work with rasters for the first time, using digital elevation models and creating slope and distance analysis products.\n\nWeek 4: Explore datasets and assess them for quality and uncertainty.  You will also learn how to bring your maps and data to the Internet and create web maps quickly with ArcGIS Online.\n\nTake GIS Data Formats, Design and Quality as a standalone course or as part of the Geographic Information Systems (GIS) Specialization. You should have equivalent experience to completing the first course in this specialization, Fundamentals of GIS, before taking this course. By completing the second class in the Specialization you will gain the skills needed to succeed in the full program.\n\nSHOW ALL ABOUT GIS DATA FORMATS, DESIGN AND QUALITY\nSHOW ALL"
    },
    {
       "Url":"/learn/spatial-analysis?specialization=gis",
       "name":"Geospatial and Environmental Analysis",
       "Rating":"Geospatial and Environmental Analysis\n4.8\nstars\n1,084 ratings\n•\n241 reviews\n\nApply your GIS knowledge in this course on geospatial analysis, focusing on analysis tools,  3D data, working with rasters, projections, and environment variables. Through all four weeks of this course, we'll work through a project together - something unique to this course - from project conception, through data retrieval, initial data management and processing, and finally to our analysis products.\n\nIn this class you will learn the fundamentals of geospatial and environmental analysis during four week-long modules:\n\nWeek 1: Tour ArcToolbox and learn how to use common geospatial analysis tools built into ArcGIS\n\nWeek 2: Gain a working understanding of raster data models: symbolize, reproject, overlay, and assess rasters. Take a detour into 3D data models, and interpolation of observations into 3D surfaces and rasters\n\nWeek 3: Go in-depth on projections and coordinate systems, which are foundational to all GIS. Learn how to use environment variables to constrain your analyses and get better quality data products.\n\nWeek 4: Expand your knowledge of symbology. Learn how to visually display your data by classifying it in logical groupings and then symbolizing it on your map.\n\nTake Geospatial and Environmental Analysis as a standalone course or as part of the Geographic Information Systems (GIS) Specialization. You should have equivalent experience to completing the first and second courses in this specialization, \"Fundamentals of GIS\" and \"GIS Data Formats, Design, and Quality\", before taking this course. By completing this third class in the Specialization you will gain the skills needed to succeed in the full program.\n\nSHOW ALL ABOUT GEOSPATIAL AND ENVIRONMENTAL ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/gis-applications?specialization=gis",
       "name":"Imagery, Automation, and Applications",
       "Rating":"Imagery, Automation, and Applications\n4.9\nstars\n616 ratings\n•\n126 reviews\n\nWelcome to the last course of the specialization (unless your continuing on to the capstone project, of course!). \n\nUsing the knowledge you’ve learned about ArcGIS, complete technical tasks such raster calculations and suitability analysis. In this class you will become comfortable with spatial analysis and applications within GIS during four week-long modules:\n\nWeek 1: You'll learn all about remotely sensed and satellite imagery, and be introduced to the electromagnetic spectrum. At the end of this week, you'll be able to find and download satellite imagery online and use it for two common types of analysis: NDVI and trained classification.\n\nWeek 2: You'll learn how to use ModelBuilder to create large processing workflows that use parameters, preconditions, variables, and a new set of tools. We'll also explore a few topics that we don't really have time to discuss in detail, but might whet your appetite for future learning in other avenues: geocoding, time-enabled data, spatial statistics, and ArcGIS Pro.\n\nWeek 3: In week three, we'll make and use digital elevation models using some new, specific tools such as the cut fill tool, hillshades, viewsheds and more. We'll also go through a few common algorithms including a very important one: the suitability analysis.\n\nWeek 4: We'll begin the final week by talking about a few spatial analyst tools we haven't yet touched on in the specialization: Region Group to make our own zones, Focal Statistics to smooth a hillshade, Reclassify to change values, and Point Density to create a density surface. Finally, we'll wrap up by talking about a few more things that you might want to explore more as you start working on learning about GIS topics on your own.\n\nTake Geospatial and Environmental Analysis as a standalone course or as part of the Geographic Information Systems (GIS) Specialization. You should have equivalent experience to completing the first, second, and third courses in this specialization, \"Fundamentals of GIS,\" \"GIS Data Formats, Design, and Quality\", and \"Geospatial and Environmental Analysis,\" respectively, before taking this course. By completing the fourth class you will gain the skills needed to succeed in the Specialization capstone.\n\nSHOW ALL ABOUT IMAGERY, AUTOMATION, AND APPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/gis-capstone?specialization=gis",
       "name":"Geospatial Analysis Project",
       "Rating":"Geospatial Analysis Project\n4.8\nstars\n228 ratings\n•\n69 reviews\n\nIn this project-based course, you will design and execute a complete GIS-based analysis – from identifying a concept, question or issue you wish to develop, all the way to final data products and maps that you can add to your portfolio. Your completed project will demonstrate your mastery of the content in the GIS Specialization and is broken up into four phases:\n\nMilestone 1: Project Proposal - Conceptualize and design your project in the abstract, and write a short proposal that includes the project description, expected data needs, timeline, and how you expect to complete it.\n\nMilestone 2: Workflow Design - Develop the analysis workflow for your project, which will typically involve creating at least one core algorithm for processing your data. The model need not be complex or complicated, but it should allow you to analyze spatial data for a new output or to create a new analytical map of some type.\n\nMilestone 3: Data Analysis – Obtain and preprocess data, run it through your models or other workflows in order to get your rough data products, and begin creating your final map products and/or analysis.\n\nMilestone 4: Web and Print Map Creation – Complete your project by submitting usable and attractive maps and your data and algorithm for peer review and feedback.\n\nSHOW ALL ABOUT GEOSPATIAL ANALYSIS PROJECT\nSHOW ALL"
    },
    "/specializations/business-analytics",
    {
       "Url":"/learn/wharton-customer-analytics?specialization=business-analytics",
       "name":"Customer Analytics",
       "Rating":"Customer Analytics\n4.6\nstars\n10,444 ratings\n•\n2,289 reviews\n\nData about our browsing and buying patterns are everywhere.  From credit card transactions and online shopping carts, to customer loyalty programs and user-generated ratings/reviews, there is a staggering amount of data that can be used to describe our past buying behaviors, predict future ones, and prescribe new ways to influence future purchasing decisions. In this course, four of Wharton’s top marketing professors will provide an overview of key areas of customer analytics: descriptive analytics, predictive analytics, prescriptive analytics, and their application to real-world business practices including Amazon, Google, and Starbucks to name a few. This course provides an overview of the field of analytics so that you can make informed business decisions. It is an introduction to the theory of customer analytics, and is not intended to prepare learners to perform customer analytics. \n\nCourse Learning Outcomes: \n\nAfter completing the course learners will be able to...\n\nDescribe the major methods of customer data collection used by companies and understand how this data can inform business decisions\n\nDescribe the main tools used to predict customer behavior and identify the appropriate uses for each tool \n\nCommunicate key ideas about customer analytics and how the field informs business decisions\n\nCommunicate the history of customer analytics and latest best practices at top firms\n\nSHOW ALL ABOUT CUSTOMER ANALYTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-operations-analytics?specialization=business-analytics",
       "name":"Operations Analytics",
       "Rating":"Operations Analytics\n4.7\nstars\n4,721 ratings\n•\n916 reviews\n\nThis course is designed to impact the way you think about transforming data into better decisions. Recent extraordinary improvements in data-collecting technologies have changed the way firms make informed and effective business decisions. The course on operations analytics, taught by three of Wharton’s leading experts, focuses on how the data can be used to profitably match supply with demand in various business settings. In this course, you will learn how to model future demand uncertainties, how to predict the outcomes of competing policy choices and how to choose the best course of action in the face of risk. The course will introduce frameworks and ideas that provide insights into a spectrum of real-world business challenges, will teach you methods and software available for tackling these challenges quantitatively as well as the issues involved in gathering the relevant data.\n\nThis course is appropriate for beginners and business professionals with no prior analytics experience.\n\nSHOW ALL ABOUT OPERATIONS ANALYTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-people-analytics?specialization=business-analytics",
       "name":"People Analytics",
       "Rating":"People Analytics\n4.5\nstars\n5,311 ratings\n•\n1,008 reviews\n\nPeople analytics is a data-driven approach to managing people at work. For the first time in history, business leaders can make decisions about their people based on deep analysis of data rather than the traditional methods of personal relationships, decision making based on experience, and risk avoidance. In this brand new course, three of Wharton’s top professors, all pioneers in the field of people analytics, will explore the state-of-the-art techniques used to recruit and retain great people, and demonstrate how these techniques are used at cutting-edge companies. They’ll explain how data and sophisticated analysis is brought to bear on people-related issues, such as recruiting, performance evaluation, leadership, hiring and promotion, job design, compensation, and collaboration. This course is an introduction to the theory of people analytics, and is not intended to prepare learners to perform complex talent management data analysis. By the end of this course, you’ll understand how and when hard data is used to make soft-skill decisions about hiring and talent development, so that you can position yourself as a strategic partner in your company’s talent management decisions. This course is intended to introduced you to Organizations flourish when the people who work in them flourish. Analytics can help make both happen. This course in People Analytics is designed to help you flourish in your career, too.\n\nSHOW ALL ABOUT PEOPLE ANALYTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/accounting-analytics?specialization=business-analytics",
       "name":"Accounting Analytics",
       "Rating":"Accounting Analytics\n4.5\nstars\n2,753 ratings\n•\n513 reviews\n\nAccounting Analytics explores how financial statement data and non-financial metrics can be linked to financial performance.  In this course, taught by Wharton’s acclaimed accounting professors, you’ll learn how data is used to assess what drives financial performance and to forecast future financial scenarios. While many accounting and financial organizations deliver data, accounting analytics deploys that data to deliver insight, and this course will explore the many areas in which accounting data provides insight into other business areas including consumer behavior predictions, corporate strategy, risk management, optimization, and more. By the end of this course, you’ll understand how financial data and non-financial data interact to forecast events, optimize operations, and determine strategy. This course has been designed to help you make better business decisions about the emerging roles of accounting analytics, so that you can apply what you’ve learned to make your own business decisions and create strategy using financial data. \n\nSHOW ALL ABOUT ACCOUNTING ANALYTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-capstone-analytics?specialization=business-analytics",
       "name":"Business Analytics Capstone",
       "Rating":"Business Analytics Capstone\n4.5\nstars\n646 ratings\n•\n158 reviews\n\nThe Business Analytics Capstone Project gives you the opportunity to apply what you've learned about how to make data-driven decisions to a real business challenge faced by global technology companies like Yahoo, Google, and Facebook. At the end of this Capstone, you'll be able to ask the right questions of the data, and know how to use data effectively to address business challenges of your own. You’ll understand how cutting-edge businesses use data to optimize marketing, maximize revenue, make operations efficient, and make hiring and management decisions so that you can apply these strategies to your own company or business. Designed with Yahoo to give you invaluable experience in evaluating and creating data-driven decisions, the Business Analytics Capstone Project provides the chance for you to devise a plan of action for optimizing data itself to provide key insights and analysis, and to describe the interaction between key financial and non-financial indicators. Once you complete your analysis, you'll be better prepared to make better data-driven business decisions of your own.\n\nSHOW ALL ABOUT BUSINESS ANALYTICS CAPSTONE\nSHOW ALL"
    },
    "/specializations/seo",
    {
       "Url":"/learn/search-engine-optimization?specialization=seo",
       "name":"Introduction to Google SEO",
       "Rating":"Introduction to Google SEO\n4.6\nstars\n8,270 ratings\n•\n2,232 reviews\n\nEver wonder how major search engines such as Google, Bing and Yahoo rank your website within their searches? Or how content such as videos or local listings are shown and ranked based on what the search engine considers most relevant to users? Welcome to the world of Search Engine Optimization (SEO). This course is the first within the SEO Specialization and it is intended to give you a taste of SEO with some fun practices to get seen in Google.\n\nYou will be introduced to the foundational elements of how the most popular search engine, Google, works, how the SEO landscape is constantly changing and what you can expect in the future. You discuss core SEO strategies and tactics used to drive more organic search results to a specific website or set of websites, as well as tactics to avoid to prevent penalization from Google. We hope this taste of SEO, will entice you to continue through the Specialization!\n\nSHOW ALL ABOUT INTRODUCTION TO GOOGLE SEO\nSHOW ALL"
    },
    {
       "Url":"/learn/seo-fundamentals?specialization=seo",
       "name":"Google SEO Fundamentals",
       "Rating":"Google SEO Fundamentals\n4.7\nstars\n2,619 ratings\n•\n610 reviews\n\nGain an understanding of search engine algorithms and how they affect organic search results and websites. Building on this knowledge, you’ll learn the key elements for creating an effective SEO strategy, including how to select keywords and perform keyword research; consumer psychology and search behavior; and how to conduct on-page SEO analysis to identify opportunities to improve a website’s search optimization.\n\nSHOW ALL ABOUT GOOGLE SEO FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/optimizing-web-search?specialization=seo",
       "name":"Optimizing a Website for Google Search",
       "Rating":"Optimizing a Website for Google Search\n4.7\nstars\n1,323 ratings\n•\n278 reviews\n\nLearn the ins and outs of optimizing a website, from conducting an initial audit to presenting your findings and recommendations. Hands-on activities include learning how to select and apply appropriate keywords throughout a website, incorporating keyword research in a content marketing strategy, and optimizing a site for local search. You will also learn strategies for setting goals and client/stakeholder expectations, building effective analytics and reports, and communicating SEO improvements.\n\nSHOW ALL ABOUT OPTIMIZING A WEBSITE FOR GOOGLE SEARCH\nSHOW ALL"
    },
    {
       "Url":"/learn/seo-tactics?specialization=seo",
       "name":"Advanced Content and Social Tactics to Optimize SEO",
       "Rating":"Advanced Content and Social Tactics to Optimize SEO\n4.5\nstars\n916 ratings\n•\n199 reviews\n\nDiscover the content marketing and social media ecosystems and how these interconnected channels drive search results to a website. Leverage content marketing and social media as part of your SEO strategy, and how to use influence marketing to establish a website’s authority."
    },
    {
       "Url":"/learn/seo-project?specialization=seo",
       "name":"Google SEO Capstone Project",
       "Rating":"Google SEO Capstone Project\n4.8\nstars\n315 ratings\n•\n75 reviews\n\nSEO is a dynamic and growing career field that demands knowledge and skills in a variety of website optimization strategies and tactics in order to be successful. This course is designed to provide you with a solid foundation in SEO including the different elements comprising a website optimization client report, and arm you with skills you need to develop a tactical approach to SEO. \n\nWhether you have successfully completed the other courses in the Search Engine Optimization specialization or are taking just this course, this project is your chance to apply the knowledge you’ve acquired to practice important SEO tactics and optimize a site of your choice from the ground-up. You will identify optimization opportunities on a site and discover valuable tips for pitching your plan and managing your relationship with your client, you will then develop a customized SEO solution for the website you chose, and go through each of the major steps needed to execute your strategy including keyword research, competitive analysis, improving the site’s meta-data and on-page elements. Along the way, you will receive feedback through the peer review process. This community of fellow learners will provide additional input to help you refine your approach to SEO and present your findings to clients and management.\n\nSHOW ALL ABOUT GOOGLE SEO CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/advanced-statistics-data-science",
    {
       "Url":"/learn/biostatistics?specialization=advanced-statistics-data-science",
       "name":"Mathematical Biostatistics Boot Camp 1",
       "Rating":"Mathematical Biostatistics Boot Camp 1\n4.5\nstars\n384 ratings\n•\n83 reviews\n\nThis class presents the fundamental probability and statistical concepts used in elementary data analysis. It will be taught at an introductory level for students with junior or senior college-level mathematical training including a working knowledge of calculus. A small amount of linear algebra and programming are useful for the class, but not required.\n\nSHOW ALL ABOUT MATHEMATICAL BIOSTATISTICS BOOT CAMP 1\nSHOW ALL"
    },
    {
       "Url":"/learn/biostatistics-2?specialization=advanced-statistics-data-science",
       "name":"Mathematical Biostatistics Boot Camp 2",
       "Rating":"Mathematical Biostatistics Boot Camp 2\n4.4\nstars\n99 ratings\n•\n20 reviews\n\nLearn fundamental concepts in data analysis and statistical inference, focusing on one and two independent samples."
    },
    {
       "Url":"/learn/linear-models?specialization=advanced-statistics-data-science",
       "name":"Advanced Linear Models for Data Science 1: Least Squares",
       "Rating":"Advanced Linear Models for Data Science 1: Least Squares\n4.4\nstars\n157 ratings\n•\n39 reviews\n\nWelcome to the Advanced Linear Models for Data Science Class 1: Least Squares. This class is an introduction to least squares from a linear algebraic and mathematical perspective. Before beginning the class make sure that you have the following:\n\n- A basic understanding of linear algebra and multivariate calculus.\n- A basic understanding of statistics and regression models.\n- At least a little familiarity with proof based mathematics.\n- Basic knowledge of the R programming language.\n\nAfter taking this course, students will have a firm foundation in a linear algebraic treatment of regression modeling. This will greatly augment applied data scientists' general understanding of regression models.\n\nSHOW ALL ABOUT ADVANCED LINEAR MODELS FOR DATA SCIENCE 1: LEAST SQUARES\nSHOW ALL"
    },
    {
       "Url":"/learn/linear-models-2?specialization=advanced-statistics-data-science",
       "name":"Advanced Linear Models for Data Science 2: Statistical Linear Models",
       "Rating":"Advanced Linear Models for Data Science 2: Statistical Linear Models\n4.6\nstars\n70 ratings\n•\n12 reviews\n\nWelcome to the Advanced Linear Models for Data Science Class 2: Statistical Linear Models. This class is an introduction to least squares from a linear algebraic and mathematical perspective. Before beginning the class make sure that you have the following:\n\n- A basic understanding of linear algebra and multivariate calculus.\n- A basic understanding of statistics and regression models.\n- At least a little familiarity with proof based mathematics.\n- Basic knowledge of the R programming language.\n\nAfter taking this course, students will have a firm foundation in a linear algebraic treatment of regression modeling. This will greatly augment applied data scientists' general understanding of regression models.\n\nSHOW ALL ABOUT ADVANCED LINEAR MODELS FOR DATA SCIENCE 2: STATISTICAL LINEAR MODELS\nSHOW ALL"
    },
    "/specializations/machine-learning-engineering-for-production-mlops",
    {
       "Url":"/learn/introduction-to-machine-learning-in-production?specialization=machine-learning-engineering-for-production-mlops",
       "name":"Introduction to Machine Learning in Production",
       "Rating":"Introduction to Machine Learning in Production\n4.8\nstars\n772 ratings\n•\n149 reviews\n\nIn the first course of Machine Learning Engineering for Production Specialization, you will identify the various components and design an ML production system end-to-end: project scoping, data needs, modeling strategies, and deployment constraints and requirements; and learn how to establish a model baseline, address concept drift, and prototype the process for developing, deploying, and continuously improving a productionized ML application.\n\nUnderstanding machine learning and deep learning concepts is essential, but if you’re looking to build an effective AI career, you need production engineering capabilities as well. Machine learning engineering for production combines the foundational concepts of machine learning with the functional expertise of modern software development and engineering roles to help you develop production-ready skills. \n\nWeek 1: Overview of the ML Lifecycle and Deployment\nWeek 2: Selecting and Training a Model\nWeek 3: Data Definition and Baseline\n\nSHOW ALL ABOUT INTRODUCTION TO MACHINE LEARNING IN PRODUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-data-lifecycle-in-production?specialization=machine-learning-engineering-for-production-mlops",
       "name":"Machine Learning Data Lifecycle in Production",
       "Rating":"Machine Learning Data Lifecycle in Production\n4.5\nstars\n196 ratings\n•\n36 reviews\n\nIn the second course of Machine Learning Engineering for Production Specialization, you will build data pipelines by gathering, cleaning, and validating datasets and assessing data quality; implement feature engineering, transformation, and selection with TensorFlow Extended and get the most predictive power out of your data; and establish the data lifecycle by leveraging data lineage and provenance metadata tools and follow data evolution with enterprise data schemas.\n\nUnderstanding machine learning and deep learning concepts is essential, but if you’re looking to build an effective AI career, you need production engineering capabilities as well. Machine learning engineering for production combines the foundational concepts of machine learning with the functional expertise of modern software development and engineering roles to help you develop production-ready skills. \n\nWeek 1: Collecting, Labeling, and Validating data\nWeek 2: Feature Engineering, Transformation, and Selection\nWeek 3: Data Journey and Data Storage\nWeek 4: Advanced Data Labeling Methods, Data Augmentation, and Preprocessing Different Data Types\n\nSHOW ALL ABOUT MACHINE LEARNING DATA LIFECYCLE IN PRODUCTION \nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-modeling-pipelines-in-production?specialization=machine-learning-engineering-for-production-mlops",
       "name":"Machine Learning Modeling Pipelines in Production",
       "Rating":"Machine Learning Modeling Pipelines in Production\n4.6\nstars\n71 ratings\n•\n14 reviews\n\nIn the third course of Machine Learning Engineering for Production Specialization, you will build models for different serving environments; implement tools and techniques to effectively manage your modeling resources and best serve offline and online inference requests; and use analytics tools and performance metrics to address model fairness, explainability issues, and mitigate bottlenecks.\n\nUnderstanding machine learning and deep learning concepts is essential, but if you’re looking to build an effective AI career, you need production engineering capabilities as well. Machine learning engineering for production combines the foundational concepts of machine learning with the functional expertise of modern software development and engineering roles to help you develop production-ready skills.\n\nWeek 1: Neural Architecture Search\nWeek 2: Model Resource Management Techniques\nWeek 3: High-Performance Modeling\nWeek 4: Model Analysis\nWeek 5: Interpretability\n\nSHOW ALL ABOUT MACHINE LEARNING MODELING PIPELINES IN PRODUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/deploying-machine-learning-models-in-production?specialization=machine-learning-engineering-for-production-mlops",
       "name":"Deploying Machine Learning Models in Production",
       "Rating":"Deploying Machine Learning Models in Production\n\nIn the fourth course of Machine Learning Engineering for Production Specialization, you will learn how to deploy ML models and make them available to end-users. You will build scalable and reliable hardware infrastructure to deliver inference requests both in real-time and batch depending on the use case. You will also implement workflow automation and progressive delivery that complies with current MLOps practices to keep your production system running. Additionally,  you will continuously monitor your system to detect model decay, remediate performance drops, and avoid system failures so it can continuously operate at all times.  \n\nUnderstanding machine learning and deep learning concepts is essential, but if you’re looking to build an effective AI career, you need production engineering capabilities as well. Machine learning engineering for production combines the foundational concepts of machine learning with the functional expertise of modern software development and engineering roles to help you develop production-ready skills.\n\nWeek 1: Model Serving Introduction\nWeek 2: Model Serving Patterns and Infrastructures\nWeek 3: Model Management and Delivery\nWeek 4: Model Monitoring and Logging\n\nSHOW ALL ABOUT DEPLOYING MACHINE LEARNING MODELS IN PRODUCTION\nSHOW ALL"
    },
    "/specializations/user-interface-design",
    {
       "Url":"/learn/ui-design?specialization=user-interface-design",
       "name":"Introduction to UI Design",
       "Rating":"Introduction to UI Design\n4.7\nstars\n1,175 ratings\n•\n269 reviews\n\nIn this course, you will gain an understanding of the critical importance of user interface design. You will also learn industry-standard methods for how to approach the design of a user interface and key theories and frameworks that underlie the design of most interfaces you use today.\n\nThrough a series of case studies on commercial systems - many of which you likely use on a regular basis - we will illustrate the benefits of good design. We will also demonstrate how the costs of bad design can often be severe (in user experience, money, and even human lives).\n\nYou will then gain a high-level understanding of the user-interface design process. You will be introduced to common design scenarios - e.g. improving on existing designs and starting a new design from scratch - and the general design processes that tend to be used for each scenario.\n\nFinally, we will begin introducing the large body of existing knowledge on design by providing overviews of core user interface design theories and concepts. This key foundational information will help you avoid “reinventing the wheel” when you are designing your interfaces in this specialization.\n\nSHOW ALL ABOUT INTRODUCTION TO UI DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/design-research?specialization=user-interface-design",
       "name":"User Research and Design",
       "Rating":"User Research and Design\n4.6\nstars\n392 ratings\n•\n66 reviews\n\nIn this course you will learn and practice techniques of user research and early UI design exploration.  First, you will learn and practice several techniques for user research, including in-person research and survey and log-analysis techniques.  Then, you will learn to analyze and deliver user research in forms that support UI design, including personas, use cases, tasks, and scenarios.  Finally, you will learn and practice ideation techniques that start from user research and broadly generate potential design ideas.\n\nSHOW ALL ABOUT USER RESEARCH AND DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/prototyping-design?specialization=user-interface-design",
       "name":"Prototyping and Design",
       "Rating":"Prototyping and Design\n4.6\nstars\n344 ratings\n•\n52 reviews\n\nIn this course you will learn how to design and prototype user interfaces to address the users and tasks identified in user research.  Through a series of lectures and exercises, you will learn and practice paper- and other low-fidelity prototyping techniques; you will learn and apply principles from graphic design, including design patterns; you will learn to write a design rationale; and you will learn how to design for specific populations and situations, including principles and practices of accessible design.\n\nSHOW ALL ABOUT PROTOTYPING AND DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/ui-testing?specialization=user-interface-design",
       "name":"Evaluating User Interfaces",
       "Rating":"Evaluating User Interfaces\n4.7\nstars\n221 ratings\n•\n26 reviews\n\nIn this course you will learn and practice several techniques for user interface evaluation.  First we start with techniques that can be applied alone or in a design team, including action analysis, walkthroughs, and heuristic evaluation.  Then we move on to user testing, including learning from a series of usability tests carried out in a real usability lab, and techniques to carry out your own tests even without a lab.  Finally, we wrap up the discussion of evaluation--and of UI Design in the specialization as a whole--by looking at the question of how to set and measure usability goals, and in turn, when a design is usable enough to release it.\n\nSHOW ALL ABOUT EVALUATING USER INTERFACES\nSHOW ALL"
    },
    "/specializations/project-management",
    {
       "Url":"/learn/project-planning?specialization=project-management",
       "name":"Initiating and Planning Projects",
       "Rating":"Initiating and Planning Projects\n4.7\nstars\n19,946 ratings\n•\n3,792 reviews\n\nThe courses in the Introduction to Project Management Principles and Practices Specialization are a recommended precursor to UCI's Applied Project Management Certificate. \n\nSuccessful projects require careful upfront planning. In this course, you’ll learn the key roles and responsibilities of the project manager and project team. You’ll also learn to answer some key questions upfront to help you meet project objectives: What will this project accomplish? Why is this project important? Who benefits from this project? How will we plan for successful outcomes?\n\nUpon completing this course, you will be able to:\n1.       Identify the key characteristics of a project\n2.       Identify primary project constraints\n3.       Define the role and responsibilities of the project manager\n4.       Identify Project Organizational Structures\n5.       Understand the definition of a Project Stakeholder\n6.       Identify project stakeholders\n7.       Identify information needs of the project stakeholders\n8.       Define responsibility for managing stakeholder and controlling stakeholder engagement\n9.       Define the purpose of using a project charter\n10.     Summarize the key elements of a project plan\n11.     Identify common sources of conflict within a project environment\n12.     Describe the difference between authority and influence\n\nSHOW ALL ABOUT INITIATING AND PLANNING PROJECTS\nSHOW ALL"
    },
    {
       "Url":"/learn/schedule-projects?specialization=project-management",
       "name":"Budgeting and Scheduling Projects",
       "Rating":"Budgeting and Scheduling Projects\n4.7\nstars\n8,378 ratings\n•\n1,115 reviews\n\nA good project schedule helps all team members’ work together to meet project objectives. A project budget with realistic cost constraints is also an essential bedrock of any project. In this course you’ll learn to plan and stick to time and cost constraints in order to ensure the success of your projects.\n\nUpon completing this course, you will be able to:\n1.       Identify the resource needs of the project\n2.       Decompose work packages into activities\n3.       Define what is needed to estimate activity durations\n4.       Define milestones and create a milestone schedule\n5.       Determine the critical path and calculate float\n6.       Describe the purpose of using leads and lags in a project schedule\n7.       Estimate the quantities and costs of resources required to perform project activities\n8.       Select one of three common cost estimating techniques to determine a project budget\n9.       Use a responsibility assignment matrix to assign responsibilities\n10.     Recognize the components of a project’s quality management plan\n\nSHOW ALL ABOUT BUDGETING AND SCHEDULING PROJECTS\nSHOW ALL"
    },
    {
       "Url":"/learn/project-risk-management?specialization=project-management",
       "name":"Managing Project Risks and Changes",
       "Rating":"Managing Project Risks and Changes\n4.7\nstars\n8,099 ratings\n•\n1,051 reviews\n\nThis course will help you manage project risk effectively by identifying, analyzing, and communicating inevitable changes to project scope and objectives. You will understand and practice the elements needed to measure and report on project scope, schedule, and cost performance. You will be equipped with the tools to manage change in the least disruptive way possible for your team and other project stakeholders.\n\nUpon completing this course, you will be able to:\n1.       Define components of a communications management plan\n2.       Understand the importance of communications channels\n3.       Define the key elements needed to measure and report on project scope, schedule, and cost performance\n4.       Identify project risk events\n5.       Prioritize identified risks\n6.       Develop responses for a high priority risk\n7.       Identify and analyze changes to project scope\n8.       Describe causes and effects of project changes\n9.       Define the purpose of conducting a lessons learned session\n\nSHOW ALL ABOUT MANAGING PROJECT RISKS AND CHANGES\nSHOW ALL"
    },
    {
       "Url":"/learn/project-management-capstone?specialization=project-management",
       "name":"Project Management Project",
       "Rating":"Project Management Project\n4.8\nstars\n2,759 ratings\n•\n512 reviews\n\nThis capstone project is designed to allow you to take the knowledge you have gained through the Specialization and put that knowledge into practice. In the capstone, you will create several of the key planning deliverables that have been discussed in these courses and either work on a project you choose or use a suggested case study. You will begin the capstone project by writing part of the project charter. You will build on that information to define your project, and then ultimately create a schedule, budget and responses for the risks you identify.  The goal is for you to use what you have learned in the previous courses and to perform your own research on how to best move forward with the capstone project.  Your work will be peer reviewed by your classmates. In turn you will peer review the work of other classmates.  Instructions on how to conduct peer reviews will be included in the course.  Upon completing this series, you will be able to (1) write a narrative charter statement, (2) create a work breakdown structure, (3) sequence project activities,(4) build a project schedule, (5) create a project budget, (6) create a responsibility assignment matrix, (7) identify project risks and (8) define responses for those risks.\n\nUpon completing this course, you will be able to:\n1.       Write a narrative charter statement\n2.       Create a work breakdown structure\n3.       Sequence project activities\n4.       Build a project schedule\n5.       Create a project budget\n6.       Create a responsibility assignment matrix\n7.       Identify project risks and define responses for those risks\n\nSHOW ALL ABOUT PROJECT MANAGEMENT PROJECT\nSHOW ALL"
    },
    "/specializations/mathematics-machine-learning",
    {
       "Url":"/learn/linear-algebra-machine-learning?specialization=mathematics-machine-learning",
       "name":"Mathematics for Machine Learning: Linear Algebra",
       "Rating":"Mathematics for Machine Learning: Linear Algebra\n4.7\nstars\n10,061 ratings\n•\n2,026 reviews\n\nIn this course on Linear Algebra we look at what linear algebra is and how it relates to vectors and matrices. Then we look through what vectors and matrices are and how to work with them, including the knotty problem of eigenvalues and eigenvectors, and how to use these to solve problems. Finally  we look at how to use these to do fun things with datasets - like how to rotate images of faces and how to extract eigenvectors to look at how the Pagerank algorithm works.\n\nSince we're aiming at data-driven applications, we'll be implementing some of these ideas in code, not just on pencil and paper. Towards the end of the course, you'll write code blocks and encounter Jupyter notebooks in Python, but don't worry, these will be quite short, focussed on the concepts, and will guide you through if you’ve not coded before.\n\nAt the end of this course you will have an intuitive understanding of vectors and matrices that will help you bridge the gap into linear algebra problems, and how to apply these concepts to machine learning.\n\nSHOW ALL ABOUT MATHEMATICS FOR MACHINE LEARNING: LINEAR ALGEBRA\nSHOW ALL"
    },
    {
       "Url":"/learn/multivariate-calculus-machine-learning?specialization=mathematics-machine-learning",
       "name":"Mathematics for Machine Learning: Multivariate Calculus",
       "Rating":"Mathematics for Machine Learning: Multivariate Calculus\n4.7\nstars\n4,841 ratings\n•\n863 reviews\n\nThis course offers a brief introduction to the multivariate calculus required to build many common machine learning techniques. We start at the very beginning with a refresher on the “rise over run” formulation of a slope, before converting this to the formal definition of the gradient of a function. We then start to build up a set of tools for making calculus easier and faster. Next, we learn how to calculate vectors that point up hill on multidimensional surfaces and even put this into action using an interactive game. We take a look at how we can use calculus to build approximations to functions, as well as helping us to quantify how accurate we should expect those approximations to be. We also spend some time talking about where calculus comes up in the training of neural networks, before finally showing you how it is applied in linear regression models. This course is intended to offer an intuitive understanding of calculus, as well as the language necessary to look concepts up yourselves when you get stuck. Hopefully, without going into too much detail, you’ll still come away with the confidence to dive into some more focused machine learning courses in future.\n\nSHOW ALL ABOUT MATHEMATICS FOR MACHINE LEARNING: MULTIVARIATE CALCULUS\nSHOW ALL"
    },
    {
       "Url":"/learn/pca-machine-learning?specialization=mathematics-machine-learning",
       "name":"Mathematics for Machine Learning: PCA",
       "Rating":"Mathematics for Machine Learning: PCA\n4.0\nstars\n2,668 ratings\n•\n671 reviews\n\nThis intermediate-level course introduces the mathematical foundations to derive Principal Component Analysis (PCA), a fundamental dimensionality reduction technique. We'll cover some basic statistics of data sets, such as mean values and variances, we'll compute distances and angles between vectors using inner products and derive orthogonal projections of data onto lower-dimensional subspaces. Using all these tools, we'll then derive PCA as a method that minimizes the average squared reconstruction error between data points and their reconstruction.\n\nAt the end of this course, you'll be familiar with important mathematical concepts and you can implement PCA all by yourself. If you’re struggling, you'll find a set of jupyter notebooks that will allow you to explore properties of the techniques and walk you through what you need to do to get on track. If you are already an expert, this course may refresh some of your knowledge.\n\nThe lectures, examples and exercises require:\n1. Some ability of abstract thinking\n2. Good background in linear algebra (e.g., matrix and vector algebra, linear independence, basis)\n3. Basic background in multivariate calculus (e.g., partial derivatives, basic optimization)\n4. Basic knowledge in python programming and numpy\n\nDisclaimer: This course is substantially more abstract and requires more programming than the other two courses of the specialization. However, this type of abstract thinking, algebraic manipulation and programming is necessary if you want to understand and develop machine learning algorithms.\n\nSHOW ALL ABOUT MATHEMATICS FOR MACHINE LEARNING: PCA\nSHOW ALL"
    },
    "/specializations/jhu-data-science",
    {
       "Url":"/learn/data-scientists-tools?specialization=jhu-data-science",
       "name":"The Data Scientist’s Toolbox",
       "Rating":"The Data Scientist’s Toolbox\n4.6\nstars\n32,164 ratings\n•\n6,874 reviews\n\nIn this course you will get an introduction to the main tools and ideas in the data scientist's toolbox. The course gives an overview of the data, questions, and tools that data analysts and data scientists work with. There are two components to this course. The first is a conceptual introduction to the ideas behind turning data into actionable knowledge. The second is a practical introduction to the tools that will be used in the program like version control, markdown, git, GitHub, R, and RStudio.\n\nSHOW ALL ABOUT THE DATA SCIENTIST’S TOOLBOX\nSHOW ALL"
    },
    {
       "Url":"/learn/r-programming?specialization=jhu-data-science",
       "name":"R Programming",
       "Rating":"R Programming\n4.5\nstars\n21,187 ratings\n•\n4,574 reviews\n\nIn this course you will learn how to program in R and how to use R for effective data analysis. You will learn how to install and configure software necessary for a statistical programming environment and describe generic programming language concepts as they are implemented in a high-level statistical language. The course covers practical issues in statistical computing which includes programming in R, reading data into R, accessing R packages, writing R functions, debugging, profiling R code, and organizing and commenting R code. Topics in statistical data analysis will provide working examples.\n\nSHOW ALL ABOUT R PROGRAMMING\nSHOW ALL"
    },
    {
       "Url":"/learn/data-cleaning?specialization=jhu-data-science",
       "name":"Getting and Cleaning Data",
       "Rating":"Getting and Cleaning Data\n4.6\nstars\n7,839 ratings\n•\n1,280 reviews\n\nBefore you can work with data you have to get some. This course will cover the basic ways that data can be obtained. The course will cover obtaining data from the web, from APIs, from databases and from colleagues in various formats. It will also cover the basics of data cleaning and how to make data “tidy”. Tidy data dramatically speed downstream data analysis tasks. The course will also cover the components of a complete data set including raw data, processing instructions, codebooks, and processed data. The course will cover the basics needed for collecting, cleaning, and sharing data.\n\nSHOW ALL ABOUT GETTING AND CLEANING DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/exploratory-data-analysis?specialization=jhu-data-science",
       "name":"Exploratory Data Analysis",
       "Rating":"Exploratory Data Analysis\n4.7\nstars\n5,903 ratings\n•\n859 reviews\n\nThis course covers the essential exploratory techniques for summarizing data. These techniques are typically applied before formal modeling commences and can help inform the development of more complex statistical models. Exploratory techniques are also important for eliminating or sharpening potential hypotheses about the world that can be addressed by the data. We will cover in detail the plotting systems in R as well as some of the basic principles of constructing data graphics. We will also cover some of the common multivariate statistical techniques used to visualize high-dimensional data.\n\nSHOW ALL ABOUT EXPLORATORY DATA ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/reproducible-research?specialization=jhu-data-science",
       "name":"Reproducible Research",
       "Rating":"Reproducible Research\n4.6\nstars\n4,065 ratings\n•\n584 reviews\n\nThis course focuses on the concepts and tools behind reporting modern data analyses in a reproducible manner. Reproducible research is the idea that data analyses, and more generally, scientific claims, are published with their data and software code so that others may verify the findings and build upon them.  The need for reproducibility is increasing dramatically as data analyses become more complex, involving larger datasets and more sophisticated computations. Reproducibility allows for people to focus on the actual content of a data analysis, rather than on superficial details reported in a written summary. In addition, reproducibility makes an analysis more useful to others because the data and code that actually conducted the analysis are available. This course will focus on literate statistical analysis tools which allow one to publish data analyses in a single document that allows others to easily execute the same analysis to obtain the same results.\n\nSHOW ALL ABOUT REPRODUCIBLE RESEARCH\nSHOW ALL"
    },
    {
       "Url":"/learn/statistical-inference?specialization=jhu-data-science",
       "name":"Statistical Inference",
       "Rating":"Statistical Inference\n4.2\nstars\n4,279 ratings\n•\n863 reviews\n\nStatistical inference is the process of drawing conclusions about populations or scientific truths from data. There are many modes of performing inference including statistical modeling, data oriented strategies and explicit use of designs and randomization in analyses. Furthermore, there are broad theories (frequentists, Bayesian, likelihood, design based, …) and numerous complexities (missing data, observed and unobserved confounding, biases) for performing inference. A practitioner can often be left in a debilitating maze of techniques, philosophies and nuance. This course presents the fundamentals of inference in a practical approach for getting things done. After taking this course, students will understand the broad directions of statistical inference and use this information for making informed choices in analyzing data.\n\nSHOW ALL ABOUT STATISTICAL INFERENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/regression-models?specialization=jhu-data-science",
       "name":"Regression Models",
       "Rating":"Regression Models\n4.4\nstars\n3,262 ratings\n•\n561 reviews\n\nLinear models, as their name implies, relates an outcome to a set of predictors of interest using linear assumptions.  Regression models, a subset of linear models, are the most important statistical analysis tool in a data scientist’s toolkit. This course covers regression analysis, least squares and inference using regression models. Special cases of the regression model, ANOVA and ANCOVA will be covered as well. Analysis of residuals and variability will be investigated. The course will cover modern thinking on model selection and novel uses of regression models including scatterplot smoothing.\n\nSHOW ALL ABOUT REGRESSION MODELS\nSHOW ALL"
    },
    {
       "Url":"/learn/practical-machine-learning?specialization=jhu-data-science",
       "name":"Practical Machine Learning",
       "Rating":"Practical Machine Learning\n4.5\nstars\n3,154 ratings\n•\n604 reviews\n\nOne of the most common tasks performed by data scientists and data analysts are prediction and machine learning. This course will cover the basic components of building and applying prediction functions with an emphasis on practical applications. The course will provide basic grounding in concepts such as training and tests sets, overfitting, and error rates. The course will also introduce a range of model based and algorithmic machine learning methods including regression, classification trees, Naive Bayes, and random forests. The course will cover the complete process of building prediction functions including data collection, feature creation, algorithms, and evaluation.\n\nSHOW ALL ABOUT PRACTICAL MACHINE LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/data-products?specialization=jhu-data-science",
       "name":"Developing Data Products",
       "Rating":"Developing Data Products\n4.6\nstars\n2,208 ratings\n•\n410 reviews\n\nA data product is the production output from a statistical analysis. Data products automate complex analysis tasks or use technology to expand the utility of a data informed model, algorithm or inference. This course covers the basics of creating data products using Shiny, R packages, and interactive graphics. The course will focus on the statistical fundamentals of creating a data product that can be used to tell a story about data to a mass audience.\n\nSHOW ALL ABOUT DEVELOPING DATA PRODUCTS\nSHOW ALL"
    },
    {
       "Url":"/learn/data-science-project?specialization=jhu-data-science",
       "name":"Data Science Capstone",
       "Rating":"Data Science Capstone\n4.5\nstars\n1,183 ratings\n•\n314 reviews\n\nThe capstone project class will allow students to create a usable/public data product that can be used to show your skills to potential employers. Projects will be drawn from real-world problems and will be conducted with industry, government, and academic partners."
    },
    "/specializations/modern-contemporary-art-design",
    {
       "Url":"/learn/modern-art-ideas?specialization=modern-contemporary-art-design",
       "name":"Modern Art & Ideas",
       "Rating":"Modern Art & Ideas\n4.8\nstars\n5,490 ratings\n•\n1,412 reviews\n\nWelcome to Modern Art & Ideas! This course is designed for anyone interested in learning more about modern and contemporary art. Over the next five weeks, you will look at art through a variety of themes: Places & Spaces, Art & Identity, Transforming Everyday Objects, and Art & Society. Each week kicks off with a video that connects works of art from The Museum of Modern Art’s collection to the theme. You will hear audio interviews with artists, designers, and curators and learn more about selected works in the additional readings and resources.\n\nThroughout this course you will discover how artists:\n-- represent place and take inspiration from their environment,\n-- create works of art to express, explore, and question identity,\n-- use everyday objects to challenge assumptions about what constitutes a work of art and how it should be made,\n-- and respond to the social, cultural, and political issues of their time through works of art.\n\nThrough the discussion forum prompts and peer review assignment, you will also have the opportunity to connect with other learners and explore how these themes resonate with your own life and experience.\n\nSHOW ALL ABOUT MODERN ART & IDEAS\nSHOW ALL"
    },
    {
       "Url":"/learn/photography?specialization=modern-contemporary-art-design",
       "name":"Seeing Through Photographs",
       "Rating":"Seeing Through Photographs\n4.8\nstars\n3,931 ratings\n•\n1,050 reviews\n\nTaking, sharing, and viewing photographs has become second nature for many of us. Given our near-constant engagement with images this course will help you dig into the meaning of pictures and reconsider photography’s role in our visual culture. This course aims to address the gap between seeing and truly understanding photographs by introducing a diversity of ideas, approaches, and technologies that inform their making. \n\nIn this course you will look closely at 100 photographs from the collection of The Museum of Modern Art, going behind the scenes of the Museum and into artist studios through original films and audio interviews. You will hear a variety of perspectives on the ways photography has been used throughout its 180-year history: as a means of artistic expression, a tool for science and exploration, an instrument of documentation, a way to tell stories and record histories, and a mode of communication and critique. Short texts and readings from MoMA publications provide enhanced context for the works in the course. \n\nBy enrolling in this course, you’ll join a community of international learners in discussion forums, receive invitations to live and virtual events from our lead instructor Sarah Meister, and gain exclusive access to MoMA resources.\n\nUPDATE:\nWe’ve been listening to your feedback! In September 2020, we launched new content in Seeing Through Photographs, including audio interviews with additional contemporary artists from around the world, videos of Sarah introducing key ideas, and almost doubling the number of photographs from the collection. We’ve also added opportunities for you to share and receive feedback on your photographs in the discussion forums.\n\nSHOW ALL ABOUT SEEING THROUGH PHOTOGRAPHS\nSHOW ALL"
    },
    {
       "Url":"/learn/contemporary-art?specialization=modern-contemporary-art-design",
       "name":"What Is Contemporary Art?",
       "Rating":"What Is Contemporary Art?\n4.7\nstars\n1,538 ratings\n•\n354 reviews\n\nWhat is contemporary art? In this course, you’ll consider this question through more than 70 works of art made between 1980 and the present, with a focus on art from the past decade. You’ll hear directly from artists, architects, and designers from around the globe about their creative processes, materials, and inspiration.\n\nFive themes serve as your guide: Media from Television to the Internet, Territories & Transit, Materials & Making, Agency, and Power. You’ll look at 3-D–printed glass and fiber sculptures, performances in a factory and a museum, painted portraits—as well as those made with artificial intelligence—and interventions into television and video games. And much more, all drawn from the collection of The Museum of Modern Art. \n\nCome along as artists invite us into their studios, out into their neighborhoods, and to experiment with the materials they use. Not only will you develop a deeper understanding of how artists work today, you’ll also explore some of their many approaches to the pressing issues and questions of our time. By taking this course, you’ll gain confidence to look at contemporary art wherever you encounter it and make connections to your own life or creative practice.\n\nSHOW ALL ABOUT WHAT IS CONTEMPORARY ART?\nSHOW ALL"
    },
    {
       "Url":"/learn/fashion-design?specialization=modern-contemporary-art-design",
       "name":"Fashion as Design",
       "Rating":"Fashion as Design\n4.8\nstars\n2,519 ratings\n•\n605 reviews\n\nAmong all objects of design, our clothes are the most universal and intimate. Like other kinds of design, fashion thrives on productive tensions between form and function, automation and craftsmanship, standardization and customization, universality and self-expression, and pragmatism and utopian vision. It exists in the service of others, and it can have profound consequences—social, political, cultural, economic, and environmental.\n\nFashion as Design focuses on a selection of more than 70 garments and accessories from around the world, ranging from kente cloth to jeans to 3D-printed dresses. Through these garments, we’re going to look closely at what we wear, why we wear it, how it’s made, and what it means. You’ll hear directly from a range of designers, makers, historians, and others working with clothing every day—and, in some cases, reinventing it for the future. Studio visits, interviews, and other resources introduce the history and development of each garment and their changing uses, meanings, and impact over time. \n\nCourse Learning Objectives:\n\nDevelop critical tools to appreciate and contextualize fashion design—from everyday clothing to couture garments—through many different perspectives. \n\nTrace the history, development, and impact of garments over time, and explore how they may be reinvented.\n\nInvestigate garments through multiple lenses including politics, identity, and economics. \n\nUnderstand more about the lifecycle of clothing, from its design and production to its marketing, distribution, and consumption. \n\nBetter comprehend the choices you make about fashion with respect to the visual language of dress, individual and collective identities, and issues such as labor practices, sustainability, and body politics.\n\nSHOW ALL ABOUT FASHION AS DESIGN\nSHOW ALL"
    },
    "/specializations/full-stack-react",
    {
       "Url":"/learn/bootstrap-4?specialization=full-stack-react",
       "name":"Front-End Web UI Frameworks and Tools: Bootstrap 4",
       "Rating":"Front-End Web UI Frameworks and Tools: Bootstrap 4\n4.8\nstars\n7,008 ratings\n•\n2,119 reviews\n\nThis course will give you an overview of client-side web UI frameworks, in particular Bootstrap 4. You will learn about grids and responsive design, Bootstrap CSS and JavaScript components. You will learn about CSS preprocessors, Less and Sass. You will also learn the basics of Node.js and NPM and task runners like Grunt and Gulp.\n\nAt the end of this course, you will be able to a)Set up, design and style a web page using Bootstrap 4 and its components, b) Create a responsive web page design, and c) Make use of web tools to setup and manage web sites.\nThis course also includes an honors track that enables you to work on your own project developing a website using Bootstrap 4.\nStudents enrolling in this course should have prior good working knowledge of HTML, CSS and JavaScript.\n\nSHOW ALL ABOUT FRONT-END WEB UI FRAMEWORKS AND TOOLS: BOOTSTRAP 4\nSHOW ALL"
    },
    {
       "Url":"/learn/front-end-react?specialization=full-stack-react",
       "name":"Front-End Web Development with React",
       "Rating":"Front-End Web Development with React\n4.7\nstars\n2,834 ratings\n•\n819 reviews\n\nThis course explores Javascript based front-end application development, and in particular the React library (Currently Ver. 16.3). This course will use JavaScript ES6 for developing React application. You will also get an introduction to the use of Reactstrap for Bootstrap 4-based responsive UI design. You will be introduced to various aspects of React components. You will learn about React router and its use in developing single-page applications. You will also learn about designing controlled forms. You will be introduced to the Flux architecture and Redux. You will explore various aspects of Redux and use it to develop React-Redux powered applications. You will then learn to use Fetch for client-server communication and the use of REST API on the server side. A quick tour through React animation support and testing rounds off the course. You must have preferably completed the previous course in the specialization on Bootstrap 4, or have a working knowledge of Bootstrap 4 to be able to navigate this course. Also a good working knowledge of JavaScript, especially ES 5 is strongly recommended.\n\nAt the end of this course you will:\n\n- Be familiar with client-side Javascript application development and the React library\n- Be able to implement single page applications in React\n- Be able to use various React features including components and forms\n- Be able to implement a functional front-end web application using React\n- Be able to use Reactstrap for designing responsive React applications\n- Be able to use Redux to design the architecture for a React-Redux application\n\nSHOW ALL ABOUT FRONT-END WEB DEVELOPMENT WITH REACT\nSHOW ALL"
    },
    {
       "Url":"/learn/server-side-nodejs?specialization=full-stack-react",
       "name":"Server-side Development with NodeJS, Express and MongoDB",
       "Rating":"Server-side Development with NodeJS, Express and MongoDB\n4.7\nstars\n2,277 ratings\n•\n616 reviews\n\nThis course deals with all things server-side. We base the entire course around the NodeJS platform. We start with a brief overview of the Web protocols: HTTP and HTTPS. We examine NodeJS and NodeJS modules: Express for building web servers. On the database side, we review basic CRUD operations, NoSQL databases, in particular MongoDB and Mongoose for accessing MongoDB from NodeJS. We examine the REST concepts and building a RESTful API. We touch upon authentication and security. Finally we review backend as a service (BaaS) approaches, including mobile BaaS, both open-source and commercial BaaS services.\n\nAt the end of this course, you will be able to:\n\n- Demonstrate an understanding of server-side concepts, CRUD and REST\n- Build and configure a backend server using NodeJS framework\n- Build a RESTful API for the front-end to access backend services\n\nSHOW ALL ABOUT SERVER-SIDE DEVELOPMENT WITH NODEJS, EXPRESS AND MONGODB\nSHOW ALL"
    },
    "/specializations/salesforce-fundamentals",
    {
       "Url":"/learn/salesforce-basics?specialization=salesforce-fundamentals",
       "name":"Salesforce Basics",
       "Rating":"Salesforce Basics\n4.4\nstars\n68 ratings\n•\n13 reviews\n\nIn this course, you will learn about what the world’s number one Customer Relationship Manager (CRM) system has to offer. You will begin this course by understanding the components that Salesforce leverages to make it an optimal system. You will learn about the basics in Lightning for Sales, Community Cloud and Marketing, and understanding how to secure your Salesforce Organization and Manage Permissions. These tools will serve as building blocks to implementing Salesforce into any organization. The course includes in-depth readings and practical application activities within Salesforce's Trailhead education platform, peer discussion opportunities, demonstration videos, and peer review assignments.\n\nSHOW ALL ABOUT SALESFORCE BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/salesforce-reporting?specialization=salesforce-fundamentals",
       "name":"Salesforce Reporting",
       "Rating":"Salesforce Reporting\n4.7\nstars\n11 ratings\n•\n2 reviews\n\nSalesforce Reporting focuses on how the micro-level changes in Salesforce affect the macro level of the user experience. In this course, you will focus on creating custom objects, field dependencies, and work flows to track accounts or services. It is also important that you maintain data clean for your organization and you will work with creating reports, managing data, and creating full reports and dashboards. Lastly, you will focus on your customer base with Salesforce Service Cloud to maintain engagement through your services. The course includes in-depth readings and practical application activities within Salesforce's Trailhead education platform, peer discussion opportunities, demonstration videos, and peer review assignments.\n\nSHOW ALL ABOUT SALESFORCE REPORTING\nSHOW ALL"
    },
    {
       "Url":"/learn/salesforce-integration?specialization=salesforce-fundamentals",
       "name":"Salesforce Integration",
       "Rating":"Salesforce Integration\n\nSalesforce Integration explores why data management is so important, how Salesforce can help organize and display reported data to gain insight into trends and patterns, and how to automate manual business procedures. Learners will specifically practice creating custom automation process, building work flows, and performing data modeling. The course includes in-depth readings and practical application activities within Salesforce's Trailhead education platform, peer discussion opportunities, demonstration videos, and peer review assignments.\n\nSHOW ALL ABOUT SALESFORCE INTEGRATION\nSHOW ALL"
    },
    {
       "Url":"/learn/salesforce-capstone-organization-integration?specialization=salesforce-fundamentals",
       "name":"Salesforce Capstone: Organization Integration",
       "Rating":"Salesforce Capstone: Organization Integration\n\nIn Salesforce Capstone: Organization Integration, the final course of the Salesforce Fundamentals Specialization, learners will complete the Business Administration Specialist Superbadge as their main project. This project asks learners to combine all the skills and knowledge areas that they have collected from the previous three courses. Skill areas to be demonstrated include cleaning and importing account data, adding users and managing access, building email templates for new marketing needs, configuring UI tools for a new product type, generating reports and dashboards, managing and applying Chatter tools, and participating in the deployment of Salesforce within an organization. In addition to the project, the course includes a peer discussion opportunity, a demonstration video, and a peer review assignment. Completion of the Salesforce Fundamentals specialization and the Business Administration Specialist Superbadge prepares learners to take the Salesforce Administrator exam.\n\nSHOW ALL ABOUT SALESFORCE CAPSTONE: ORGANIZATION INTEGRATION\nSHOW ALL"
    },
    "/specializations/cloudera-big-data-analysis-sql",
    {
       "Url":"/learn/foundations-big-data-analysis-sql?specialization=cloudera-big-data-analysis-sql",
       "name":"Foundations for Big Data Analysis with SQL",
       "Rating":"Foundations for Big Data Analysis with SQL\n4.8\nstars\n897 ratings\n•\n226 reviews\n\nIn this course, you'll get a big-picture view of using SQL for big data, starting with an overview of data, database systems, and the common querying language (SQL). Then you'll learn the characteristics of big data and SQL tools for working on big data platforms. You'll also install an exercise environment (virtual machine) to be used through the specialization courses, and you'll have an opportunity to do some initial exploration of databases and tables in that environment.\n\nBy the end of the course, you will be able to\n• distinguish operational from analytic databases, and understand how these are applied in big data;\n• understand how database and table design provides structures for working with data;\n• appreciate how differences in volume and variety of data affects your choice of an appropriate database system;\n• recognize the features and benefits of SQL dialects designed to work with big data systems for storage and analysis; and \n• explore databases and tables in a big data platform.\n\nTo use the hands-on environment for this course, you need to download and install a virtual machine and the software on which to run it. Before continuing, be sure that you have access to a computer that meets the following hardware and software requirements:\n• Windows, macOS, or Linux operating system (iPads and Android tablets will not work)\n• 64-bit operating system (32-bit operating systems will not work)\n• 8 GB RAM or more\n• 25GB free disk space or more\n• Intel VT-x or AMD-V virtualization support enabled (on Mac computers with Intel processors, this is always enabled;\non Windows and Linux computers, you might need to enable it in the BIOS)\n• For Windows XP computers only: You must have an unzip utility such as 7-Zip or WinZip installed (Windows XP’s built-in unzip utility will not work)\n\nSHOW ALL ABOUT FOUNDATIONS FOR BIG DATA ANALYSIS WITH SQL\nSHOW ALL"
    },
    {
       "Url":"/learn/cloudera-big-data-analysis-sql-queries?specialization=cloudera-big-data-analysis-sql",
       "name":"Analyzing Big Data with SQL",
       "Rating":"Analyzing Big Data with SQL\n4.9\nstars\n430 ratings\n•\n114 reviews\n\nIn this course, you'll get an in-depth look at the SQL SELECT statement and its main clauses. The course focuses on big data SQL engines Apache Hive and Apache Impala, but most of the information is applicable to SQL with traditional RDBMs as well; the instructor explicitly addresses differences for MySQL and PostgreSQL.\n\nBy the end of the course, you will be able to\n• explore and navigate databases and tables using different tools;\n• understand the basics of SELECT statements;\n• understand how and why to filter results;\n• explore grouping and aggregation to answer analytic questions;\n• work with sorting and limiting results; and \n• combine multiple tables in different ways.\n\nTo use the hands-on environment for this course, you need to download and install a virtual machine and the software on which to run it. Before continuing, be sure that you have access to a computer that meets the following hardware and software requirements:\n• Windows, macOS, or Linux operating system (iPads and Android tablets will not work)\n• 64-bit operating system (32-bit operating systems will not work)\n• 8 GB RAM or more\n• 25GB free disk space or more\n• Intel VT-x or AMD-V virtualization support enabled (on Mac computers with Intel processors, this is always enabled;\non Windows and Linux computers, you might need to enable it in the BIOS)\n• For Windows XP computers only: You must have an unzip utility such as 7-Zip or WinZip installed (Windows XP’s built-in unzip utility will not work)\n\nSHOW ALL ABOUT ANALYZING BIG DATA WITH SQL\nSHOW ALL"
    },
    {
       "Url":"/learn/cloud-storage-big-data-analysis-sql?specialization=cloudera-big-data-analysis-sql",
       "name":"Managing Big Data in Clusters and Cloud Storage",
       "Rating":"Managing Big Data in Clusters and Cloud Storage\n4.7\nstars\n233 ratings\n•\n51 reviews\n\nIn this course, you'll learn how to manage big datasets, how to load them into clusters and cloud storage, and how to apply structure to the data so that you can run queries on it using distributed SQL engines like Apache Hive and Apache Impala. You’ll learn how to choose the right data types, storage systems, and file formats based on which tools you’ll use and what performance you need.\n\nBy the end of the course, you will be able to\n• use different tools to browse existing databases and tables in big data systems;\n• use different tools to explore files in distributed big data filesystems and cloud storage;\n• create and manage big data databases and tables using Apache Hive and Apache Impala; and\n• describe and choose among different data types and file formats for big data systems.\n\nTo use the hands-on environment for this course, you need to download and install a virtual machine and the software on which to run it. Before continuing, be sure that you have access to a computer that meets the following hardware and software requirements:\n• Windows, macOS, or Linux operating system (iPads and Android tablets will not work)\n• 64-bit operating system (32-bit operating systems will not work)\n• 8 GB RAM or more\n• 25GB free disk space or more\n• Intel VT-x or AMD-V virtualization support enabled (on Mac computers with Intel processors, this is always enabled;\non Windows and Linux computers, you might need to enable it in the BIOS)\n• For Windows XP computers only: You must have an unzip utility such as 7-Zip or WinZip installed (Windows XP’s built-in unzip utility will not work)\n\nSHOW ALL ABOUT MANAGING BIG DATA IN CLUSTERS AND CLOUD STORAGE\nSHOW ALL"
    },
    "/specializations/photography-basics",
    {
       "Url":"/learn/exposure-photography?specialization=photography-basics",
       "name":"Cameras, Exposure, and Photography",
       "Rating":"Cameras, Exposure, and Photography\n4.7\nstars\n4,454 ratings\n•\n1,382 reviews\n\nWelcome to Course One of Photography Basics and Beyond: From Smartphone to DSLR! In these first 4 Modules you will gain the knowledge and the confidence that will help you make good choices as you consider qualities of the camera you own, and the qualities of the other types of digital cameras you might be considering. You will learn about the basic functions that most digital cameras have in common.  You will also go beyond the \"technical\" matters and learn about how you can make exciting pictures by emphasizing the aspects of Frame and Vantage Point to interpret old subjects in new ways.  Discovering accessories that photographers find useful, and the types of camera bags from mini to carry-on sized, is also in store for you.  You will also make your first photographs and, if you are a subscriber to the specialization, upload pictures to the web gallery and start interacting with your fellow learners in our \"Gallery.\"  Let's get started with Module One!\n\nSHOW ALL ABOUT CAMERAS, EXPOSURE, AND PHOTOGRAPHY\nSHOW ALL"
    },
    {
       "Url":"/learn/camera-control?specialization=photography-basics",
       "name":"Camera Control",
       "Rating":"Camera Control\n4.8\nstars\n1,611 ratings\n•\n420 reviews\n\nWelcome to Course Two of Photography Basics and Beyond: From Smartphone to DSLR!  Now that you have a broad understanding of the various types of cameras, the importance of setting up Menus and Functions to gain control in your photography, and the difference between Auto and Program exposure modes, you are ready to move into even greater Camera Control!  \n\nIn these 4 Modules we will concentrate on gaining the knowledge necessary to make use of Exposure Modes, Light Metering, Effects of various ISO settings, Lens options, using Shutter Speeds to convey aspects of Time in both documentary and creative ways, and exploring the controlled focus effects that Depth of Field Principles make possible.   You will also continue to make new photographs and, if you are a subscriber to the specialization, continue interacting with your fellow learners as you share photographs for Peer Review.  You will also confirm your knowledge through completion of quizzes and written responses.  Let's get started with Module One!\n\nSHOW ALL ABOUT CAMERA CONTROL\nSHOW ALL"
    },
    {
       "Url":"/learn/photo-composition?specialization=photography-basics",
       "name":"Principles of Photo Composition and Digital Image Post-Production",
       "Rating":"Principles of Photo Composition and Digital Image Post-Production\n4.7\nstars\n1,095 ratings\n•\n258 reviews\n\nWelcome to Course THREE!  In the first two Modules you will gain a more professional-level understanding of the Design Elements that artists have used throughout history to create successful compositions.  Arranging the Elements in ways that lead viewers through their compositions is an essential craft for photographers no matter whether their subject matter is pure documentary or vividly exotic personal expression.  In Modules 3 & 4 we survey the essential elements of post-photography image management, using Adobe(tm) LIGHTROOM(tm).  Image adjustment software designed for Smartphone photographers rounds out the Course.  Since even photographers whose mainstay is a high-end DSLR also must admit to Smartphone use occasionally, and photographers who only use a Smartphone will usually admit that they want to step over to a \"regular\" camera at some point, there is something for everyone here!  Let's get started with Module One!\n\nSHOW ALL ABOUT PRINCIPLES OF PHOTO COMPOSITION AND DIGITAL IMAGE POST-PRODUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/photography-techniques?specialization=photography-basics",
       "name":"Photography Techniques: Light, Content, and Sharing",
       "Rating":"Photography Techniques: Light, Content, and Sharing\n4.8\nstars\n954 ratings\n•\n247 reviews\n\nWelcome to Course FOUR!   In Modules 1-4 you will cover the final elements of the Specialization necessary to round out this introduction to the fundamentals of Photography, and prepare you for creating your own exciting project in the Capstone!  You have come a long way since the beginning of this journey from Smartphone Basics to DSLR and Beyond.  Just think of all the information you have absorbed and put to use in your assignments and quizzes, and the confidence you have gained that you CAN control the camera to make pictures you are proud to share.  \n\nHere in Course Four you will start by gaining knowledge related to content in photography, from fact to fiction, documentary to purely expressive.  Next you will learn principles, tips, and techniques for using the essential element of Light in Ambient/Natural settings.  \n\nThe flash/strobe unit, whether it is built-in to your camera or an add-on \"hotshoe\" model, will finally be something you, not the camera, controls!  You will prove to yourself that those former mysteries of Controlled Continuous and Strobe lighting will no longer be mysterious, as you apply your knowledge to creation of assignment photographs in various situations.  Sharing those pictures in Peer Review will give you the opportunity to learn from your fellow photographers' solutions to lighting challenges, and to gain insight into your own work and creative approaches too.  \n\nThere is an important word to share about Peer Review assignments for this course.  As photographers who have accomplished the quiz and photography requirements of Courses One through Three, you have the knowledge and capability to create quality photographs at a much higher rate of success, and in a much shorter time, than when you began.  You have also proven that you are a dedicated Learner, someone who has a passion for photography and is willing to put forth the extra effort necessary to accomplish your goals.  This Course is the last before the Capstone Course, in which you will be tasked with creating a project over a 2-month period of dedicated photography.  The Peer Review photography assignments have been structured with both your advanced capabilities and dedication in mind...in other words, they will require both!  Be prepared to allocate more time than you have in previous Courses for the assignments, because they will take more time and because you will really enjoy them!\n\nCourse Four ends with an overview of methods for finalizing your pictures in print form, including simple but effective matting techniques, and in web page designs as well.  The pleasures and perils of sharing in social media sites are also yours to discover.  Protecting your copyrights by understanding that concept and the ways that you can assert them, being careful about blogs and other outlets, and recognizing you are part of a community that respects the individual's creative effort, well that is  important knowledge to have in preparation for the Capstone too!  Let's get started with Module One!\n\nSHOW ALL ABOUT PHOTOGRAPHY TECHNIQUES: LIGHT, CONTENT, AND SHARING\nSHOW ALL"
    },
    {
       "Url":"/learn/photography-project?specialization=photography-basics",
       "name":"Photography Capstone Project",
       "Rating":"Photography Capstone Project\n4.9\nstars\n426 ratings\n•\n158 reviews\n\nThe Capstone Project is your opportunity to take advantage of the knowledge you have gained through our journey in learning about photography, to develop a meaningful project of 10 well formed photographs based in your passion for artistic expression, or a subject for documentary exploration, insightful portraiture, imaging for work-related subjects, or some other aspect of photography.  We are confident that it will be a project that you will be excited to share with fellow Learners.  You should plan on spending more time on this Course per week than any other in this Specialization, and much of it will be in making photographs.\n\nDuring the entire period of development, you and your fellow learners will be supporting each other as you work independently, by sharing your work-in-progress from the initial Project Plan to the final Portfolio.  At each stage, all Learners will share comments and suggestions with each other, helping each other to gauge progress and to learn about different approaches to photography and content.  By expressing your own ideas and expectations about quality in response to the work of others, you will be forming your own criteria of excellence as well.  \n\nAlong the way there will be multiple opportunities for sharing pictures and ideas through carefully designed Peer Review.  This sharing of photographs and comments with peers, and reflecting on their comments about your photos, will be an exciting learning experience that will help you grow in understanding your own photography and that of others.  Your contribution of comments to fellow Learners will not only help them understand their photographs better, but it will give you an opportunity to use the vocabulary of terms that are related to techniques, design principles, and content approaches that you have learned through your success in each of the previous Modules.  \n\nA unique aspect of this Specialization is that everyone who completes the requirements  will receive, in addition to their Certificate of Specialization from Michigan State University, access to substantial discounts on equipment, accessories, and membership benefits through Industry Partners from among the premier manufacturers of photography equipment and related items:  Fracture, Gary Fong, Gyst, Lensbaby, LensPen, Lume Cube Lighting, Photo District News, PhotoVideoEdu, Think Tank Cases/Bags.\n\nSHOW ALL ABOUT PHOTOGRAPHY CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/firstprinciplesofcomputervision",
    {
       "Url":"/learn/cameraandimaging?specialization=firstprinciplesofcomputervision",
       "name":"Camera and Imaging",
       "Rating":"Camera and Imaging\n\nThis course covers the fundamentals of imaging – the creation of an image that is ready for consumption or processing by a human or a machine. Imaging has a long history, spanning several centuries. But the advances made in the last three decades have revolutionized the camera and dramatically improved the robustness and accuracy of computer vision systems. We describe the fundamentals of imaging, as well as recent innovations in imaging that have had a profound impact on computer vision.\n\nThis course starts with examining how an image is formed using a lens camera. We explore the optical characteristics of a camera such as its magnification, F-number, depth of field and field of view. Next, we describe how solid-state image sensors (CCD and CMOS) record images, and the key properties of an image sensor such as its resolution, noise characteristics and dynamic range. We describe how image sensors can be used to sense color as well as capture images with high dynamic range. In certain structured environments, an image can be thresholded to produce a binary image from which various geometric properties of objects can be computed and used for recognizing and locating objects. Finally, we present the fundamentals of image processing – the development of computational tools to process a captured image to make it cleaner (denoising, deblurring, etc.) and easier for computer vision systems to analyze (linear and non-linear image filtering methods).\n\nSHOW ALL ABOUT CAMERA AND IMAGING\nSHOW ALL"
    },
    {
       "Url":"/learn/features-and-boundaries?specialization=firstprinciplesofcomputervision",
       "name":"Features and Boundaries",
       "Rating":"Features and Boundaries\n\nThis course focuses on the detection of features and boundaries in images. Feature and boundary detection is a critical preprocessing step for a variety of vision tasks including object detection, object recognition and metrology – the measurement of the physical dimensions and other properties of objects. The course presents a variety of methods for detecting features and boundaries and shows how features extracted from an image can be used to solve important vision tasks.\n\nWe begin with the detection of simple but important features such as edges and corners. We show that such features can be reliably detected using operators that are based on the first and second derivatives of images. Next, we explore the concept of an “interest point” – a unique and hence useful local appearance in an image. We describe how interest points can be robustly detected using the SIFT detector. Using this detector, we describe an end-to-end solution to the problem of stitching overlapping images of a scene to obtain a wide-angle panorama. Finally, we describe the important problem of finding faces in images and show several applications of face detection.\n\nSHOW ALL ABOUT FEATURES AND BOUNDARIES\nSHOW ALL"
    },
    {
       "Url":"/learn/3d-reconstruction---single-viewpoint?specialization=firstprinciplesofcomputervision",
       "name":"3D Reconstruction - Single Viewpoint",
       "Rating":"3D Reconstruction - Single Viewpoint\n\nThis course focuses on the recovery of the 3D structure of a scene from its 2D images. In particular, we are interested in the 3D reconstruction of a rigid scene from images taken by a stationary camera (same viewpoint). This problem is interesting as we want the multiple images of the scene to capture complementary information despite the fact that the scene is rigid and the camera is fixed. To this end, we explore several ways of capturing images where each image provides additional information about the scene.\n\nIn order to estimate scene properties (depth, surface orientation, material properties, etc.) we first define several important radiometric concepts, such as, light source intensity, surface illumination, surface brightness, image brightness and surface reflectance. Then, we tackle the challenging problem of shape from shading - recovering the shape of a surface from its shading in a single image. Next, we show that if multiple images of a scene of known reflectance are taken while changing the illumination direction, the surface normal at each scene point can be computed. This method, called photometric stereo, provides a dense surface normal map that can be integrated to obtain surface shape. \n\nNext, we discuss depth from defocus, which uses the limited depth of field of the camera to estimate scene structure. From a small number of images taken by changing the focus setting of the lens, a dense depth of the scene is recovered. Finally, we present a suite of techniques that use active illumination (the projection of light patterns onto the scene) to get precise 3D reconstructions of the scene. These active illumination methods are the workhorse of factory automation. They are used on manufacturing lines to assemble products and inspect their visual quality. They are also extensively used in other domains such as driverless cars, robotics, surveillance, medical imaging and special effects in movies.\n\nSHOW ALL ABOUT 3D RECONSTRUCTION - SINGLE VIEWPOINT \nSHOW ALL"
    },
    {
       "Url":"/learn/3d-reconstruction-multiple-viewpoints?specialization=firstprinciplesofcomputervision",
       "name":"3D Reconstruction - Multiple Viewpoints",
       "Rating":"3D Reconstruction - Multiple Viewpoints\n\nThis course focuses on the recovery of the 3D structure of a scene from images taken from different viewpoints. We start by first building a comprehensive geometric model of a camera and then develop a method for finding (calibrating) the internal and external parameters of the camera model. Then, we show how two such calibrated cameras, whose relative positions and orientations are known, can be used to recover the 3D structure of the scene. This is what we refer to as simple binocular stereo. Next, we tackle the problem of uncalibrated stereo where the relative positions and orientations of the two cameras are unknown. Interestingly, just from the two images taken by the cameras, we can both determine the relative positions and orientations of the cameras and then use this information to estimate the 3D structure of the scene. \n\nNext, we focus on the problem of dynamic scenes. Given two images of a scene that includes moving objects, we show how the motion of each point in the image can be computed. This apparent motion of points in the image is called optical flow. Optical flow estimation allows us to track scene points over a video sequence. Next, we consider the video of a scene shot using a moving camera, where the motion of the camera is unknown. We present structure from motion that takes as input tracked features in such a video and determines not only the 3D structure of the scene but also how the camera moves with respect to the scene. The methods we develop in the course are widely used in object modeling, 3D site modeling, robotics, autonomous navigation, virtual reality and augmented reality.\n\nSHOW ALL ABOUT 3D RECONSTRUCTION - MULTIPLE VIEWPOINTS\nSHOW ALL"
    },
    {
       "Url":"/learn/perception?specialization=firstprinciplesofcomputervision",
       "name":"Visual Perception",
       "Rating":"Visual Perception\n\nThe ultimate goal of a computer vision system is to generate a detailed symbolic description of each image shown. This course focuses on the all-important problem of perception. \n\nWe first describe the problem of tracking objects in complex scenes. We look at two key challenges in this context. The first is the separation of an image into object and background using a technique called change detection. The second is the tracking of one or more objects in a video. Next, we examine the problem of segmenting an image into meaningful regions. In particular, we take a bottom-up approach where pixels with similar attributes are grouped together to obtain a region. \n\nFinally, we tackle the problem of object recognition. We describe two approaches to the problem. The first directly recognize an object and its pose using the appearance of the object. This method is based on the concept of dimension reduction, which is achieved using principal component analysis. The second approach is to use a neural network to solve the recognition problem as one of learning a mapping from the input (image) to the output (object class, object identity, activity, etc.). We describe how a neural network is constructed and how it is trained using the backpropagation algorithm.\n\nSHOW ALL ABOUT VISUAL PERCEPTION\nSHOW ALL"
    },
    "/specializations/spring-framework",
    {
       "Url":"/learn/spring-ecosystem-and-core?specialization=spring-framework",
       "name":"Spring - Ecosystem and Core",
       "Rating":"Spring - Ecosystem and Core\n\nIn this course students will learn the why the Spring Framework is one of the dominant Java development Frameworks. the course covers a variety of techniques for Java  Object Dependency Injection using various forms of configuration data i.e. XML, Annotations and Java Configuration Classes with Factory Methods. Configurations will be enhanced with Expression Languages  and Conditional Beans that are  available  based off certain conditions like development environment i.e. test and production. Students will build an extensive application iteratively in a succession of hands on labs.\n\nSHOW ALL ABOUT SPRING - ECOSYSTEM AND CORE\nSHOW ALL"
    },
    {
       "Url":"/learn/spring-mvc-rest-controller?specialization=spring-framework",
       "name":"Spring MVC, Spring Boot and Rest Controllers",
       "Rating":"Spring MVC, Spring Boot and Rest Controllers\n\nThis is a course aimed at students wishing to develop Java based Web Applications and Restful Micro Services using the very popular Spring MVC and  Spring Boot frameworks with minimal configuration. The student will develop services through various Url templates, consume and respond with json or XML payloads and create custom HTTP headers. Requestors of these services will include Java and Angular JS clients to illustrate the reuse capabilities of services in a distributed architecture. Traditional web applications will also be covered that render web pages in a typical Model View Controller (MVC) architecture. This is a very hands on course with a series of labs to illustrate the key concepts.\n\nSHOW ALL ABOUT SPRING MVC, SPRING BOOT  AND REST CONTROLLERS\nSHOW ALL"
    },
    {
       "Url":"/learn/spring-repositories?specialization=spring-framework",
       "name":"Spring Data Repositories",
       "Rating":"Spring Data Repositories\n\nThis course is aimed at students wishing to learn how Java interacts with databases in a modern framework. The course uses the very popular Spring Boot Framework, with Micro services, as a setting for our database interactions using Java Persistence Framework (JPA) and Spring Data Repositories to abstract away JPA. Students will then learn how to expose Repositories as Rest Web services in their own right using Hypermedia as the Engine of Application State or HATEAOS concepts. Spring Aspect Oriented Programming (AOP) will be covered to illustrate how cross cutting concerns like logging can be applied in a centralized non evasive manner to domain classes. finally the course covers the use of Spring Transaction Managers and Springs declarative configuration Transaction model.\n\nSHOW ALL ABOUT SPRING DATA REPOSITORIES\nSHOW ALL"
    },
    {
       "Url":"/learn/spring-cloud-overview?specialization=spring-framework",
       "name":"Spring - Cloud Overview",
       "Rating":"Spring - Cloud Overview\n\nThis course explains some high level patterns used in Microservice architectures and the motivation to move towards these architectures and away from monolithic development of applications. . It then goes on to implement these patterns using Spring Cloud, Netflix OSS one of the most popular Cloud implementations of Microservices used today. Students will learn about Service Registration, Service Discovery, Client Side Load Balancing, Circuit Breakers, and Gateway or Edge Services in a Spring Boot Setting. It will leverage Spring  Cloud and Netflix OSS, Labs will specifically target the projects Eureka, Ribbon, Hystrix, Feign and Zuul.\n\nSHOW ALL ABOUT SPRING - CLOUD OVERVIEW\nSHOW ALL"
    },
    "/specializations/intro-cyber-security",
    {
       "Url":"/learn/intro-cyber-attacks?specialization=intro-cyber-security",
       "name":"Introduction to Cyber Attacks",
       "Rating":"Introduction to Cyber Attacks\n4.7\nstars\n1,972 ratings\n•\n519 reviews\n\nThis course provides learners with a baseline understanding of common cyber security threats, vulnerabilities, and risks. An overview of how basic cyber attacks are constructed and applied to real systems is also included. Examples include simple Unix kernel hacks, Internet worms, and Trojan horses in software utilities. Network attacks such as distributed denial of service (DDOS) and botnet- attacks are also described and illustrated using real examples from the past couple of decades. \n\nFamiliar analytic models are outlined such as the confidentiality/integrity/availability (CIA) security threat framework, and examples are used to illustrate how these different types of threats can degrade real assets. The course also includes an introduction to basic cyber security risk analysis, with an overview of how threat-asset matrices can be used to prioritize risk decisions. Threats, vulnerabilities, and attacks are examined and mapped in the context of system security engineering methodologies.\n\nSHOW ALL ABOUT INTRODUCTION TO CYBER ATTACKS\nSHOW ALL"
    },
    {
       "Url":"/learn/cyber-attack-countermeasures?specialization=intro-cyber-security",
       "name":"Cyber Attack Countermeasures",
       "Rating":"Cyber Attack Countermeasures\n4.8\nstars\n490 ratings\n•\n111 reviews\n\nThis course introduces the basics of cyber defense starting with foundational models such as Bell-LaPadula and information flow frameworks. These underlying policy enforcements mechanisms help introduce basic functional protections, starting with authentication methods. Learners will be introduced to a series of different authentication solutions and protocols, including RSA SecureID and Kerberos, in the context of a canonical schema. \n\nThe basics of cryptography are also introduced with attention to conventional block ciphers as well as public key cryptography. Important cryptographic techniques such as cipher block chaining and triple-DES are explained. Modern certification authority-based cryptographic support is also discussed and shown to provide basis for secure e-commerce using Secure Sockets Layer (SSL) schemes.\n\nSHOW ALL ABOUT CYBER ATTACK COUNTERMEASURES\nSHOW ALL"
    },
    {
       "Url":"/learn/real-time-cyber-threat-detection?specialization=intro-cyber-security",
       "name":"Real-Time Cyber Threat Detection and Mitigation",
       "Rating":"Real-Time Cyber Threat Detection and Mitigation\n4.7\nstars\n472 ratings\n•\n83 reviews\n\nThis course introduces real-time cyber security techniques and methods in the context of the TCP/IP protocol suites. Explanation of some basic TCP/IP security hacks is used to introduce the need for network security solutions such as stateless and stateful firewalls. Learners will be introduced to the techniques used to design and configure firewall solutions such as packet filters and proxies to protect enterprise assets.\n\nPerimeter solutions such as firewalls and intrusion prevention systems are shown to have significant drawbacks in common enterprise environments. The result of such weakness is shown to often exist as advanced persistent threats (APTs) from nation-state actors. Such attacks, as well as DDOS and third-party attacks, are shown to have potential solutions for modern enterprise.\n\nSHOW ALL ABOUT REAL-TIME CYBER THREAT DETECTION AND MITIGATION\nSHOW ALL"
    },
    {
       "Url":"/learn/enterprise-infrastructure-security?specialization=intro-cyber-security",
       "name":"Enterprise and Infrastructure Security",
       "Rating":"Enterprise and Infrastructure Security\n4.7\nstars\n422 ratings\n•\n103 reviews\n\nThis course introduces a series of advanced and current topics in cyber security, many of which are especially relevant in modern enterprise and infrastructure settings. The basics of enterprise compliance frameworks are provided with introduction to NIST and PCI. Hybrid cloud architectures are shown to provide an opportunity to fix many of the security weaknesses in modern perimeter local area networks.\n\nEmerging security issues in blockchain, blinding algorithms, Internet of Things (IoT), and critical infrastructure protection are also described for learners in the context of cyber risk. Mobile security and cloud security hyper-resilience approaches are also introduced. The course completes with some practical advice for learners on how to plan careers in cyber security.\n\nSHOW ALL ABOUT ENTERPRISE AND INFRASTRUCTURE SECURITY\nSHOW ALL"
    }
 ]