[
    "/specializations/software-development-lifecycle",
    {
       "Url":"/learn/software-processes?specialization=software-development-lifecycle",
       "name":"Software Development Processes and Methodologies",
       "Rating":"Software Development Processes and Methodologies\n4.7\nstars\n1,372 ratings\n•\n308 reviews\n\nSoftware is quickly becoming integral part of human life as we see more and more automation and technical advancements. Just like we expect car to work all the time and can't afford to break or reboot unexpectedly, software industry needs to continue to learn better way to build software if it were to become integral part of human life.\n\nIn this course,  you will get an overview of  how software teams work? What processes they use?  What are some of the industry standard methodologies? What are pros and cons of each?  You will learn enough to have meaningful conversation around software development processes.\n\nAfter completing this course, a learner will be able to \n1) Apply core software engineering practices at conceptual level for a given problem. \n2) Compare and contrast traditional, agile, and lean development methodologies at high level.  These include Waterfall, Rational Unified Process, V model, Incremental, Spiral models and overview of agile mindset \n3) Propose a methodology best suited for a given situation\n\nSHOW ALL ABOUT SOFTWARE DEVELOPMENT PROCESSES AND METHODOLOGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/agile-software-development?specialization=software-development-lifecycle",
       "name":"Agile Software Development",
       "Rating":"Agile Software Development\n4.7\nstars\n3,547 ratings\n•\n865 reviews\n\nSoftware industry is going crazy on agile methods.  It is rapidly becoming the choice for software development where requirements are unpredictable or is expected to change over time. This course will help you gain knowledge on what is agile? Why agile is better suited for these situations?  We will also cover some of the most common agile frameworks like scrum and XP in depth.  \n\nPrerequisite: You need basic knowledge of software development process and software development methodologies. \n\nAfter completing this course, you will be able to :\n1) Demonstrate the ability to participate effectively in agile practices/process for software development.  \n2) Explain the purpose behind common agile practices.\n3) Ability to apply agile principles and values to a given situation.\n4) Ability to identify and address most common problems encountered in adopting Agile methods. \n\nProject: You will also be given opportunity to apply what you learn in this course.  You will be given fictional case studies, where after studying the case study, you will have to exercise some of the practices, techniques, etc that team members of an agile team members are expected to know.\n\nSHOW ALL ABOUT AGILE SOFTWARE DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/lean-software-development?specialization=software-development-lifecycle",
       "name":"Lean Software Development",
       "Rating":"Lean Software Development\n4.5\nstars\n292 ratings\n•\n66 reviews\n\nWhile scrum and XP were transforming the software development industry, there were another set of ideas (derived from lean manufacturing and Six Sigma) that started to influence software development methods.  These ideas around Lean Software Development forms the foundation of number of agile methods. \n\nIn this course, we will explore lean concepts and cover some of the common Lean methods and techniques like Kanban, Value Stream Mapping, etc.\n \nIn this course, we will also learn techniques like Lean Startup and Design Thinking that can help team learn about user and market needs much faster and cheaper. \n\nAs part of this course, you will also apply the knowledge gained  in this course to fictional case studies.  These projects will help you gain experience to confidently apply these techniques in real world.\n\nAt the end of the course,  you will be able to apply lean techniques / methods to software development.  You will also be able to apply methods to learn about your users and market needs much faster and cheaper.\n\nSHOW ALL ABOUT LEAN SOFTWARE DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/engineering-practices-secure-software-quality?specialization=software-development-lifecycle",
       "name":"Engineering Practices for Building Quality Software",
       "Rating":"Engineering Practices for Building Quality Software\n4.5\nstars\n175 ratings\n•\n26 reviews\n\nAgile embraces change which means that team should be able to effectively make changes to the system as team learns about users and market.  To be good at effectively making changes to the system, teams need to have engineering rigor and excellence else embracing change becomes very painful and expensive.  \n\nIn this course, you will learn about engineering practices and processes that agile and traditional teams use to make sure the team is prepared for change. In additional, you will also learn about practices, techniques and processes that can help team build high quality software. You will also learn how to calculate a variety of quantitative metrics related to software quality.\n\nThis is an intermediate course, intended for learners with a background in software development. To succeed in the course, you should have experience developing in modern programming languages (e.g., Java, C#, Python, JavaScript), an understanding of software development lifecycle models, familiarity with UML diagrams (class and sequence diagrams), and a desire to better understand quality aspects of software development beyond program correctness.\n\nAt the end of this course, you will be able to comfortably and effectively participate in various techniques and processes for building secure and high quality software.\n\nSHOW ALL ABOUT ENGINEERING PRACTICES FOR BUILDING QUALITY SOFTWARE\nSHOW ALL"
    },
    "/specializations/practical-data-science-matlab",
    {
       "Url":"/learn/exploratory-data-analysis-matlab?specialization=practical-data-science-matlab",
       "name":"Exploratory Data Analysis with MATLAB",
       "Rating":"Exploratory Data Analysis with MATLAB\n4.8\nstars\n682 ratings\n•\n195 reviews\n\nIn this course, you will learn to think like a data scientist and ask questions of your data.  You will use interactive features in MATLAB to extract subsets of data and to compute statistics on groups of related data. You will learn to use  MATLAB to automatically generate code so you can learn syntax as you explore.  You will also use interactive documents, called live scripts,  to capture the steps of your analysis, communicate the results, and provide interactive controls allowing others to experiment by selecting groups of data.\n\nThese skills are valuable for those who have domain knowledge and some exposure to computational tools, but no programming background is required. To be successful in this course, you should have some knowledge of basic statistics (e.g., histograms, averages, standard deviation, curve fitting, interpolation). \n\nBy the end of this course, you will be able to load data into MATLAB, prepare it for analysis, visualize it, perform basic computations, and communicate your results to others. In your last assignment, you will combine these skills to assess damages following a severe weather event and communicate a polished recommendation based on your analysis of the data.  You will be able to visualize the location of these events on a geographic map and create sliding controls allowing you to quickly visualize how a phenomenon changes over time.\n\nSHOW ALL ABOUT EXPLORATORY DATA ANALYSIS WITH MATLAB\nSHOW ALL"
    },
    {
       "Url":"/learn/feature-engineering-matlab?specialization=practical-data-science-matlab",
       "name":"Data Processing and Feature Engineering with MATLAB",
       "Rating":"Data Processing and Feature Engineering with MATLAB\n4.7\nstars\n294 ratings\n•\n103 reviews\n\nIn this course, you will build on the skills learned in Exploratory Data Analysis with MATLAB to lay the foundation required for predictive modeling.  This intermediate-level course is useful to anyone who needs to combine data from multiple sources or times and has an interest in modeling.  \n\nThese skills are valuable for those who have domain knowledge and some exposure to computational tools, but no programming background. To be successful in this course, you should have some background in basic statistics (histograms, averages, standard deviation, curve fitting, interpolation) and have completed Exploratory Data Analysis with MATLAB. \n\nThroughout the course, you will merge data from different data sets and handle common scenarios, such as missing data.  In the last module of the course, you will explore special techniques for handling textual, audio, and image data, which are common in data science and more advanced modeling.   By the end of this course, you will learn how to visualize your data, clean it up and arrange it for analysis, and identify the qualities necessary to answer your questions.  You will be able to visualize the distribution of your data and use visual inspection to address artifacts that affect accurate modeling.\n\nSHOW ALL ABOUT DATA PROCESSING AND FEATURE ENGINEERING WITH MATLAB\nSHOW ALL"
    },
    {
       "Url":"/learn/predictive-modeling-machine-learning?specialization=practical-data-science-matlab",
       "name":"Predictive Modeling and Machine Learning with MATLAB",
       "Rating":"Predictive Modeling and Machine Learning with MATLAB\n4.7\nstars\n77 ratings\n•\n22 reviews\n\nIn this course, you will build on the skills learned in Exploratory Data Analysis with MATLAB and Data Processing and Feature Engineering with MATLAB to increase your ability to harness the power of MATLAB to analyze data relevant to the work you do.\n\nThese skills are valuable for those who have domain knowledge and some exposure to computational tools, but no programming background. To be successful in this course, you should have some background in basic statistics (histograms, averages, standard deviation, curve fitting, interpolation) and have completed courses 1 through 2 of this specialization. \n\nBy the end of this course, you will use MATLAB to identify the best machine learning model for obtaining answers from your data. You will prepare your data, train a predictive model, evaluate and improve your model, and understand how to get the most out of your models.\n\nSHOW ALL ABOUT PREDICTIVE MODELING AND MACHINE LEARNING WITH MATLAB\nSHOW ALL"
    },
    {
       "Url":"/learn/matlab-capstone?specialization=practical-data-science-matlab",
       "name":"Data Science Project: MATLAB for the Real World",
       "Rating":"Data Science Project: MATLAB for the Real World\n4.8\nstars\n15 ratings\n•\n8 reviews\n\nLike most subjects, practice makes perfect in Data Science.   In the capstone project, you will apply the skills learned across courses in the Practical Data Science with MATLAB specialization to explore, process, analyze, and model data.   You will choose your own pathway to answer key questions with the provided data.\n\nTo complete the project, you must have mastery of the skills covered in other courses in the specialization.  The project will test your ability to import and explore your data, prepare the data for analysis, train a predictive model, evaluate and improve your model, and communicate your results.\n\nSHOW ALL ABOUT DATA SCIENCE PROJECT: MATLAB FOR THE REAL WORLD\nSHOW ALL"
    },
    "/specializations/esports",
    {
       "Url":"/learn/game-developers-esports-organizations?specialization=esports",
       "name":"Game Developers and Esports Organizations",
       "Rating":"Game Developers and Esports Organizations\n4.6\nstars\n151 ratings\n•\n44 reviews\n\nBefore you can have an Esport, you must have a video game to play and a game developer to design it. This course is dedicated to discussing game developers and their relationship with their respective Esport. The content will help you recognize the qualities a video game must have to become a successful Esport. We will examine the diagram demonstrating the various competitive structures commonly found in Esports.\n\nEsports, just like traditional sports, have their own professional organizations. These organizations strive to become successful businesses that win, make a profit, take care of their professional players, and attract a large audience. We will explore the factors that contribute to an Esports organization’s success, including branding, positioning, structuring the organization and funding sources.\n\nSHOW ALL ABOUT GAME DEVELOPERS AND ESPORTS ORGANIZATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/esports-teams-professional-players?specialization=esports",
       "name":"Esports Teams and Professional Players",
       "Rating":"Esports Teams and Professional Players\n4.6\nstars\n61 ratings\n•\n14 reviews\n\nThis course will be focusing on the competitive Esport team and individual professional players. Whether you are playing on a team or competing as an individual, you will find that being a professional Esports player is more complex and nuanced than most people realize. We will be talking a lot about the support staff surrounding players, the intricacy of navigating contracts, and the hardships of committing yourself to professional play.\n\nWe will also be talking about the Esports media. Similar to sports, Esports has developed its own unique ecosystem of articles, videos, streaming, social media, and overall content creation. We will examine the specifics of different types of media and explain how each has its uses in making Esports more popular as a whole.\n\nSHOW ALL ABOUT ESPORTS TEAMS AND PROFESSIONAL PLAYERS\nSHOW ALL"
    },
    {
       "Url":"/learn/college-esports-career-planning?specialization=esports",
       "name":"Collegiate Esports and Career Planning",
       "Rating":"Collegiate Esports and Career Planning\n4.6\nstars\n42 ratings\n•\n10 reviews\n\nThis course will be covering hot topics in the Esports industry. With Esports exploding in popularity over the last ten years, there are a lot of issues to discuss. \n\nWe will also be talking about collegiate Esports and career planning in order to understand all the different avenues and to examine the choices available for you as you pave your way through the Esports world. We will examine collegiate Esports, as that is generally the first step, but we will be covering general career planning too.\n\nSHOW ALL ABOUT COLLEGIATE ESPORTS AND CAREER PLANNING\nSHOW ALL"
    },
    {
       "Url":"/learn/esports-management-capstone-project?specialization=esports",
       "name":"Esports Management Capstone Project",
       "Rating":"Esports Management Capstone Project\n4.4\nstars\n33 ratings\n•\n9 reviews\n\nWe will analyze the pros and cons of creating a single or multiple Esport organization and recommend an effective branding strategy for a hypothetical Esport organization based on current Esport branding considerations.\n\nYou will develop a plan for recruiting funding resources for a hypothetical Esports organization and choose an Esport organization role of interest, other than Owner, and describe your reasoning.\n\nSHOW ALL ABOUT ESPORTS MANAGEMENT CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/oss-development-linux-git",
    {
       "Url":"/learn/open-source-software-development-methods?specialization=oss-development-linux-git",
       "name":"Open Source Software Development Methods",
       "Rating":"Open Source Software Development Methods\n4.6\nstars\n1,035 ratings\n•\n227 reviews\n\nIn this course, we will define what open source software is, we will go over the history of open source software and what benefits it has provided to the world’s technology infrastructure over the decades. The course aims to teach you how to work in open source projects productively and gain a lot of benefits from it, and really understand what the advantages are. You will learn about collaboration best practices, and how to encourage diversity in open source projects. We will discuss the different licensing models that are available, as this will help you decide what the best license is for your project. We will talk about methods that are commonly used, such as Continuous Integration, and use of GitHub and other hosting providers as a central meeting place for open source projects, and we will provide some examples of successful open source projects.\n\nSHOW ALL ABOUT OPEN SOURCE SOFTWARE DEVELOPMENT METHODS\nSHOW ALL"
    },
    {
       "Url":"/learn/linux-for-developers?specialization=oss-development-linux-git",
       "name":"Linux for Developers",
       "Rating":"Linux for Developers\n4.5\nstars\n1,149 ratings\n•\n220 reviews\n\nIn course 1 we talked about open source software and the motivation and methods of using it. In course 2, we will introduce you to Linux systems, and help you feel comfortable working at the command line:\n\nWhat Linux is\nLinux history\nHow to separate the kernel from the entire operating system\nMaking contributions to the kernel\nGraphical system, and how it works\nWorking at the command line\nFilesystem layout, partitions\nMonitoring utilities\n\nYou will learn what it’s like to work on Linux system, and get a good understanding of the essential skills you need when you work on a daily basis with Linux systems.\n\nSHOW ALL ABOUT LINUX FOR DEVELOPERS\nSHOW ALL"
    },
    {
       "Url":"/learn/linux-tools-for-developers?specialization=oss-development-linux-git",
       "name":"Linux Tools for Developers",
       "Rating":"Linux Tools for Developers\n4.6\nstars\n590 ratings\n•\n105 reviews\n\nCourse 3 is a continuation of the previous course, and will focus on teaching you how to work with tools you need to do your everyday work. The course begins by introducing you to numerous essential command line tools that are used daily. Then, it focuses on bash scripting - you will learn how to construct scripts and how to do very complicated tasks in an automated way. The course looks at files and filesystems and focuses on compiling programs in Linux, using gcc and other compilers, and using libraries of different types. It also takes a look at how Java works in Linux, and explains why there is no reason to worry about having easy-to-use Java programs in Linux. Course 3 ends by covering building packages out of software in Linux.\n\nSHOW ALL ABOUT LINUX TOOLS FOR DEVELOPERS\nSHOW ALL"
    },
    {
       "Url":"/learn/git-distributed-development?specialization=oss-development-linux-git",
       "name":"Using Git for Distributed Development",
       "Rating":"Using Git for Distributed Development\n4.6\nstars\n451 ratings\n•\n86 reviews\n\nCourse 4 focuses on using git for open source software distributed development. Git is a revision control system which arose out of the Linux kernel development community. Git was designed to help developers spread across the globe working on complicated projects coordinate their work in a rational way and keep track of everything they were doing. Overtime, Git has grown to be used by millions of projects today. This course gives you the opportunity to learn how to use git efficiently and make contributions in a relatively short amount of time. It will cover:\n\nHow to install git\nHow to initialize a repository\nHow to make changes in a repository\nHow to make changes in repositories available to others\nHow to acquire changes made by other individuals\nHow to find errors in your work and go back to earlier states of yoru projects\nHow to make commits, diffs, merges, rebases.\n\nThe course will help you get the skills to have a good understanding on how to use git. You will have a good knowledge about git workflows, identifying problems in your workflows, and finding solutions to solve these problems.\n\nSHOW ALL ABOUT USING GIT FOR DISTRIBUTED DEVELOPMENT\nSHOW ALL"
    },
    "/specializations/public-health-epidemiology",
    {
       "Url":"/learn/measuring-disease-epidemiology?specialization=public-health-epidemiology",
       "name":"Measuring Disease in Epidemiology",
       "Rating":"Measuring Disease in Epidemiology\n4.7\nstars\n548 ratings\n•\n116 reviews\n\nEpidemiological research is ubiquitous. Even if you don’t realise it, you come across epidemiological studies and the impact of their findings every single day. You have probably heard that obesity is increasing in high income countries or that malaria is killing millions of people in low income countries. It is common knowledge that smoking causes cancer and that physical activity is protective against heart disease. These facts may seem obvious today, but it took decades of epidemiological research to produce the necessary evidence. In this course, you will learn the fundamental tools of epidemiology which are essential to conduct such studies, starting with the measures used to describe the frequency of a disease or health-related condition. You will also learn how to quantify the strength of an association and discuss the distinction between association and causation. In the second half of the course, you will use this knowledge to describe different strategies for prevention, identify strengths and weaknesses of diagnostic tests and consider when a screening programme is appropriate.\n\nSHOW ALL ABOUT MEASURING DISEASE IN EPIDEMIOLOGY\nSHOW ALL"
    },
    {
       "Url":"/learn/study-designs-epidemiology?specialization=public-health-epidemiology",
       "name":"Study Designs in Epidemiology",
       "Rating":"Study Designs in Epidemiology\n4.8\nstars\n451 ratings\n•\n74 reviews\n\nChoosing an appropriate study design is a critical decision that can largely determine whether your study will successfully answer your research question. A quick look at the contents page of a biomedical journal or even at the health news section of a news website is enough to tell you that there are many different ways to conduct epidemiological research. \n\nIn this course, you will learn about the main epidemiological study designs, including cross-sectional and ecological studies, case-control and cohort studies, as well as the more complex nested case-control and case-cohort designs. The final module is dedicated to randomised controlled trials, which is often considered the optimal study design, especially in clinical research. You will also develop the skills to identify strengths and limitations of the various study designs. By the end of this course, you will be able to choose the most suitable study design considering the research question, the available time, and resources.\n\nSHOW ALL ABOUT STUDY DESIGNS IN EPIDEMIOLOGY\nSHOW ALL"
    },
    {
       "Url":"/learn/validity-bias-epidemiology?specialization=public-health-epidemiology",
       "name":"Validity and Bias in Epidemiology",
       "Rating":"Validity and Bias in Epidemiology\n4.9\nstars\n192 ratings\n•\n41 reviews\n\nEpidemiological studies can provide valuable insights about the frequency of a disease, its potential causes and the effectiveness of available treatments. Selecting an appropriate study design can take you a long way when trying to answer such a question. However, this is by no means enough. A study can yield biased results for many different reasons. This course offers an introduction to some of these factors and provides guidance on how to deal with bias in epidemiological research. In this course you will learn about the main types of bias and what effect they might have on your study findings. You will then focus on the concept of confounding and you will explore various methods to identify and control for confounding in different study designs. In the last module of this course we will discuss the phenomenon of effect modification, which is key to understanding and interpreting study results. We will finish the course with a broader discussion of causality in epidemiology and we will highlight how you can utilise all the tools that you have learnt to decide whether your findings indicate a true association and if this can be considered causal.\n\nSHOW ALL ABOUT VALIDITY AND BIAS IN EPIDEMIOLOGY\nSHOW ALL"
    },
    "/specializations/coaching-skills-manager",
    {
       "Url":"/learn/managing-as-a-coach?specialization=coaching-skills-manager",
       "name":"Managing as a Coach",
       "Rating":"Managing as a Coach\n4.7\nstars\n1,206 ratings\n•\n352 reviews\n\nDo you (or do you want to) manage employees? Have you ever wondered how to get better performance out of those you manage? Are you unsure if you are communicating effectively with your employees? If you answered “yes” to any of these questions, then this course – and its associated specialization – is for you!\n\nLeadership and management responsibilities have changed dramatically, particularly in the last decade. In order to be an effective manager in increasingly fast-paced and complex organizational environments, coaching has become essential. \n\nIn this course, you will learn what coaching is and learn how to differentiate between it and all of the other myriad roles managers are expected to perform – managing, mentoring, leading, and training. You’ll learn about the importance of strong leadership and learn to describe your current point of view as a leader, and evaluate when to adjust your thinking in order to be more effective in managing and leading in a rapidly evolving workplace.\n\nAnd finally, you’ll be introduced to the Thought Model, a coaching technique you can use to develop better thinkers and better performers. So if you’re ready to learn all about how to be a more effective and valued manager using coaching techniques, join us as we explore more successful managing through coaching!\n\nSHOW ALL ABOUT MANAGING AS A COACH\nSHOW ALL"
    },
    {
       "Url":"/learn/coaching-expectations-performance?specialization=coaching-skills-manager",
       "name":"Setting Expectations & Assessing Performance Issues",
       "Rating":"Setting Expectations & Assessing Performance Issues\n4.7\nstars\n465 ratings\n•\n114 reviews\n\nIf you don’t know where you are going, any road will take you there. One of the most important roles of a manager is to ensure everyone knows the destination. The most effective managers set expectations and assess their employees’ performance against those expectations, and take a coaching approach to helping them get to the destination. That’s exactly what you’ll learn to do in this course!\n\nYou will explore how to collaboratively develop expectations with those you lead. When you encounter expectations that are not being met, you’ll learn how to use \"Coaching Algebra\" to determine the underlying issues that are impeding performance, and how to respond as a manger-coach.  \n\nWe look forward to you joining us as we explore these essential coaching topics!\n\nSHOW ALL ABOUT SETTING EXPECTATIONS & ASSESSING PERFORMANCE ISSUES\nSHOW ALL"
    },
    {
       "Url":"/learn/coaching-practices?specialization=coaching-skills-manager",
       "name":"Coaching Practices",
       "Rating":"Coaching Practices\n4.7\nstars\n389 ratings\n•\n105 reviews\n\nIn order for coaching to be most effective, it’s important that there is strong culture of coaching and accountability which you will learn how to incorporate into your one-on-one meetings in this course. \n\nWe’ll discuss strategies in coaching great employees who are highly motivated, consistent performers, and poor performers.  \n\nWe’ll explore specific tools, such as a coaching agenda, you can employ immediately in your coaching conversations. You will learn how to use the \"Coaching Algebra\" technique in typical performance scenarios managers encounter. Finally, you’ll walk away from this course with some concrete strategies on how to coach other coach-managers.\n\nIf you are ready to begin creating a coaching practice within your own organization, please join us in this course!\n\nSHOW ALL ABOUT COACHING PRACTICES\nSHOW ALL"
    },
    {
       "Url":"/learn/coaching-conversations?specialization=coaching-skills-manager",
       "name":"Coaching Conversations",
       "Rating":"Coaching Conversations\n4.7\nstars\n232 ratings\n•\n63 reviews\n\nThroughout the Coaching Skills for Managers specialization, we’ve discussed many topics for improving coaching conversations with our employees. It is now time to put all of that theory and discussion into practice and examine great examples of common coaching conversations!\n\nNote: This course builds on all previous courses in the Coaching Skills for Managers specialization. It is highly recommended that students complete or be familiar with the topics covered in those courses before taking this course. In particular, you should be familiar with the coaching strategies and tools discussed in previous courses (such as the 5 whys technique, resisting what is, among others), and should have a full understanding of the Thought model and the various components of it: circumstances, thoughts, feelings, actions, and results.\n\nBy the end of this course, you will be able to demonstrate appropriate and effective strategies when engaging in coaching conversations with those that you lead. By exploring and analyzing common coaching scenarios that are acted out in this course, you will have a great sense of what works well and not so well during such a conversation. Specifically, you'll be able to better differentiate between a developmental coaching approach and a directive management style, discuss new strategies and techniques for dealing with both mind set and skill set gaps, describe how to use the feedback loop effectively in a conversation, and demonstrate the use of good questioning techniques and the thought model to not only help an employee identify issues, but help the employee really change their thinking.\n\nThe final assignment is all about actually having a coaching conversation with another person where you can apply everything you've learned in this course and throughout the Coaching Skills for Managers specialization. Again, it is highly recommended students complete the other courses in the specialization before taking this one. This peer review assignment, in particular, will be difficult to complete without knowledge of the topics covered in these courses.\n\nAfter going through the course materials and completing the assessments, you will be able to have more effective one-on one-coaching meetings with those you manage and deepen your understanding of the essential practice of coaching conversations.\n\nSHOW ALL ABOUT COACHING CONVERSATIONS\nSHOW ALL"
    },
    "/specializations/managing-major-engineering-projects",
    {
       "Url":"/learn/major-engineering-project-performance?specialization=managing-major-engineering-projects",
       "name":"Major Engineering Project Performance",
       "Rating":"Major Engineering Project Performance\n4.7\nstars\n728 ratings\n•\n168 reviews\n\nManage large projects by identifying their key characteristics, examining the key factors and risks that affect their performance and exploring methods to counter their impact on the successful delivery of projects.\n\nLooking into examples of best practice, you'll explore the relationship between projects, programmes and portfolios.  You'll also discover the roles performed by the project manager, examine the difficulties associated with quantifying transaction costs in major project management and consider how different management approaches impact on these costs. Optimism bias and strategic misinterpretation regularly cause delays to major engineering projects. Using stimulating case studies, you'll evaluate the measures of success and compare and contrast 'project success' versus 'project management success'. In the final week of the course, you'll research and present a contemporary example of a major engineering project from your own country. \n\nThis course explores concepts analysed in the University’s Online MSc in Engineering Management. If you are interested to develop your skills further, take a look at our online degree.\n\nSHOW ALL ABOUT MAJOR ENGINEERING PROJECT PERFORMANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/major-engineering-projects?specialization=managing-major-engineering-projects",
       "name":"Major Engineering Projects: Governance, Risk and Scope",
       "Rating":"Major Engineering Projects: Governance, Risk and Scope\n4.8\nstars\n220 ratings\n•\n44 reviews\n\nGain confidence when dealing with stakeholders of major projects by learning to identify and manage those that are involved in the project planning and delivery. This course will enable you to explore project governance in theory and practice.\n\nThrough real life examples you’ll understand how the critical challenges of the governance in major projects are resolved.\n\nBeing able to successfully manage risk and uncertainty in major projects is vital for their delivery. In this course you’ll learn to distinguish between risk and uncertainty and the role of risk register. You’ll identify the unique challenges of scope management in major projects and employ scope management tools and techniques that will facilitate your project planning. \n\nThis course explores concepts analysed in the University’s Online MSc in Engineering Management. If you are interested to develop your skills further, take a look at our online degree.\n\nSHOW ALL ABOUT MAJOR ENGINEERING PROJECTS: GOVERNANCE, RISK AND SCOPE\nSHOW ALL"
    },
    {
       "Url":"/learn/financing-major-engineering-projects?specialization=managing-major-engineering-projects",
       "name":"Financing and Initiating Major Engineering Projects",
       "Rating":"Financing and Initiating Major Engineering Projects\n4.8\nstars\n178 ratings\n•\n41 reviews\n\nTo successfully lead major projects you have to understand typical investor and project financing approaches. In this course, you’ll learn to interpret some key contractual instruments that are relevant for the financing of major engineering projects so that you are in a position to ensure the financially secure delivery of your project. You’ll explore the concept of “time value of money” and be able to compute key indicators such as “Pay-back time”, “Net Present value” and “Internal Rate of Return”.\n\nYou’ll identify common stakeholder and management approaches, and be able to implement key messaging, taking accurate requirements and manage expectations.\n\nThrough real-life case studies you’ll identify appropriate best practice related to governance, execution strategies, requirements management, procurement, asset and risk management and organisational design and development for the successful delivery of large engineering projects. \n\nThis course explores concepts analysed in the University’s Online MSc in Engineering Management. If you are interested to develop your skills further, take a look at our online degree.\n\nSHOW ALL ABOUT FINANCING AND INITIATING MAJOR ENGINEERING PROJECTS\nSHOW ALL"
    },
    "/specializations/modeling-and-control-of-power-electronics",
    {
       "Url":"/learn/averagedswitchmodelingandsimulation?specialization=modeling-and-control-of-power-electronics",
       "name":"Averaged-Switch Modeling and Simulation",
       "Rating":"Averaged-Switch Modeling and Simulation\n4.7\nstars\n47 ratings\n•\n14 reviews\n\nThis course can also be taken for academic credit as ECEA 5705, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis is Course #1 in the Modeling and Control of Power Electronics course sequence. The course is focused on practical design-oriented modeling and control of pulse-width modulated switched mode power converters using analytical and simulation tools in time and frequency domains. A design-oriented analysis technique known as the Middlebrook's feedback theorem is introduced and applied to analysis and design of voltage regulators and other feedback circuits. Furthermore, it is shown how circuit averaging and averaged-switch modeling techniques lead to converter averaged models suitable for hand analysis, computer-aided analysis, and simulations of converters. After completion of this course, the student will be able to practice design of high-performance control loops around switched-mode power converters using analytical and simulation techniques. \n\nWe strongly recommend students complete the CU Boulder Power Electronics specialization before enrolling in this course (course numbers provided for students in CU Boulder's MS-EE program):\n \n● Introduction to Power Electronics (ECEA 5700)\n● Converter Circuits (ECEA 5701)\n● Converter Control (ECEA 5702)\n\nAfter completing this course, you will be able to:\n\n● Explain operation and modeling of switched-mode power converters\n● Model open-loop transfer functions and frequency responses\n● Design closed-loop regulated switched-mode power converters\n● Verify operation of switched-mode power converters by simulations\n● Understand the Feedback Theorem principles\n● Apply the Feedback Theorem to practical design examples\n● Derive averaged switch models of and averaged circuit models of power converters\n● Apply averaged-switch modeling techniques to analysis and design and simulations of power converters\n\nSHOW ALL ABOUT AVERAGED-SWITCH MODELING AND SIMULATION\nSHOW ALL"
    },
    {
       "Url":"/learn/techniques-of-design-oriented-analysis?specialization=modeling-and-control-of-power-electronics",
       "name":"Techniques of Design-Oriented Analysis",
       "Rating":"Techniques of Design-Oriented Analysis\n4.8\nstars\n13 ratings\n•\n3 reviews\n\nThis course can also be taken for academic credit as ECEA 5706, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis is Course #2 in the Modeling and Control of Power Electronics course sequence. The course is focused on techniques of design-oriented analysis that allow you to quickly gain insights into models of switching power converters and to translate these insights into practical converter designs. The design-oriented techniques covered are the Extra Element Theorem and the N-Extra Element Theorem (N-EET). Through practical examples, it is shown how the EET can be used to simplify circuit analysis, to examine the effects of initially unmodeled components, and to design damping of converters such as SEPIC and Cuk to achieve high-performance closed-loop controls. The N-EET will allow you to perform circuit analysis and to derive circuit responses with minimum algebra. Modeling and design examples are supported by design-oriented MATLAB script and Spice simulations. After completion of this course, the student will gain analytical skills applicable to the design of high-performance closed-loop controlled switching power converters. \n\nWe strongly recommend students complete the CU Boulder Power Electronics specialization as well as Course #1 Averaged-Switch Modeling and Simulation before enrolling in this course (the course numbers provided below are for students in the CU Boulder's MS-EE program):\n \n● Introduction to Power Electronics (ECEA 5700)\n● Converter Circuits (ECEA 5701)\n● Converter Control (ECEA 5702)\n● Averaged-Switch Modeling and Simulation (ECEA 5705)\n\nAfter completing this course, you will be able to:\n\n● Understand statement and derivation of the Extra Element Theorem\n● Apply the Extra Element Theorem to converter analysis and design problems\n● Understand the statement of the N-Extra Element Theorem\n● Apply the N-Extra Element Theorem to converter analysis and design problems\n● Apply techniques of design-oriented analysis to analysis, design, and simulations of switching converters\n\nSHOW ALL ABOUT TECHNIQUES OF DESIGN-ORIENTED ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/inputfilterdesign?specialization=modeling-and-control-of-power-electronics",
       "name":"Input Filter Design",
       "Rating":"Input Filter Design\n4.9\nstars\n14 ratings\n•\n3 reviews\n\nThis course can also be taken for academic credit as ECEA 5707, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis is Course #3 in the Modeling and Control of Power Electronics course sequence. After completion of this course, you will gain an understanding of issues related to electromagnetic interference (EMI) and electromagnetic compatibility (EMC), the need for input filters and the effects input filters may have on converter responses. You will be able to design properly damped single and multi-section filters to meet the conducted EMI attenuation requirements without compromising frequency responses or stability of closed-loop controlled power converters. \n\nWe strongly recommend students complete the CU Boulder Power Electronics specialization as well as Courses #1 (Averaged-Switch Modeling and Simulation) and #2 (Techniques of Design-Oriented Analysis) before enrolling in this course (the course numbers provided below are for students in the CU Boulder's MS-EE program):\n \n● Introduction to Power Electronics (ECEA 5700)\n● Converter Circuits (ECEA 5701)\n● Converter Control (ECEA 5702)\n● Averaged-Switch Modeling and Simulation (ECEA 5705)\n● Techniques of Design-Oriented Analysis (ECEA 5706)\n\nAfter completing this course, you will be able to:\n\n● Understand conducted electromagnetic interference (EMI) and the need for input filter\n● Understand input filter design principles based on attenuation requirements and impedance interactions. \n● Design properly damped single-stage input filters. \n● Design properly damped multi-stage input filters. \n● Use computer-aided tools and simulations to verify input filter design\n\nSHOW ALL ABOUT INPUT FILTER DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/current-modecontrol?specialization=modeling-and-control-of-power-electronics",
       "name":"Current-Mode Control",
       "Rating":"Current-Mode Control\n\nThis course can also be taken for academic credit as ECEA 5708, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis is Course #4 in the Modeling and Control of Power Electronics course sequence. The course is focused on current-mode control techniques, which are very frequently applied in practical realizations of switched-mode. Practical advantages of peak current mode control are discussed, including built-in overcurrent protection, simpler and more robust dynamic responses, as well as abilities to ensure current sharing in parallel connected converter modules. For peak current-mode controlled converters, slope compensation, and high-frequency effects are discussed in detail. Upon completion of the course, you will be able to understand, analyze, model, and design high-performance current-mode controllers for dc-dc power converters, including peak current-mode controllers and average current-mode controllers. \n\nWe strongly recommend students complete the CU Boulder Power Electronics specialization as well as Course #1 (Averaged-Switch Modeling and Simulation) before enrolling in this course (the course numbers provided below are for students in the CU Boulder's MS-EE program):\n \n● Introduction to Power Electronics (ECEA 5700)\n● Converter Circuits (ECEA 5701)\n● Converter Control (ECEA 5702)\n● Averaged-Switch Modeling and Simulation (ECEA 5705)\n\nAfter completing this course, you will be able to:\n\n● Understand the operating principles and benefits of current-mode control for dc-dc converters \n● Model and design peak current-mode controlled dc-dc converters \n● Model and design average current-mode controlled dc-dc converters \n● Use computer-aided tools and simulations to verify current-mode controlled dc-dc converters\n\nSHOW ALL ABOUT CURRENT-MODE CONTROL\nSHOW ALL"
    },
    {
       "Url":"/learn/modeling-and-control-of-single-phase-rectifiers-and-inverters?specialization=modeling-and-control-of-power-electronics",
       "name":"Modeling and Control of Single-Phase Rectifiers and Inverters",
       "Rating":"Modeling and Control of Single-Phase Rectifiers and Inverters\n\nThis course can also be taken for academic credit as ECEA 5709, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis is Course #5 in the Modeling and Control of Power Electronics Specialization. The course is focused on modeling and control of grid-tied power electronics. Upon completion of the course, you will be able to understand, analyze, model, and design low-harmonic rectifiers and inverters interfacing dc loads or dc power sources, such as photovoltaic arrays, to the single-phase ac power grid. \n\nWe strongly recommend students complete the CU Boulder Power Electronics Specialization as well as Courses #1 (Averaged-Switch Modeling and Simulation) and #4 (Current-Mode Control) before enrolling in this course (the course numbers provided below are for students in the CU Boulder's MS-EE program):\n \n● Introduction to Power Electronics (ECEA 5700)\n● Converter Circuits (ECEA 5701)\n● Converter Control (ECEA 5702)\n● Averaged-Switch Modeling and Simulation (ECEA 5705)\n● Current-Mode Control (ECEA 5708)\n\nAfter completing this course, you will be able to:\n\n● Understand the operating principles of low-harmonic, high power factor rectifier and inverters\n● Model and design current shaping and voltage control loops in power factor correction (PFC) rectifiers\n● Model and design control loops in single-phase dc-to-ac inverters \n● Design photovoltaic power systems tied to the single-phase ac power grid\n● Use computer-aided tools and simulations to verify the design of rectifiers and inverters\n\nSHOW ALL ABOUT MODELING AND CONTROL OF SINGLE-PHASE RECTIFIERS AND INVERTERS\nSHOW ALL"
    },
    "/specializations/ibm-ai-workflow",
    {
       "Url":"/learn/ibm-ai-workflow-business-priorities-data-ingestion?specialization=ibm-ai-workflow",
       "name":"AI Workflow: Business Priorities and Data Ingestion",
       "Rating":"AI Workflow: Business Priorities and Data Ingestion\n4.3\nstars\n139 ratings\n•\n33 reviews\n\nThis is the first course of a six part specialization.  You are STRONGLY encouraged to complete these courses in order as they are not individual independent courses, but part of a workflow where each course builds on the previous ones.\n\nThis first course in the IBM AI Enterprise Workflow Certification specialization introduces you to the scope of the specialization and prerequisites.  Specifically, the courses in this specialization are meant for practicing data scientists who are knowledgeable about probability, statistics, linear algebra, and Python tooling for data science and machine learning.  A hypothetical streaming media company will be introduced as your new client.  You will be introduced to the concept of design thinking, IBMs framework for organizing large enterprise AI projects.  You will also be introduced to the basics of scientific thinking, because the quality that distinguishes a seasoned data scientist from a beginner is creative, scientific thinking.  Finally you will start your work for the hypothetical media company by understanding the data they have, and by building a data ingestion pipeline using Python and Jupyter notebooks.\n \nBy the end of this course you should be able to:\n1.  Know the advantages of carrying out data science using a structured process\n2.  Describe how the stages of design thinking correspond to the AI enterprise workflow\n3.  Discuss several strategies used to prioritize business opportunities\n4.  Explain where data science and data engineering have the most overlap in the AI workflow\n5.  Explain the purpose of testing in data ingestion \n6.  Describe the use case for sparse matrices as a target destination for data ingestion \n7.  Know the initial steps that can be taken towards automation of data ingestion pipelines\n \nWho should take this course?\nThis course targets existing data science practitioners that have expertise building machine learning models, who want to deepen their skills on building and deploying AI in large enterprises. If you are an aspiring Data Scientist, this course is NOT for you as you need real world expertise to benefit from the content of these courses.\n \nWhat skills should you have?\nIt is assumed you have a solid understanding of the following topics prior to starting this course: Fundamental understanding of Linear Algebra; Understand sampling, probability theory, and probability distributions; Knowledge of descriptive and inferential statistical concepts; General understanding of machine learning techniques and best practices; Practiced understanding of Python and the packages commonly used in data science: NumPy, Pandas, matplotlib, scikit-learn; Familiarity with IBM Watson Studio; Familiarity with the design thinking process.\n\nSHOW ALL ABOUT AI WORKFLOW: BUSINESS PRIORITIES AND DATA INGESTION\nSHOW ALL"
    },
    {
       "Url":"/learn/ibm-ai-workflow-data-analysis-hypothesis-testing?specialization=ibm-ai-workflow",
       "name":"AI Workflow: Data Analysis and Hypothesis Testing",
       "Rating":"AI Workflow: Data Analysis and Hypothesis Testing\n4.2\nstars\n90 ratings\n•\n15 reviews\n\nThis is the second course in the IBM AI Enterprise Workflow Certification specialization.  You are STRONGLY encouraged to complete these courses in order as they are not individual independent courses, but part of a workflow where each course builds on the previous ones.  \n\nIn this course you will begin your work for a hypothetical streaming media company by doing exploratory data analysis (EDA).  Best practices for data visualization, handling missing data, and hypothesis testing will be introduced to you as part of your work.  You will learn techniques of estimation with probability distributions and extending these estimates to apply null hypothesis significance tests. You will apply what you learn through two hands on case studies: data visualization and multiple testing using a simple pipeline.\n \nBy the end of this course you should be able to:\n1.  List several best practices concerning EDA and data visualization\n2.  Create a simple dashboard in Watson Studio\n3.  Describe strategies for dealing with missing data\n4.  Explain the difference between imputation and multiple imputation\n5.  Employ common distributions to answer questions about event probabilities\n6.  Explain the investigative role of hypothesis testing in EDA\n7.  Apply several methods for dealing with multiple testing\n \nWho should take this course?\nThis course targets existing data science practitioners that have expertise building machine learning models, who want to deepen their skills on building and deploying AI in large enterprises. If you are an aspiring Data Scientist, this course is NOT for you as you need real world expertise to benefit from the content of these courses.\n\nWhat skills should you have?\nIt is assumed that you have completed Course 1 of the IBM AI Enterprise Workflow specialization and have a solid understanding of the following topics prior to starting this course: Fundamental understanding of Linear Algebra; Understand sampling, probability theory, and probability distributions; Knowledge of descriptive and inferential statistical concepts; General understanding of machine learning techniques and best practices; Practiced understanding of Python and the packages commonly used in data science: NumPy, Pandas, matplotlib, scikit-learn; Familiarity with IBM Watson Studio; Familiarity with the design thinking process.\n\nSHOW ALL ABOUT AI WORKFLOW: DATA ANALYSIS AND HYPOTHESIS TESTING\nSHOW ALL"
    },
    {
       "Url":"/learn/ibm-ai-workflow-feature-engineering-bias-detection?specialization=ibm-ai-workflow",
       "name":"AI Workflow: Feature Engineering and Bias Detection",
       "Rating":"AI Workflow: Feature Engineering and Bias Detection\n4.5\nstars\n60 ratings\n•\n7 reviews\n\nThis is the third course in the IBM AI Enterprise Workflow Certification specialization.    You are STRONGLY encouraged to complete these courses in order as they are not individual independent courses, but part of a workflow where each course builds on the previous ones.  \n\nCourse 3 introduces you to the next stage of the workflow for our hypothetical media company.  In this stage of work you will learn best practices for feature engineering, handling class imbalances and detecting bias in the data.  Class imbalances can seriously affect the validity of your machine learning models, and the mitigation of bias in data is essential to reducing the risk associated with biased models.  These topics will be followed by sections on best practices for dimension reduction, outlier detection, and unsupervised learning techniques for finding patterns in your data.  The case studies will focus on topic modeling and data visualization.\n \nBy the end of this course you will be able to:\n1.  Employ the tools that help address class and class imbalance issues\n2.  Explain the ethical considerations regarding bias in data\n3.  Employ ai Fairness 360 open source libraries to detect bias in models\n4.  Employ dimension reduction techniques for both EDA and transformations stages\n5.  Describe topic modeling techniques in natural language processing\n6.  Use topic modeling and visualization to explore text data\n7.  Employ outlier handling best practices in high dimension data\n8.  Employ outlier detection algorithms as a quality assurance tool and a modeling tool\n9.  Employ unsupervised learning techniques using pipelines as part of the AI workflow\n10.  Employ basic clustering algorithms\n \nWho should take this course?\nThis course targets existing data science practitioners that have expertise building machine learning models, who want to deepen their skills on building and deploying AI in large enterprises. If you are an aspiring Data Scientist, this course is NOT for you as you need real world expertise to benefit from the content of these courses.\n \nWhat skills should you have?\nIt is assumed that you have completed Courses 1 and 2 of the IBM AI Enterprise Workflow specialization and you have a solid understanding of the following topics prior to starting this course: Fundamental understanding of Linear Algebra; Understand sampling, probability theory, and probability distributions; Knowledge of descriptive and inferential statistical concepts; General understanding of machine learning techniques and best practices; Practiced understanding of Python and the packages commonly used in data science: NumPy, Pandas, matplotlib, scikit-learn; Familiarity with IBM Watson Studio; Familiarity with the design thinking process.\n\nSHOW ALL ABOUT AI WORKFLOW: FEATURE ENGINEERING AND BIAS DETECTION\nSHOW ALL"
    },
    {
       "Url":"/learn/ibm-ai-workflow-machine-learning-vr-nlp?specialization=ibm-ai-workflow",
       "name":"AI Workflow: Machine Learning, Visual Recognition and NLP",
       "Rating":"AI Workflow: Machine Learning, Visual Recognition and NLP\n4.5\nstars\n60 ratings\n•\n9 reviews\n\nThis is the fourth course in the IBM AI Enterprise Workflow Certification specialization.    You are STRONGLY encouraged to complete these courses in order as they are not individual independent courses, but part of a workflow where each course builds on the previous ones. \n\nCourse 4 covers the next stage of the workflow, setting up models and their associated data pipelines for a hypothetical streaming media company.  The first topic covers the complex topic of evaluation metrics, where you will learn best practices for a number of different metrics including regression metrics, classification metrics, and multi-class metrics, which you will use to select the best model for your business challenge.  The next topics cover best practices for different types of models including linear models, tree-based models, and neural networks.  Out-of-the-box Watson models for natural language understanding and visual recognition will be used.  There will be case studies focusing on natural language processing and on image analysis to provide realistic context for the model pipelines.\n \nBy the end of this course you will be able to:\nDiscuss common regression, classification, and multilabel classification metrics\nExplain the use of linear and logistic regression in supervised learning applications\nDescribe common strategies for grid searching and cross-validation\nEmploy evaluation metrics to select models for production use\nExplain the use of tree-based algorithms in supervised learning applications\nExplain the use of Neural Networks in supervised learning applications\nDiscuss the major variants of neural networks and recent advances\nCreate a neural net model in Tensorflow\nCreate and test an instance of Watson Visual Recognition\nCreate and test an instance of Watson NLU\n\nWho should take this course?\nThis course targets existing data science practitioners that have expertise building machine learning models, who want to deepen their skills on building and deploying AI in large enterprises. If you are an aspiring Data Scientist, this course is NOT for you as you need real world expertise to benefit from the content of these courses.\n \nWhat skills should you have?\nIt is assumed that you have completed Courses 1 through 3 of the IBM AI Enterprise Workflow specialization and you have a solid understanding of the following topics prior to starting this course: Fundamental understanding of Linear Algebra; Understand sampling, probability theory, and probability distributions; Knowledge of descriptive and inferential statistical concepts; General understanding of machine learning techniques and best practices; Practiced understanding of Python and the packages commonly used in data science: NumPy, Pandas, matplotlib, scikit-learn; Familiarity with IBM Watson Studio; Familiarity with the design thinking process.\n\nSHOW ALL ABOUT AI WORKFLOW: MACHINE LEARNING, VISUAL RECOGNITION AND NLP\nSHOW ALL"
    },
    {
       "Url":"/learn/ibm-ai-workflow-machine-learning-model-deployment?specialization=ibm-ai-workflow",
       "name":"AI Workflow: Enterprise Model Deployment",
       "Rating":"AI Workflow: Enterprise Model Deployment\n4.2\nstars\n44 ratings\n•\n9 reviews\n\nThis is the fifth course in the IBM AI Enterprise Workflow Certification specialization.   You are STRONGLY encouraged to complete these courses in order as they are not individual independent courses, but part of a workflow where each course builds on the previous ones.\n\nThis course introduces you to an area that few data scientists are able to experience: Deploying models for use in large enterprises.  Apache Spark is a very commonly used framework for running machine learning models.  Best practices for using Spark will be covered in this course.  Best practices for data manipulation, model training, and model tuning will also be covered.  The use case will call for the creation and deployment of a recommender system. The course wraps up with an introduction to model deployment technologies.\n \nBy the end of this course you will be able to:\n1.  Use Apache Spark's RDDs, dataframes, and a pipeline\n2.  Employ spark-submit scripts to interface with Spark environments\n3.  Explain how collaborative filtering and content-based filtering work\n4.  Build a data ingestion pipeline using Apache Spark and Apache Spark streaming\n5.  Analyze hyperparameters in machine learning models on Apache Spark\n6.  Deploy machine learning algorithms using the Apache Spark machine learning interface\n7.  Deploy a machine learning model from Watson Studio to Watson Machine Learning\n\nWho should take this course?\nThis course targets existing data science practitioners that have expertise building machine learning models, who want to deepen their skills on building and deploying AI in large enterprises. If you are an aspiring Data Scientist, this course is NOT for you as you need real world expertise to benefit from the content of these courses.\n\nWhat skills should you have?\nIt is assumed that you have completed Courses 1 through 4 of the IBM AI Enterprise Workflow specialization and you have a solid understanding of the following topics prior to starting this course: Fundamental understanding of Linear Algebra; Understand sampling, probability theory, and probability distributions; Knowledge of descriptive and inferential statistical concepts; General understanding of machine learning techniques and best practices; Practiced understanding of Python and the packages commonly used in data science: NumPy, Pandas, matplotlib, scikit-learn; Familiarity with IBM Watson Studio; Familiarity with the design thinking process.\n\nSHOW ALL ABOUT AI WORKFLOW: ENTERPRISE MODEL DEPLOYMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/ibm-ai-workflow-ai-production?specialization=ibm-ai-workflow",
       "name":"AI Workflow: AI in Production",
       "Rating":"AI Workflow: AI in Production\n4.5\nstars\n41 ratings\n•\n10 reviews\n\nThis is the sixth course in the IBM AI Enterprise Workflow Certification specialization.   You are STRONGLY encouraged to complete these courses in order as they are not individual independent courses, but part of a workflow where each course builds on the previous ones.    \n\nThis course focuses on models in production at a hypothetical streaming media company.  There is an introduction to IBM Watson Machine Learning.  You will build your own API in a Docker container and learn how to manage containers with Kubernetes.  The course also introduces  several other tools in the IBM ecosystem designed to help deploy or maintain models in production.  The AI workflow is not a linear process so there is some time dedicated to the most important feedback loops in order to promote efficient iteration on the overall workflow.\n \nBy the end of this course you will be able to:\n1.  Use Docker to deploy a flask application\n2.  Deploy a simple UI to integrate the ML model, Watson NLU, and Watson Visual Recognition\n3.  Discuss basic Kubernetes terminology\n4.  Deploy a scalable web application on Kubernetes \n5.  Discuss the different feedback loops in AI workflow\n6.  Discuss the use of unit testing in the context of model production\n7.  Use IBM Watson OpenScale to assess bias and performance of production machine learning models.\n\nWho should take this course?\nThis course targets existing data science practitioners that have expertise building machine learning models, who want to deepen their skills on building and deploying AI in large enterprises. If you are an aspiring Data Scientist, this course is NOT for you as you need real world expertise to benefit from the content of these courses.\n \nWhat skills should you have?\nIt is assumed that you have completed Courses 1 through 5 of the IBM AI Enterprise Workflow specialization and you have a solid understanding of the following topics prior to starting this course: Fundamental understanding of Linear Algebra; Understand sampling, probability theory, and probability distributions; Knowledge of descriptive and inferential statistical concepts; General understanding of machine learning techniques and best practices; Practiced understanding of Python and the packages commonly used in data science: NumPy, Pandas, matplotlib, scikit-learn; Familiarity with IBM Watson Studio; Familiarity with the design thinking process.\n\nSHOW ALL ABOUT AI WORKFLOW: AI IN PRODUCTION\nSHOW ALL"
    },
    "/specializations/uiuc-iot",
    {
       "Url":"/learn/iot-devices-il?specialization=uiuc-iot",
       "name":"IoT Devices",
       "Rating":"IoT Devices\n4.3\nstars\n10 ratings\n•\n3 reviews\n\nThe Internet of Things (IoT) stands to be the next revolution in computing. Billions of data-spouting devices connected to the Internet are already fundamentally changing the way we live and work. This course teaches a deep understanding of IoT technologies from the ground up. Students will learn IoT device programming (Arduino and Raspberry Pi), sensing and actuating technologies, IoT protocol stacks (Zigbee, 5G, NFC, MQTT, etc), networking backhaul design and security enforcement, data science for IoT, and cloud-based IoT platforms such as AWS IoT. Students will be guided through laboratory assignments designed to give them practical real-world experience, where they will deploy a distributed wifi monitoring service, a cloud-based IoT service platform serving tens of thousands of heartbeat sensors, and more. Students will emerge from the class with a cutting-edge education on this rapidly emerging technology segment, and with the confidence to carry out tasks they will commonly encounter in industrial settings. Important: This whole series of courses consists in part of practical experimentation using actual hardware, which you will need to acquire. (Cost may vary between 100 and 200 USD depending on your location). Most parts that are needed for the first course, will be re-used in the following courses.\n\nSHOW ALL ABOUT IOT DEVICES\nSHOW ALL"
    },
    {
       "Url":"/learn/iot-communications?specialization=uiuc-iot",
       "name":"IoT Communications",
       "Rating":"IoT Communications\n\nThis course builds on the previous course: IoT Devices. After we have built and programmed a small self-driving vehicle, now it's time get into more advanced territory and enhance the device's connectivity further. To do so you will study radio frequency (RF) communication, the MAC layer, Mesh Networking as well as distributed algorithms for use with geographic locations. These techniques will be applied to your device in the lab, which is composed of four steps, one in each week of the course. In Week 1, after going over some orientation for the course, you will focus on radio frequency (RF) communication, how it fits in with the larger scope of electromagnetism, how RF signals propagate in physical environments, how RF signals can be used to encode data, and how all this information is useful in constructing resilient and high-bandwidth IoT communication substrates.\n\nSHOW ALL ABOUT IOT COMMUNICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/iot-networking?specialization=uiuc-iot",
       "name":"IoT Networking",
       "Rating":"IoT Networking\n\nThis course builds on the first two courses in this series: IoT Devices and IoT Communications. Here you will begin to learn enterprise IoT. Enterprise networks, from first-hop access to backend IoT services are critical because they allow your IoT devices to reach the Internet and achieve their true intelligence. IoT places extreme demands on first-hop access - ultra-dense deployments challenge spectrum allocation, the need to provide strong segmentation yet let devices reach into IoT services such as gateways and databases. During this week you will begin to learn about these challenges, and the underlying protocols and technologies of wired networks that can help you to address them.\n\nSHOW ALL ABOUT IOT NETWORKING\nSHOW ALL"
    },
    {
       "Url":"/learn/iot-cloud?specialization=uiuc-iot",
       "name":"IoT Cloud",
       "Rating":"IoT Cloud\n\nThis course is the last course in our series of four courses and builds on the previous three courses: IoT Devices, IoT Communications, and IoT Networking. After we have built and programmed a small self-driving vehicle, we then set out to enhance its connectivity and add important security infrastructure. In this course we will now look closer into various remaining types of decentralized network topography. In the lab, we will additionally cover important cloud technologies based on machine-learning. In the first two weeks' lectures, we will cover important components of networks. Metaphorically speaking, when you learn how the human body works, you start by understanding the \"organs\", the stomach, the liver, and so on. Likewise, we can best understand networks by understanding the individual components that make them up and their function. In this lecture series we will study \"devices\" such as routers, switches, firewalls, load balancers, and many more. We will learn about how they individually operate, how they are configured, and how they work together to achieve various network-wide properties and goals.\n\nSHOW ALL ABOUT IOT CLOUD\nSHOW ALL"
    },
    "/specializations/personal-finance-fundamentals",
    {
       "Url":"/learn/personal-finance-introduction?specialization=personal-finance-fundamentals",
       "name":"Introduction to Personal Finance",
       "Rating":"Introduction to Personal Finance\n4.7\nstars\n27 ratings\n•\n15 reviews\n\nThis course is a general overview of a variety of personal finance topics - including budgeting, the importance of your credit score, cash flow, setting financial goals, and taxes.  Taught by two CERTIFIED FINANCIAL PLANNER™ Professionals, the concepts are broken down through videos, readings, and activities so you can apply what you are learning in real time. The course provides the foundation to build on for the rest of The Fundamentals of Personal Finance Specialization or as a standalone survey course to improve your understanding of basic personal finance terminology, as well as how they apply to your own financial situation. \n\nWhether you are just starting college, nearing retirement, or somewhere in between, this course will provide you with the knowledge to understand your money and actionable steps to manage your finances in the future. This course is geared towards learners in the United States of America.\n\nSHOW ALL ABOUT INTRODUCTION TO PERSONAL FINANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/saving-money-future?specialization=personal-finance-fundamentals",
       "name":"Saving Money for the Future",
       "Rating":"Saving Money for the Future\n\nThis course is designed for anyone who currently has, or will have in the future have, savings goals. Learners will come to understand the importance of compounding growth, the variables that impact setting goals like retirement savings, and how much money you need to save now to reach future goals. The course will help learners think through individual goals, like retirement, but also how those goals fit into your bigger financial picture. For example, saving for retirement, buying a home, and funding college for your kids all at the same time. The instructors will also cover how preparing for emergencies can prevent the derailment of those financial goals.\n\nThe concepts covered in this course are broad but through the activities offered, learners will see how to apply what they are learning about saving money for the future to their lives now. This course is geared towards learners in the United States of America.\n\nSHOW ALL ABOUT SAVING MONEY FOR THE FUTURE\nSHOW ALL"
    },
    {
       "Url":"/learn/managing-debt?specialization=personal-finance-fundamentals",
       "name":"Managing Debt",
       "Rating":"Managing Debt\n\nThis course is aimed at anyone who has debt, is thinking of taking on debt, or wants to better understand debt as part of your overall financial picture.  It covers a variety of debt types, as well as debt payment options. The course will help you assess your current debt situation and understand the paths to paying off your debt. This includes categories such as mortgages, credit card debt, and student loans. Learn how to differentiate between good and bad debt, as well as how to think about debt as you work towards your financial goals. This course is geared towards learners in the United States of America.\n\nSHOW ALL ABOUT MANAGING DEBT\nSHOW ALL"
    },
    {
       "Url":"/learn/investing-fundamentals?specialization=personal-finance-fundamentals",
       "name":"Fundamentals of Investing",
       "Rating":"Fundamentals of Investing\n\nThis is primarily aimed at novice investors who want to better understand the concept of investing and how it can fit into their overall financial plan. Taught by a CERTIFIED FINANCIAL PLANNER™ Professional, this course will cover different investment vehicles, risk tolerance, diversification, and the difference between active and passive investing, as well as investment fees and taxes.\n\nWhether you are just getting started investing or want to play a more active role in your investment decisions, this course can provide you the knowledge to feel comfortable in the investing decisions you make for yourself and your family. This course is geared towards learners in the United States of America.\n\nSHOW ALL ABOUT FUNDAMENTALS OF INVESTING\nSHOW ALL"
    },
    {
       "Url":"/learn/risk-management-in-personal-finance?specialization=personal-finance-fundamentals",
       "name":"Risk Management in Personal Finance",
       "Rating":"Risk Management in Personal Finance\n\nThis course is primarily aimed at those who want to understand more about how they can protect their finances from unexpected events. Taught by a CERTIFIED FINANCIAL PLANNER™ Professional, this course covers the role insurance plays into your financial plan, including what kinds of insurance to explore, how to determine how much insurance you need, and how different kinds of insurance works. The course includes life insurance, health insurance, disability insurance, homeowners insurance, renters insurance, auto insurance, and umbrella insurance. You will also learn about estate planning, including the documents involved and special considerations for new parents.\n\nThis course helps you understand how protecting your money is an important part of financial planning. It is geared towards learners in the United States of America. It is part of The Fundamentals of Personal Finance specialization but can be taken as a standalone course as well.\n\nSHOW ALL ABOUT RISK MANAGEMENT IN PERSONAL FINANCE\nSHOW ALL"
    },
    "/specializations/effective-professional-communication",
    {
       "Url":"/learn/career-planning-tsu?specialization=effective-professional-communication",
       "name":"Career planning: resume/CV, cover letter, interview",
       "Rating":"Career planning: resume/CV, cover letter, interview\n4.8\nstars\n1,100 ratings\n•\n267 reviews\n\nDo you want a job? A first job or a better job? Your dream job? This course is for you if you want to get a job in any English-speaking country (or in an international company that uses English). After 10+ years helping people in different countries get hired for their dream job, I decided to partner with Coursera to make career success accessible for a worldwide audience. After completing this course, you will know how to stand out from the crowd, how to make a great first impression and how to highlight your strengths. Step by step, you will learn:\n\n1. How to find your ideal vacancy\n2. How to construct a resume/CV targeted for your dream vacancy\n3. How to compose a cover letter that makes a connection \n4. How to strategically prepare for a successful job interview.\n\nBut this is not all. I am glad to answer your individual questions. Please feel free to contact me by asking questions in the Discussion Forums. I aim to respond to 95% of questions within 24 hours.\n\nThe examples and strategies I share with you in this course have already helped people find their dream jobs in top companies around the world.\n\n\"Dr Peter J Mitchell is a real professional who cares about his clients and is always available to give important advice and support. I wholeheartedly recommend his services and even now, already as an employer, I engage him as a consultant!\"\n\n-\tSimon, CEO of Expopromoter/Biletum, Shanghai, China\n\n\"I have used Dr Mitchell’s services several times. He is a proven professional who always listens to your needs and precisely converts them to a result. It has always been a pleasure working with him.\"\n\n-\tIgor, Senior Consultant, PwC\n\nI would be delighted to help you on your journey to professional success. Sign up today to live your tomorrow!\n\nPeter J Mitchell\n\nSHOW ALL ABOUT CAREER PLANNING: RESUME/CV, COVER LETTER, INTERVIEW\nSHOW ALL"
    },
    {
       "Url":"/learn/introduction-to-professional-communication?specialization=effective-professional-communication",
       "name":"Introduction to Professional Communication",
       "Rating":"Introduction to Professional Communication\n5.0\nstars\n28 ratings\n•\n18 reviews\n\nYou will become proficient in modes of communication and how to effectively communicate in person, by phone and by email. You will enhance your understanding of others: communication principles, communication styles and reading between the lines. Finally, you will improve your ability to influence others and respond to influence: influencing strategies, strategies for presentations, making requests, declining requests, and mistakes in communication. By the end of the course, you will be able to communicate effectively in a variety of modes, make connections to your colleagues, and understand how to influence others and respond to influence.\n\nBut this is not all. I am glad to answer your individual questions. Please feel free to contact me by asking questions in the Discussion Forums. I aim to respond to 95% of questions within 24 hours.\n\nSHOW ALL ABOUT INTRODUCTION TO PROFESSIONAL COMMUNICATION\nSHOW ALL"
    },
    {
       "Url":"/learn/effective-communication-for-building-relationships?specialization=effective-professional-communication",
       "name":"Effective Communication for Building Relationships",
       "Rating":"Effective Communication for Building Relationships\n5.0\nstars\n11 ratings\n•\n10 reviews\n\nYou will become proficient in self-presentation: how you can create the right impression and fit in at work. You will enhance your expertise in intercultural communication: cultural values and cultural intelligence, working in an intercultural climate, and working in an intercultural team. Finally, you will gain valuable knowledge about interaction with clients: creating a win-win relationship, maintaining a positive relationship, and resolving conflict. By the end of the course, you will be able to present yourself positively, communicate effectively in a variety of settings, and build positive relationships with clients.\n\nBut this is not all. I am glad to answer your individual questions. Please feel free to contact me by asking questions in the Discussion Forums. I aim to respond to 95% of questions within 24 hours.\n\nSHOW ALL ABOUT EFFECTIVE COMMUNICATION FOR BUILDING RELATIONSHIPS\nSHOW ALL"
    },
    {
       "Url":"/learn/expert-communication-for-career-success?specialization=effective-professional-communication",
       "name":"Expert Communication for Career Success",
       "Rating":"Expert Communication for Career Success\n4.8\nstars\n11 ratings\n•\n7 reviews\n\nUpgrade your expert skills in interaction with colleagues: teamwork, collaborative problem solving, and conflict resolution. Enhance your interaction with superiors: building a relationship with your manager, influencing superiors, and becoming a leader. Finally, we cover your effective interaction with subordinates: building your own team, leadership and decision making, and organizing effective meetings. By the end of the course, you will be able to communicate effectively with colleagues and managers, and be prepared to communicate as a manager with your own team of employees.\n\nBut this is not all. I am glad to answer your individual questions. Please feel free to contact me by asking questions in the Discussion Forums. I aim to respond to 95% of questions within 24 hours.\n\nSHOW ALL ABOUT EXPERT COMMUNICATION FOR CAREER SUCCESS\nSHOW ALL"
    },
    {
       "Url":"/learn/effective-professional-communication-capstone?specialization=effective-professional-communication",
       "name":"Effective Professional Communication Capstone",
       "Rating":"Effective Professional Communication Capstone\n\nThis course completes the Effective Professional Communication Specialization, culminating in the Capstone Project. To successfully complete the specialization, you will complete four assignments and check several answers from your fellow students. The tasks check your skills and abilities obtained in the course of studying the four courses of the specialization: self-presentation skills and writing a resume, modes of communication and making requests, working in an intercultural team, resolving conflicts, and making decisions.\n\nBut this is not all. I am glad to answer your individual questions. Please feel free to contact me by asking questions in the Discussion Forums. I aim to respond to 95% of questions within 24 hours.\n\nThe examples and strategies I share with you in this course have already helped people find their dream jobs in top companies around the world.\n\n\"Dr Peter J Mitchell is a real professional who cares about his clients and is always available to give important advice and support. I wholeheartedly recommend his services!\"\n\n-\tSimon, CEO of Expopromoter, Shanghai, China\n\n\"I have used Dr Mitchell’s services several times. He is a proven professional who always listens to your needs and precisely converts them to a result. It has always been a pleasure working with him.\"\n\n-\tIgor, Senior Consultant, PwC\n\n\"It is with much enthusiasm that I am recommending Dr Peter Mitchell’s online course. Peter is always willing to take the time to discuss concerns and respond to questions.\"\n\n-\tLea, International School Principal, Sweden\n\nI would be delighted to help you on your journey to professional success. Sign up today to live your tomorrow!\n\nPeter J Mitchell\n\nSHOW ALL ABOUT EFFECTIVE PROFESSIONAL COMMUNICATION CAPSTONE\nSHOW ALL"
    },
    "/specializations/value-based-business-analytics",
    {
       "Url":"/learn/financial-markets-and-instruments?specialization=value-based-business-analytics",
       "name":"Financial Markets and Instruments",
       "Rating":"Financial Markets and Instruments\n\nFinancial markets and Instruments course is focused on the features and the use of various types of financial instruments including stocks, bonds and derivatives. It covers financial intermediation, market infrastructure and regulation. The emphasis is made on general economic intuition rather than on quantitative models. The course syllabus corresponds to the majority of learning outcome statements of CFA levels 2 and 3 and can be used a preparation resource for CFA certification. In comparison to other courses of this topic, this course covers such financial institutions as rating agencies, pension funds, hedge funds, venture capital and private equity funds, sovereign wealth funds).\n\nThe course is a major professional core course of the online degree Master program. Financial Markets and Instruments is the basic course, which is required for the further study of asset pricing using various quantitative models. These topics are covered in the Theory of Finance.\n\nThe main objective of the course is to provide detailed and thorough understanding of how financial markets work. Having successfully completed the course, students should be able to explain the differences between various types of financial instruments, understand the role of financial institutions in different types of financial markets. The course is also aimed to develop analytical and practical skills in the area of financial markets.\n\nThis Course is part of HSE University Master of Business Analytics degree program. Learn more about the admission into the program and how your Coursera work can be leveraged if accepted into the program here  https://inlnk.ru/bvD1E.\n\nSHOW ALL ABOUT FINANCIAL MARKETS AND INSTRUMENTS\nSHOW ALL"
    },
    {
       "Url":"/learn/ifrs-1?specialization=value-based-business-analytics",
       "name":"International Financial Reporting Standards-1",
       "Rating":"International Financial Reporting Standards-1\n4.3\nstars\n12 ratings\n•\n5 reviews\n\nThis course will provide students with knowledge on the formation and adoption of the international financial reporting standards, their basic concepts, and the requirements for the preparation and content of the financial statements used in the international practice. It will also prepare them for practical issues on financial reporting.\n\nThis Course is part of HSE University Master of Business Analytics degree program. Learn more about the admission into the program and how your Coursera work can be leveraged if accepted into the program here  https://inlnk.ru/bvD1E.\n\nSHOW ALL ABOUT INTERNATIONAL FINANCIAL REPORTING STANDARDS-1 \nSHOW ALL"
    },
    {
       "Url":"/learn/theory-of-finance?specialization=value-based-business-analytics",
       "name":"Theory of Finance",
       "Rating":"Theory of Finance\n\nThis course is part of HSE University Master of Business Analytics and Master of Finance degree programs. Learn more about the admission into the program and how your Coursera work can be leveraged if accepted into the program here https://inlnk.ru/bvD1E (Master of Business Analytics) and here https://inlnk.ru/WRM4O (Quantitative Finance)\n\nTheory of Finance covers the basic principles and fundamental theories of pricing and valuation of various types of financial assets including stocks, bonds and derivatives. The content of the course corresponds to CFA Level 1.\n\nHaving successfully completed the course, students should be familiar with the most commonly used asset pricing models applied by academic researchers and financial market analysts in order to determine the fair values of various financial instruments. Students should also understand the key assumptions and restrictions of these models in order to apply them correctly especially at emerging capital markets as compared to developed ones. The main objective of the course is to develop basic economic analysis skills in finance for making reasonable investment decisions and conduct basic research in finance.\n\nSHOW ALL ABOUT THEORY OF FINANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/econometrics?specialization=value-based-business-analytics",
       "name":"Econometrics",
       "Rating":"Econometrics\n\nThis course is part of HSE University Master of Business Analytics and Master of Finance degree programs. Learn more about the admission into the program and how your Coursera work can be leveraged if accepted into the program <a href=\"https://inlnk.ru/WRM4O\">here</a> (Master of Business Analytics) and here https://inlnk.ru/WRM4O (Quantitative Finance)\n\nThe course builds essential skills necessary for economic, business or financial analysis. The purpose of the course is to give students solid and extended skills in both econometric tools and their application to contemporary economic problems. We will learn both theoretical foundations and practical aspects of the main econometric topics: ordinary least squares as a core approach of linear regression analysis, the choice of the model specification, dealing with main problems of econometric analysis such as multicollinearity, heteroscedasticity, autocorrelation and endogeneity. \n\nAfter the course, you will be able to perform your own economic data analysis based on the understanding of described econometrics tools. You will learn how to apply the indicated tools and methods to various topics of your research and how to prevent and overcome problems, which can arise in real data analysis.\n\nSHOW ALL ABOUT ECONOMETRICS\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-finance-hse?specialization=value-based-business-analytics",
       "name":"Corporate Finance",
       "Rating":"Corporate Finance\n\nCorporate Finance course develops conceptual framework to analyze the broad area of corporate financial decisions (investing, financing, payout, strategic deals). It provides the prevailing empirical evidence for the motives and impact of corporate performance in developed and emerging capital markets. The course covers topics in corporate financial architecture (e.g. governance issues, board’s role), ownership structure, and corporate performance of a firm. \n\nDuring the Corporate Finance course, you will gain insight into both theoretical and  practical aspects of Corporate Finance, including financing and capital structure of organization, its life-cycle stage and payout policy decisions. You will learn about the dilemmas of executives and shareholders and such recent trends as knowledge firms and zero debt capital structure. \nSimultaneously you will solve tasks designed specifically so you could perform step by step analysis of a company's perfomance. \nThis course is a part of a Degree.\n\nThis Course is part of HSE University Master of Business Analytics degree program. Learn more about the admission into the program and how your Coursera work can be leveraged if accepted into the program here  https://inlnk.ru/bvD1E.\n\nSHOW ALL ABOUT CORPORATE FINANCE\nSHOW ALL"
    },
    "/specializations/cloud",
    {
       "Url":"/learn/sdnetworking?specialization=cloud",
       "name":"Software Defined Networking",
       "Rating":"Software Defined Networking\n4.7\nstars\n18 ratings\n•\n1 reviews\n\nThis course provides an introduction to data center networking technologies, more specifically software-defined networking. It covers the history behind SDN, description of networks in data-centers, a concrete data-center network architecture (Microsoft VL2), and traffic engineering."
    },
    {
       "Url":"/learn/cloud-sys-software?specialization=cloud",
       "name":"Cloud Systems Software",
       "Rating":"Cloud Systems Software\n\nThis course provides an introduction to programming frameworks and their implementation issues in the Cloud. It explains multiple topics, including: scalable distributed data stores, resource management (for supporting multi-tenancy and elasticity) and virtualization techniques. Optionally, the student will also be guided in the implementation of a basic version of the distributed runtime system for the Map-Reduce programming framework\n\nSHOW ALL ABOUT CLOUD SYSTEMS SOFTWARE\nSHOW ALL"
    },
    {
       "Url":"/learn/cloud-app?specialization=cloud",
       "name":"Cloud Applications",
       "Rating":"Cloud Applications\n4.2\nstars\n10 ratings\n•\n1 reviews\n\nThis course provides an introduction to the development and support for Cloud-native applications, more specifically it delves into best practices of developing applications; migrating on premise applications to the cloud; the basic building blocks and properties expected from Cloud applications. The course also provide highlights of some novel cloud applications, including geo-distributed computations.\n\nSHOW ALL ABOUT CLOUD APPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/network-virtual?specialization=cloud",
       "name":"Network Function Virtualization",
       "Rating":"Network Function Virtualization\n4.8\nstars\n18 ratings\n•\n4 reviews\n\nThis course covers Network Function Virtualization from the perspective of a systems engineer.\n\nIt first discusses the proliferation of middleboxes in enterprise networks and the necessity of\nvirtualizing these components just like software applications. It then details several\noptimizations in operating systems to facilitate efficient networking on virtualized hardware\nfollowed by design decisions in user-plane libraries for bypassing the kernel for efficient packet\nprocessing. It then covers the challenges and solutions for building scalable systems for\nproviding networking services in datacenters, specifically the synergy between SDN and NFV to\nachieve this. The course concludes with a discussion of real-world applications of NFV\ntechnology in the cloud computing ecosystem.\n\nSHOW ALL ABOUT NETWORK FUNCTION VIRTUALIZATION\nSHOW ALL"
    },
    "/specializations/hr-management-leadership",
    {
       "Url":"/learn/organisational-design-know-your-organisation?specialization=hr-management-leadership",
       "name":"Organisational design: Know your organisation",
       "Rating":"Organisational design: Know your organisation\n4.9\nstars\n799 ratings\n•\n213 reviews\n\nHow do you lead your organisation when today’s work environment is so competitive and complex? When you become responsible for leading an organisation, your most important leadership challenge will be enabling your organisation to deliver on its strategy while ensuring it remains sufficiently agile. This course will prepare you to tackle this challenge. You will examine what organisational culture is, the primary organisational structures, and what we mean by ‘systems’, before building on your foundational knowledge and taking a more strategic perspective. The structured learning activities that complement this course (video lectures, quizzes, discussion prompts and written assessments) will not only prepare you to take your organisation forward in a more strategic direction, but to make better decisions along the way.\n\nSHOW ALL ABOUT ORGANISATIONAL DESIGN: KNOW YOUR ORGANISATION\nSHOW ALL"
    },
    {
       "Url":"/learn/organisational-behaviour-know-your-people?specialization=hr-management-leadership",
       "name":"Organisational behaviour: Know your people",
       "Rating":"Organisational behaviour: Know your people\n4.8\nstars\n629 ratings\n•\n142 reviews\n\nOrganisations have changed and now, more than ever, personnel management is crucial to organisational success. In this course you’ll explore a range of concepts, theories and methodologies that will help you navigate and optimise your work environment. Via structured learning activities (video lectures, quizzes, discussion prompts and written assessments) you will be exposed to the latest best-practice leadership strategies to enable your employees to achieve more at work. You’ll examine case studies on advanced leadership strategies and be challenged to consider how these might apply to your own workplace. And you’ll discover that your ability to manage and lead people in a flatter, more team-driven context is now the key to organisational success. As the world continues to undergo dynamic change, this course will prepare you to be the one to lead your team and your organisation into the dynamic work environments of tomorrow.\n\nSHOW ALL ABOUT ORGANISATIONAL BEHAVIOUR: KNOW YOUR PEOPLE\nSHOW ALL"
    },
    {
       "Url":"/learn/leadership-adapt-your-style?specialization=hr-management-leadership",
       "name":"Adapt your leadership style",
       "Rating":"Adapt your leadership style\n4.8\nstars\n503 ratings\n•\n136 reviews\n\nWhy are organisational misbehaviours such as cynicism, apathy, bullying and disengagement increasingly prevalent in the workplace? This course examines these tensions and how transformational, authentic and inclusive leadership styles offer an alternative to the more autocratic, job-centred and controlling leadership styles of the past. You’ll learn how the digital revolution, along with an increased focus on projects and teamwork, has dramatically altered the perception of leadership in a way that now demands all organisational members take on some form of self-leadership. And you’ll learn how this change is causing tensions between traditional leaders and the contemporary practices vital to maintain agility in today’s ultra-competitive marketplace. This learning will be complemented by structured activities such as video lectures, quizzes, discussion prompts and written assessments.\n\nSHOW ALL ABOUT ADAPT YOUR LEADERSHIP STYLE\nSHOW ALL"
    },
    {
       "Url":"/learn/visionary-leadership-meaning-maker?specialization=hr-management-leadership",
       "name":"Visionary leadership, identity & motivation: Become a meaning maker",
       "Rating":"Visionary leadership, identity & motivation: Become a meaning maker\n4.8\nstars\n396 ratings\n•\n95 reviews\n\nWhen faced with a complex and ambiguous work environment, how do you, as a potential leader, envision the future? How can you deliver on your vision in a way that conveys meaning and drives positive change within your organisation? In this course you will explore how leaders can create a compelling vision and communicate it, and how they create meaning and make work more meaningful. You will look at the role the brain and the body play in processing meaning, and how this can inspire your employees to follow you and your vision. This course will also teach you how to develop meaningful brand identity and the role it can play in clarifying and reinforcing your leadership vision within your organisation, for your partners and for your customers. You will discover that meaning crosses into almost every aspect of management. Finally, you will better understand how social and cultural factors can influence what you can achieve and your limitations when seeking to create meaning.\n\nSHOW ALL ABOUT VISIONARY LEADERSHIP, IDENTITY & MOTIVATION: BECOME A MEANING MAKER\nSHOW ALL"
    },
    "/specializations/recommender-systems",
    {
       "Url":"/learn/recommender-systems-introduction?specialization=recommender-systems",
       "name":"Introduction to Recommender Systems: Non-Personalized and Content-Based",
       "Rating":"Introduction to Recommender Systems: Non-Personalized and Content-Based\n4.5\nstars\n592 ratings\n•\n124 reviews\n\nThis course, which is designed to serve as the first course in the Recommender Systems specialization, introduces the concept of recommender systems, reviews several examples in detail, and leads you through non-personalized recommendation using summary statistics and product associations, basic stereotype-based or demographic recommendations, and content-based filtering recommendations. \n\nAfter completing this course, you will be able to compute a variety of recommendations from datasets using basic spreadsheet tools, and if you complete the honors track you will also have programmed these recommendations using the open source LensKit recommender toolkit.  \n\nIn addition to detailed lectures and interactive exercises, this course features interviews with several leaders in research and practice on advanced topics and current directions in recommender systems.\n\nSHOW ALL ABOUT INTRODUCTION TO RECOMMENDER SYSTEMS:  NON-PERSONALIZED AND CONTENT-BASED\nSHOW ALL"
    },
    {
       "Url":"/learn/collaborative-filtering?specialization=recommender-systems",
       "name":"Nearest Neighbor Collaborative Filtering",
       "Rating":"Nearest Neighbor Collaborative Filtering\n4.3\nstars\n292 ratings\n•\n66 reviews\n\nIn this course, you will learn the fundamental techniques for making personalized recommendations through nearest-neighbor techniques.  First you will learn user-user collaborative filtering, an algorithm that identifies other people with similar tastes to a target user and combines their ratings to make recommendations for that user.  You will explore and implement variations of the user-user algorithm, and will explore the benefits and drawbacks of the general approach.  Then you will learn the widely-practiced item-item collaborative filtering algorithm, which identifies global product associations from user ratings, but uses these product associations to provide personalized recommendations based on a user's own product ratings.\n\nSHOW ALL ABOUT NEAREST NEIGHBOR COLLABORATIVE FILTERING\nSHOW ALL"
    },
    {
       "Url":"/learn/recommender-metrics?specialization=recommender-systems",
       "name":"Recommender Systems: Evaluation and Metrics",
       "Rating":"Recommender Systems: Evaluation and Metrics\n4.4\nstars\n215 ratings\n•\n30 reviews\n\nIn this course you will learn how to evaluate recommender systems.  You will gain familiarity with several families of metrics, including ones to measure prediction accuracy, rank accuracy, decision-support, and other factors such as diversity, product coverage, and serendipity.  You will learn how different metrics relate to different user goals and business goals.  You will also learn how to rigorously conduct offline evaluations (i.e., how to prepare and sample data, and how to aggregate results).  And you will learn about online (experimental) evaluation.  At the completion of this course you will have the tools you need to compare different recommender system alternatives for a wide variety of uses.\n\nSHOW ALL ABOUT RECOMMENDER SYSTEMS:  EVALUATION AND METRICS\nSHOW ALL"
    },
    {
       "Url":"/learn/matrix-factorization?specialization=recommender-systems",
       "name":"Matrix Factorization and Advanced Techniques",
       "Rating":"Matrix Factorization and Advanced Techniques\n4.3\nstars\n176 ratings\n•\n26 reviews\n\nIn this course you will learn a variety of matrix factorization and hybrid machine learning techniques for recommender systems.  Starting with basic matrix factorization, you will understand both the intuition and the practical details of building recommender systems based on reducing the dimensionality of the user-product preference space.  Then you will learn about techniques that combine the strengths of different algorithms into powerful hybrid recommenders.\n\nSHOW ALL ABOUT MATRIX FACTORIZATION AND ADVANCED TECHNIQUES\nSHOW ALL"
    },
    {
       "Url":"/learn/recommeder-systems-capstone?specialization=recommender-systems",
       "name":"Recommender Systems Capstone",
       "Rating":"Recommender Systems Capstone\n4.2\nstars\n27 ratings\n•\n4 reviews\n\nThis capstone project course for the Recommender Systems Specialization brings together everything you've learned about recommender systems algorithms and evaluation into a comprehensive recommender analysis and design project.  You will be given a case study to complete where you have to select and justify the design of a recommender system through analysis of recommender goals and algorithm performance.  \n\nLearners in the honors track will focus on experimental evaluation of the algorithms against medium sized datasets.  The standard track will include a mix of provided results and spreadsheet exploration.\n\nBoth groups will produce a capstone report documenting the analysis, the selected solution, and the justification for that solution.\n\nSHOW ALL ABOUT RECOMMENDER SYSTEMS CAPSTONE\nSHOW ALL"
    },
    "/specializations/data-literacy",
    {
       "Url":"/learn/data-what-it-is-what-can-we-do-with-it?specialization=data-literacy",
       "name":"Data – What It Is, What We Can Do With It",
       "Rating":"Data – What It Is, What We Can Do With It\n4.5\nstars\n69 ratings\n•\n17 reviews\n\nThis course introduces students to data and statistics.  By the end of the course, students should be able to interpret descriptive statistics, causal analyses and visualizations to draw meaningful insights.  \n\nThe course first introduces a framework for thinking about the various purposes of statistical analysis.  We’ll talk about how analysts use data for descriptive, causal and predictive inference.  We’ll then cover how to develop a research study for causal analysis, compute and interpret descriptive statistics and design effective visualizations.  The course will help you to become a thoughtful and critical consumer of analytics. \n\nIf you are in a field that increasingly relies on data-driven decision making, but you feel unequipped to interpret and evaluate data, this course will help you develop these fundamental tools of data literacy.\n\nSHOW ALL ABOUT DATA – WHAT IT IS, WHAT WE CAN DO WITH IT\nSHOW ALL"
    },
    {
       "Url":"/learn/measurement-turning-concepts-data?specialization=data-literacy",
       "name":"Measurement – Turning Concepts into Data",
       "Rating":"Measurement – Turning Concepts into Data\n4.8\nstars\n45 ratings\n•\n15 reviews\n\nThis course provides a framework for how analysts can create and evaluate quantitative measures.  Consider the many tricky concepts that are often of interest to analysts, such as health, educational attainment and trust in government.  This course will explore various approaches for quantifying these concepts.  The course begins with an overview of the different levels of measurement and ways to transform variables.  We’ll then discuss how to construct and build a measurement model.  We’ll next examine surveys, as they are one of the most frequently used measurement tools.  As part of this discussion, we’ll cover survey sampling, design and evaluation.  Lastly, we’ll consider different ways to judge the quality of a measure, such as by its level of reliability or validity.  By the end of this course, you should be able to develop and critically assess measures for concepts worth study.  After all, a good analysis is built on good measures.\n\nSHOW ALL ABOUT MEASUREMENT – TURNING CONCEPTS INTO DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/quantifying-relationships-regression-models?specialization=data-literacy",
       "name":"Quantifying Relationships with Regression Models",
       "Rating":"Quantifying Relationships with Regression Models\n\nThis course will introduce you to the linear regression model, which is a powerful tool that researchers can use to measure the relationship between multiple variables.  We’ll begin by exploring the components of a bivariate regression model, which estimates the relationship between an independent and dependent variable.  Building on this foundation, we’ll then discuss how to create and interpret a multivariate model, binary dependent variable model and interactive model.  We’ll also consider how different types of variables, such as categorical and dummy variables, can be appropriately incorporated into a model.  Overall, we’ll discuss some of the many different ways a regression model can be used for both descriptive and causal inference, as well as the limitations of this analytical tool.  By the end of the course, you should be able to interpret and critically evaluate a multivariate regression analysis.\n\nSHOW ALL ABOUT QUANTIFYING RELATIONSHIPS WITH REGRESSION MODELS\nSHOW ALL"
    },
    {
       "Url":"/learn/chances-probability-uncertainty-statistics?specialization=data-literacy",
       "name":"What are the Chances? Probability and Uncertainty in Statistics",
       "Rating":"What are the Chances? Probability and Uncertainty in Statistics\n\nThis course focuses on how analysts can measure and describe the confidence they have in their findings.  The course begins with an overview of the key probability rules and concepts that govern the calculation of uncertainty measures.  We’ll then apply these ideas to variables (which are the building blocks of statistics) and their associated probability distributions.  The second half of the course will delve into the computation and interpretation of uncertainty.  We’ll discuss how to conduct a hypothesis test using both test statistics and confidence intervals.  Finally, we’ll consider the role of hypothesis testing in a regression context, including what we can and cannot learn from the statistical significance of a coefficient.  By the end of the course, you should be able to discuss statistical findings in probabilistic terms and interpret the uncertainty of a particular estimate.\n\nSHOW ALL ABOUT WHAT ARE THE CHANCES? PROBABILITY AND UNCERTAINTY IN STATISTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/data-literacy-capstone-evaluating-research?specialization=data-literacy",
       "name":"Data Literacy Capstone – Evaluating Research",
       "Rating":"Data Literacy Capstone – Evaluating Research\n\nThis is the final course in the Data Literacy Specialization.  In this capstone course, you'll apply the skills and knowledge you have acquired in the specialization to the critical evaluation of an original quantitative analysis.  The project will first require you to identify and read a piece of high-quality, original, quantitative research on a topic of your choosing.  You’ll then interpret and evaluate the findings as well as the methodological approach.  As part of the project, you’ll also review other students’ submissions.  By the end of the project, you should be empowered to be a critical consumer and user of quantitative research.\n\nSHOW ALL ABOUT DATA LITERACY CAPSTONE – EVALUATING RESEARCH\nSHOW ALL"
    },
    "/specializations/hands-on-data-science-machine-learning",
    {
       "Url":"/learn/bigquery-basics-data-analysts?specialization=hands-on-data-science-machine-learning",
       "name":"BigQuery Basics for Data Analysts",
       "Rating":"BigQuery Basics for Data Analysts\n4.5\nstars\n26 ratings\n•\n1 reviews\n\nWant to scale your data analysis efforts without managing database hardware? Learn the best practices for querying and getting insights from your data warehouse with this interactive collection of BigQuery Google Cloud Labs Series. BigQuery is Google's fully managed, NoOps, low-cost analytics database. With BigQuery you can query terabytes and terabytes of data without having any infrastructure to manage or needing a database administrator. BigQuery uses SQL and can take advantage of the pay-as-you-go model. BigQuery allows you to focus on analyzing data to find meaningful insights.\n\nNote: you will have timed access to the online environment. You will need to complete the lab within the allotted time.\n\nSHOW ALL ABOUT BIGQUERY BASICS FOR DATA ANALYSTS\nSHOW ALL"
    },
    {
       "Url":"/learn/cloud-data-fusion-building-advanced-codeless-pipelines?specialization=hands-on-data-science-machine-learning",
       "name":"Building Advanced Codeless Pipelines on Cloud Data Fusion",
       "Rating":"Building Advanced Codeless Pipelines on Cloud Data Fusion\n\nIn this Google Cloud Labs Series, learners get hands-on practice on the more advanced data integration features available in Cloud Data Fusion, while sharing best practices to build more robust, reusable, dynamic pipelines. Learners get to try out the data lineage feature as well to derive interesting insights into their data’s history.\n\nNote: you will have timed access to the online environment. You will need to complete the lab within the allotted time.\n\nSHOW ALL ABOUT BUILDING ADVANCED CODELESS PIPELINES ON CLOUD DATA FUSION\nSHOW ALL"
    },
    {
       "Url":"/learn/data-science-google-cloud?specialization=hands-on-data-science-machine-learning",
       "name":"Data Science on Google Cloud",
       "Rating":"Data Science on Google Cloud\n\nActivities in these self-paced labs are derived from the exercises from the book Data Science on Google Cloud Platform by Valliappa Lakshmanan, published by O'Reilly Media, Inc. In this first Google Cloud Labs Series, covering up through chapter 8, you are given the opportunity to practice all aspects of ingestion, preparation, processing, querying, exploring, and visualizing data sets using Google Cloud tools and services.\n\nNote: you will have timed access to the online environment. You will need to complete each lab within the allotted time.\n\nSHOW ALL ABOUT DATA SCIENCE ON GOOGLE CLOUD\nSHOW ALL"
    },
    {
       "Url":"/learn/data-science-machine-learning-google-cloud?specialization=hands-on-data-science-machine-learning",
       "name":"Data Science on Google Cloud: Machine Learning",
       "Rating":"Data Science on Google Cloud: Machine Learning\n\nActivities in these self-paced labs are derived from the exercises from the book Data Science on Google Cloud Platform by Valliappa Lakshmanan, published by O'Reilly Media, Inc. In this Google Cloud Labs Series, covering chapter 9 through the end of the book, you run full-fledged machine learning jobs with state-of-the-art tools and real-world data sets, all using Google Cloud tools and services.\n\nNote: you will have timed access to the online environment. You will need to complete the lab within the allotted time.\n\nSHOW ALL ABOUT DATA SCIENCE ON GOOGLE CLOUD: MACHINE LEARNING\nSHOW ALL"
    },
    "/specializations/learn-mandarin",
    {
       "Url":"/learn/mandarin-chinese-1?specialization=learn-mandarin",
       "name":"Mandarin Chinese 1: Chinese for Beginners",
       "Rating":"Mandarin Chinese 1: Chinese for Beginners\n4.8\nstars\n1,237 ratings\n•\n297 reviews\n\nMandarin Chinese 1: Chinese for beginners is a beginner's course of Mandarin Chinese. It uses lectures, short plays, interactive exercises and cultural tips to help learners build a fundamental capability of oral Chinese in real-life situations. At the end of the 5-week course, the learners will reach the following proficiency: \n\n♦ 150 words\n♦ 20 language points\n♦ handling 5 real-life situations\nThis is a beginners' course, therefore no prerequisite is required.\n\nSHOW ALL ABOUT MANDARIN CHINESE 1: CHINESE FOR BEGINNERS\nSHOW ALL"
    },
    {
       "Url":"/learn/mandarin-chinese-2?specialization=learn-mandarin",
       "name":"Mandarin Chinese 2: Chinese for Beginners",
       "Rating":"Mandarin Chinese 2: Chinese for Beginners\n4.8\nstars\n391 ratings\n•\n58 reviews\n\nMandarin Chinese 2: Chinese for beginners is a beginner's course of Mandarin Chinese in continuation of Mandarin Chinese 1: Chinese for beginners. It uses lectures, short plays, interactive exercises and cultural tips to help learners build a fundamental capability of oral Chinese in real-life situations. At the end of the 5-lesson course, the learners will reach the following proficiency: \n\n♦ 300 words\n♦ 40 language points\n♦ handling 10 real-life situations\nCompleting \"Mandarin Chinese 1: Chinese for beginners\" or having attended  Chinese courses of any types for at least 15 hours is the prerequisite.\n\nSHOW ALL ABOUT MANDARIN CHINESE 2: CHINESE FOR BEGINNERS\nSHOW ALL"
    },
    {
       "Url":"/learn/mandarin-chinese-3?specialization=learn-mandarin",
       "name":"Mandarin Chinese 3: Chinese for Beginners",
       "Rating":"Mandarin Chinese 3: Chinese for Beginners\n4.9\nstars\n300 ratings\n•\n31 reviews\n\nMandarin Chinese 3: Chinese for beginners is a beginner's course of Mandarin Chinese in continuation of Mandarin Chinese 2: Chinese for beginners. It uses lectures, short plays, interactive exercises and cultural tips to help learners build a fundamental capability of oral Chinese in real-life situations. At the end of the 5-lesson course, the learners will reach the following proficiency: \n\n♦ 500 words\n♦ 60 language points\n♦ handling 15 real-life situations.\nCompleting \"Learn Mandarin Chinese 2: Chinese for beginners\" or having attended  Chinese courses of any types for at least 30 hours is the prerequisite.\n\nSHOW ALL ABOUT MANDARIN CHINESE 3: CHINESE FOR BEGINNERS\nSHOW ALL"
    },
    {
       "Url":"/learn/learn-mandarin-project?specialization=learn-mandarin",
       "name":"Learn Mandarin Chinese: Capstone Project",
       "Rating":"Learn Mandarin Chinese: Capstone Project\n4.8\nstars\n262 ratings\n•\n25 reviews\n\nLearn Mandarin Chinese: Capstone Project is a beginner's course of Mandarin Chinese in continuation of Mandarin Chinese 3:\n\nChinese for Beginners. In this course, learners are required to complete a few tasks of using Chinese languages in simulated real life situations. Some guidance on taking and passing HSK (Chinese proficiency test) will also be provided. By completing this course, the learners will finish the learning of the whole series and be standing at the threshold of intermediate Chinese proficiency.\n\nSHOW ALL ABOUT LEARN MANDARIN CHINESE: CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/business-english-speakers",
    {
       "Url":"/learn/business-english?specialization=business-english-speakers",
       "name":"Business English: Basics",
       "Rating":"Business English: Basics\n4.5\nstars\n858 ratings\n•\n215 reviews\n\nThis course aims to improve your Business English language skills by developing your vocabulary and reading skills and your understanding of tone, style and knowledge of communication methods. We'll also cover how these language skills can enhance audience analysis, business case analysis and basic business communication strategies. Skills learned in this course will often be referred to and needed to complete the speaking, writing and cross-cultural communications courses of this Specialization.\n\nAfter completing this course, you will be able to:\n\n- describe things and events in the context of Business English\n- make requests in the context of Business English\n- support arguments in the context of Business English\n- use appropriate tone and style according to the context of Business English\n- conduct an audience analysis\n- match audience with the purpose and medium of communication\n- analyse and summarise business data\n\nSHOW ALL ABOUT BUSINESS ENGLISH: BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/english-for-business-writing?specialization=business-english-speakers",
       "name":"English for Effective Business Writing",
       "Rating":"English for Effective Business Writing\n4.4\nstars\n244 ratings\n•\n56 reviews\n\nThis course aims to improve your Business English writing skills by developing your use of vocabulary, grammar, understanding of different business writing genres, and your ability to write professional business documents. Skills learned in this course will be used in the cross-cultural communications course and help prepare you to produce the professional business documents in the Capstone project.\n\nAfter completing this course, you will be able to:\n\n- write business emails\n- write an executive summary\n- write persuasively in English\n- adapt content to purpose, context and audience\n- use appropriate style and tone of writing for business purposes\n\nSHOW ALL ABOUT ENGLISH FOR EFFECTIVE  BUSINESS WRITING\nSHOW ALL"
    },
    {
       "Url":"/learn/business-english-vocabulary?specialization=business-english-speakers",
       "name":"English for Effective Business Speaking",
       "Rating":"English for Effective Business Speaking\n4.6\nstars\n586 ratings\n•\n151 reviews\n\nThis course aims to improve your Business English speaking skills by developing your use of vocabulary, grammar, pronunciation, spoken communication skills within a Business context, and your ability to deliver professional business speeches for specific purposes. Skills learned in this course will be used in the cross-cultural communications course and help prepare you to deliver the professional business presentation in the Capstone project.\n\nAfter completing this course, you will be able to:\n\n- delivery effective job interviews\n- give persuasive business pitches\n- delivery informative business presentations\n- speak persuasively in English\n- adapt content to purpose, context and audience\n- use appropriate style and tone of writing for business purposes\n\nSHOW ALL ABOUT ENGLISH FOR EFFECTIVE BUSINESS SPEAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/cross-cultural-communication-business?specialization=business-english-speakers",
       "name":"Business English for Cross-cultural Communication",
       "Rating":"Business English for Cross-cultural Communication\n4.7\nstars\n309 ratings\n•\n88 reviews\n\nThis course aims to prepare you for working in an cross-cultural Business setting. We'll learn about common cross-cultural theories and how they are relevant to everyday business practices in a globalised world. By combining all of your vocabulary, reading, speaking, and writing skills that you acquired in the previous three courses, you will learn how language plays an important role in cross-cultural communication. You will also enhance your cross-cultural understanding and will be able to use vocabulary, tone and style, and spoken and written communication skills within a cross-cultural Business context. Skills learned in this course help prepare you to deliver the professional business presentation in the Capstone project.\n\nAfter completing this course, you will be able to:\n\n- identify possible cross-cultural issues and misunderstandings in communication\n- apply strategies to overcome possible cross-cultural issues and misunderstandings in communication\n- produce documents with an appropriate style for business communication purposes within a cross-cultural situation\n- deliver a speech with an appropriate style for business communication purposes within a cross-cultural situation\n\nSHOW ALL ABOUT BUSINESS ENGLISH FOR CROSS-CULTURAL COMMUNICATION\nSHOW ALL"
    },
    {
       "Url":"/learn/business-case-analysis?specialization=business-english-speakers",
       "name":"Business Case Analysis",
       "Rating":"Business Case Analysis\n4.4\nstars\n10 ratings\n•\n3 reviews\n\nThe Capstone project is the culmination of your journey through the Business English for Non-Native Speakers specialization. It is aimed at applying the written and spoken skills that you have gained to an authentic business situation. You will be able to choose a business case provided by HKUST, or use an example from your own work experience and: \n\n(1) prepare an online video presentation (approx. ½ hour) that analyses the case and provides recommendations, and\n\n(2) prepare a business recommendation report to coincide with the presentation (approx. 2,000 words). The report should include an executive summary, analyses of the case and recommendations.\n\nSHOW ALL ABOUT BUSINESS CASE ANALYSIS\nSHOW ALL"
    },
    "/specializations/design-experiments",
    {
       "Url":"/learn/introduction-experimental-design-basics?specialization=design-experiments",
       "name":"Experimental Design Basics",
       "Rating":"Experimental Design Basics\n4.7\nstars\n141 ratings\n•\n35 reviews\n\nThis is a basic course in designing experiments and analyzing the resulting data. The course objective is to learn how to plan, design and conduct experiments efficiently and effectively, and analyze the resulting data to obtain objective conclusions. Both design and statistical analysis issues are discussed. Opportunities to use the principles taught in the course arise in all aspects of today’s industrial and business environment. Applications from various fields will be illustrated throughout the course.  Computer software packages (JMP, Design-Expert, Minitab) will be used to implement the methods presented and will be illustrated extensively. \n\nAll experiments are designed experiments; some of them are poorly designed, and others are well-designed. Well-designed experiments allow you to obtain reliable, valid results faster, easier, and with fewer resources than with poorly-designed experiments. You will learn how to plan, conduct and analyze experiments efficiently in this course.\n\nSHOW ALL ABOUT EXPERIMENTAL DESIGN BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/factorial-fractional-factorial-designs?specialization=design-experiments",
       "name":"Factorial and Fractional Factorial Designs",
       "Rating":"Factorial and Fractional Factorial Designs\n4.7\nstars\n40 ratings\n•\n9 reviews\n\nMany experiments in engineering, science and business involve several factors.  This course is an introduction to these types of multifactor experiments.  The appropriate experimental strategy for these situations is based on the factorial design, a type of experiment where factors are varied together.  This course focuses on designing these types of experiments and on using the ANOVA for analyzing the resulting data.  These types of experiments often include nuisance factors, and  the blocking principle can be used in factorial designs to handle these situations.  As the number of factors of interest grows full factorials become too expensive and fractional versions of the factorial design are useful.  This course will  cover the benefits of fractional factorials, along with methods for constructing and analyzing the data from these experiments.\n\nSHOW ALL ABOUT FACTORIAL AND FRACTIONAL FACTORIAL DESIGNS\nSHOW ALL"
    },
    {
       "Url":"/learn/response-surfaces-mixtures-model-building?specialization=design-experiments",
       "name":"Response Surfaces, Mixtures, and Model Building",
       "Rating":"Response Surfaces, Mixtures, and Model Building\n4.7\nstars\n45 ratings\n•\n12 reviews\n\nFactorial experiments are often used in factor screening.; that is, identify the subset of factors in a process or system that are of primary important to the response. Once the set of important factors are identified interest then usually turns to optimization; that is, what levels of the important factors produce the best values of the response.  This course provides design and optimization tools to answer that questions using the response surface framework.  Other related topics include design and analysis of computer experiments, experiments with mixtures, and experimental strategies to reduce the effect of uncontrollable factors on unwanted variability in the response.\n\nSHOW ALL ABOUT RESPONSE SURFACES, MIXTURES, AND MODEL BUILDING\nSHOW ALL"
    },
    {
       "Url":"/learn/random-models-nested-split-plot-designs?specialization=design-experiments",
       "name":"Random Models, Nested and Split-plot Designs",
       "Rating":"Random Models, Nested and Split-plot Designs\n4.6\nstars\n27 ratings\n•\n5 reviews\n\nMany experiments involve factors whose levels are chosen at random. A well-know situation is the study of measurement systems to determine their capability.  This course presents the design and analysis of these types of experiments, including modern methods for estimating the components of variability in these systems. The course also covers experiments with nested factors, and experiments with hard-to-change factors that require split-plot designs. We also provide an overview of designs for experiments with response distributions from nonnormal response distributions and experiments with covariates.\n\nSHOW ALL ABOUT RANDOM MODELS, NESTED AND SPLIT-PLOT DESIGNS\nSHOW ALL"
    },
    "/specializations/serverless-data-processing-with-dataflow",
    {
       "Url":"/learn/serverless-data-processing-with-dataflow-foundations?specialization=serverless-data-processing-with-dataflow",
       "name":"Serverless Data Processing with Dataflow: Foundations",
       "Rating":"Serverless Data Processing with Dataflow: Foundations\n4.4\nstars\n14 ratings\n•\n2 reviews\n\nThis course is part 1 of a 3-course series on Serverless Data Processing with Dataflow. In this first course, we start with a refresher of what Apache Beam is and its relationship with Dataflow. Next, we talk about the Apache Beam vision and the benefits of the Beam Portability framework. The Beam Portability framework achieves the vision that a developer can use their favorite programming language with their preferred execution backend. We then show you how Dataflow allows you to separate compute and storage while saving money, and how identity, access, and management tools interact with your Dataflow pipelines. Lastly, we look at how to implement the right security model for your use case on Dataflow. \n\nPrerequisites:\nThe Serverless Data Processing with Dataflow course series builds on the concepts covered in the Data Engineering specialization. We recommend the following prerequisite courses:\n(i)Building batch data pipelines on Google Cloud : covers core Dataflow principles\n(ii)Building Resilient Streaming Analytics Systems on Google Cloud : covers streaming basics concepts like windowing, triggers, and watermarks \n\n>>> By enrolling in this course you agree to the Qwiklabs Terms of Service as set out in the FAQ and located at: https://qwiklabs.com/terms_of_service <<<\n\nSHOW ALL ABOUT SERVERLESS DATA PROCESSING WITH DATAFLOW: FOUNDATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/developing-pipelines-on-dataflow?specialization=serverless-data-processing-with-dataflow",
       "name":"Serverless Data Processing with Dataflow: Develop Pipelines",
       "Rating":"Serverless Data Processing with Dataflow: Develop Pipelines\n\nIn this second installment of the Dataflow course series, we are going to be diving deeper on developing pipelines using the Beam SDK. We start with a review of Apache Beam concepts. Next, we discuss processing streaming data using windows, watermarks and triggers. We then cover options for sources and sinks in your pipelines, schemas to express your structured data, and how to do stateful transformations using State and Timer APIs. We move onto reviewing best practices that help maximize your pipeline performance. Towards the end of the course, we introduce SQL and Dataframes to represent your business logic in Beam and how to iteratively develop pipelines using Beam notebooks.\n\nSHOW ALL ABOUT SERVERLESS DATA PROCESSING WITH DATAFLOW: DEVELOP PIPELINES\nSHOW ALL"
    },
    {
       "Url":"/learn/serverless-data-processing-with-dataflow-operations?specialization=serverless-data-processing-with-dataflow",
       "name":"Serverless Data Processing with Dataflow: Operations",
       "Rating":"Serverless Data Processing with Dataflow: Operations\n\nIn the last installment of the Dataflow course series, we will introduce the components of the Dataflow operational model. We will examine tools and techniques for troubleshooting and optimizing pipeline performance. We will then review testing, deployment, and reliability best practices for Dataflow pipelines. We will conclude with a review of Templates, which makes it easy to scale Dataflow pipelines to organizations with hundreds of users. These lessons will help ensure that your data platform is stable and resilient to unanticipated circumstances.\n\nSHOW ALL ABOUT SERVERLESS DATA PROCESSING WITH DATAFLOW: OPERATIONS\nSHOW ALL"
    },
    "/specializations/international-business",
    {
       "Url":"/learn/international-business-context?specialization=international-business",
       "name":"International Business Context",
       "Rating":"International Business Context\n4.7\nstars\n50 ratings\n•\n12 reviews\n\nThis course on the context of international business provides an overview of the environments in which international business has existed in the past and how it operates in the present. First, the theory and history of international trade and the place of business in global trade are summarized. Next, the parallel topic of globalization and its impact on international business is reviewed. Then, the varied political, economic, and ethical environments in which international business must operate are discussed. Finally, current international trade agreements and national trade laws and regulations are presented. Without understanding the context of international business, international managers and leaders will indeed find success difficult.\n\nSHOW ALL ABOUT INTERNATIONAL BUSINESS CONTEXT\nSHOW ALL"
    },
    {
       "Url":"/learn/international-business-culture?specialization=international-business",
       "name":"International Business and Culture",
       "Rating":"International Business and Culture\n4.8\nstars\n20 ratings\n•\n6 reviews\n\nIn this course, learners develop a solid understanding of how national cultures shape international human resource management, international marketing, and international business generally. The course provides an overview of international culture, human resource management (HRM), and marketing. This may seem like a peculiar grouping of topics, but successful international HR management and marketing are highly dependent on national culture. Without understanding a people’s culture, managing and selling to those people is fraught. In the first module, the many determinants of national culture are explored as well as the dimensions or characteristics of a nation’s culture. In the next module, we review the various organizational structures appropriate for international business before turning to the HR challenges of managing a diverse population of international employees. In the final two modules, we explore the many challenges of international marketing across nations and across cultures.\n\nSHOW ALL ABOUT INTERNATIONAL BUSINESS AND CULTURE\nSHOW ALL"
    },
    {
       "Url":"/learn/international-business-operations?specialization=international-business",
       "name":"International Business Operations",
       "Rating":"International Business Operations\n4.8\nstars\n12 ratings\n•\n3 reviews\n\nThis course provides learners with a solid foundation in international supply, logistics, and foreign currency exchange. Foreign exchange is included in this course since it plays such an important role in planning and executing international operations. The first half of the course reviews critical roles that supply chain management, sourcing, logistics, and transportation play in contemporary global business. In the second half, the focus shifts to foreign currency exchange risks and methods for mitigating those risks, both financial and non-financial.\n\nSHOW ALL ABOUT INTERNATIONAL BUSINESS OPERATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/international-business-venturing-abroad?specialization=international-business",
       "name":"International Business Venturing Abroad",
       "Rating":"International Business Venturing Abroad\n4.5\nstars\n13 ratings\n•\n4 reviews\n\nThis course reviews and evaluates the many ways that businesses can engage in international commerce. First presented are the three decisions that any business needs to make to go global, including a model for country selection. Next, modes of exporting and importing are discussed, followed by a review of contract modes of entry such as licensing and franchising, and then foreign direct investment strategies such as joint ventures, mergers, and acquisitions. The course concludes with a personal look at going global, including deciding to go, preparing to go, working and living abroad, and the challenges of coming home.\n\nSHOW ALL ABOUT INTERNATIONAL BUSINESS VENTURING ABROAD\nSHOW ALL"
    },
    "/specializations/mind-machine",
    {
       "Url":"/learn/mind-machine-artificial-intelligence?specialization=mind-machine",
       "name":"What is “the mind” and what is artificial intelligence?",
       "Rating":"What is “the mind” and what is artificial intelligence?\n4.4\nstars\n121 ratings\n•\n36 reviews\n\nIn this course, we will explore the history of cognitive science and the way these ideas shape how we think of artificial cognition."
    },
    {
       "Url":"/learn/mind-machine-problem-solving-methods?specialization=mind-machine",
       "name":"Methods for Solving Problems",
       "Rating":"Methods for Solving Problems\n4.4\nstars\n62 ratings\n•\n14 reviews\n\nIn this course, we will explore different types of problems, the boundaries of what makes a problem solvable, and the different algorithms, rules, and heuristics we can implement to solve these problems."
    },
    {
       "Url":"/learn/mind-machine-computational-vision?specialization=mind-machine",
       "name":"Computational Vision",
       "Rating":"Computational Vision\n4.4\nstars\n50 ratings\n•\n12 reviews\n\nIn this course, we will expand on vision as a cognitive problem space and explore models that address various vision tasks. We will then explore how the boundaries of these problems lead to a more complex analysis of the mind and the brain and how these explorations lead to more complex computational models of understanding.\n\nSHOW ALL ABOUT COMPUTATIONAL VISION\nSHOW ALL"
    },
    {
       "Url":"/learn/mind-machine-perspectives?specialization=mind-machine",
       "name":"Interpersonal, Developmental, and Evolutionary Perspectives of the Mind",
       "Rating":"Interpersonal, Developmental, and Evolutionary Perspectives of the Mind\n4.3\nstars\n23 ratings\n•\n6 reviews\n\nIn this course, we will explore how individual problem solving, judgment, and decision making can be influenced by interpersonal and developmental factors."
    },
    "/specializations/solar-energy",
    {
       "Url":"/learn/solar-energy-systems?specialization=solar-energy",
       "name":"Solar Energy Systems Overview",
       "Rating":"Solar Energy Systems Overview\n4.7\nstars\n558 ratings\n•\n148 reviews\n\nBy the end of this course, learners will have acquired a broad understanding of the history and mechanics behind converting light into electricity, commonly known as photovoltaics (PV). They are empowered to recognize and describe elements of a PV system, enabling them to: compare the most common types of solar cells, sketch a solar PV system, and analyze differences between rooftop and ground mounting configurations. The course explores economic considerations, touching on solar PV costs for residential and commercial use, incentives, and contrasts solar power with fossil fuel and nuclear plants.        \n\nThis course is ideal for anyone interested in entering the solar power sector, whether fresh to the workforce or switching industries. The curriculum is especially useful for engineers, HVAC installers, architects, and building code inspectors. \n\nMaterial includes online lectures, videos, demos, project work, readings and discussions. This is the first course in the Solar PV for Engineers, Architects and Code Inspectors specialization. To learn more about the specialization, check out a video overview at https://youtu.be/XjkKzbXqA6s.\n\nSHOW ALL ABOUT SOLAR ENERGY SYSTEMS OVERVIEW\nSHOW ALL"
    },
    {
       "Url":"/learn/solar-energy-and-electrical-system-design?specialization=solar-energy",
       "name":"Solar Energy and Electrical System Design",
       "Rating":"Solar Energy and Electrical System Design\n4.7\nstars\n426 ratings\n•\n123 reviews\n\nThis course supplies learners with the insights necessary for properly planning, and therefore successfully installing, a photovoltaic (PV) system per design specifications. It directs learners through the important steps of initial site inspection and evaluating appropriate locations for PV systems, and features unique elements of residential, small, industrial and utility-scale solar applications. The course probes key design concerns – including load, efficiency, and mechanical and electrical design – as well as aesthetics and tools for planning. Learners experiment with calculations needed to design a PV system, exercising newly gained knowledge about site selection, layout, code compliance, system components, and wire sizing.                \n\nThis course is targeted for engineers who have interest in entering the solar power sectors. It is also appropriate for HVAC installers, architects and building code inspectors. Learners should have a basic grasp of electrical engineering, physics and mathematical concepts. Those who are unfamiliar with how PV works, the elements of a PV system, and/or solar power ROI should take the first course of the specialization, Solar Energy Systems Overview.\n\nMaterial includes online lectures, videos, demos, hands-on exercises, project work, readings and discussions. This is the second course in the Solar PV for Engineers, Architects and Code Inspectors specialization. To learn more about the specialization, check out a video overview at https://youtu.be/XjkKzbXqA6s.\n\nSHOW ALL ABOUT SOLAR ENERGY AND ELECTRICAL SYSTEM DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/solar-energy-codes-permitting-zoning?specialization=solar-energy",
       "name":"Solar Energy Codes, Permitting and Zoning",
       "Rating":"Solar Energy Codes, Permitting and Zoning\n4.7\nstars\n76 ratings\n•\n14 reviews\n\nThis course equips learners to identify national code and zoning rules specific to photovoltaic (PV) systems, as well as key design elements and points for inspection. Curriculum includes zoning variances, critical elements of the permitting process, planning documents necessary for PV system installation and recommendations for permitting offices to streamline the permit process. Learners gain a code inspector’s perspective in relation to building and electrical code requirements. \n\nThis course is for anyone interested in entering the solar power sector, and is especially appropriate for building and code inspectors, engineers, HVAC installers and architects. It assumes that the learner has a basic grasp of electrical engineering and mathematical concepts. Those who are unfamiliar with how PV works, the elements of a PV system, and/or solar power ROI should take the first course of the specialization, Solar Energy Systems Overview. Learners seeking a greater understanding of the anatomy and function of PV systems should take the second course, Solar Energy and Electrical System Design.  \n\nMaterial includes online lectures, videos, demos, hands-on exercises, project work, readings and discussions. This is the third course in the Solar PV for Engineers, Architects and Code Inspectors specialization. To learn more about the specialization, check out a video overview at https://youtu.be/XjkKzbXqA6s.\n\nSHOW ALL ABOUT SOLAR ENERGY CODES, PERMITTING AND ZONING\nSHOW ALL"
    },
    "/specializations/pythonforcybersecurity",
    {
       "Url":"/learn/pythonforcybersecurity-introduction?specialization=pythonforcybersecurity",
       "name":"Introduction to Python for Cybersecurity",
       "Rating":"Introduction to Python for Cybersecurity\n4.5\nstars\n45 ratings\n•\n17 reviews\n\nThis course it the first part of the Python for Cybersecurity Specialization. Learners will get an introduction and overview of the course format and learning objectives."
    },
    {
       "Url":"/learn/execution-persistence-privilege-escalation-and-evasion?specialization=pythonforcybersecurity",
       "name":"Execution, persistence, privilege escalation and evasion",
       "Rating":"Execution, persistence, privilege escalation and evasion\n4.4\nstars\n13 ratings\n•\n6 reviews\n\nThis course is a continuation of Python for Cybersecurity. The topics covered are execution, persistence, privilege escalation and evasion."
    },
    {
       "Url":"/learn/credential-access-discovery-lateral-movement--collection?specialization=pythonforcybersecurity",
       "name":"Credential Access, discovery, lateral movement & collection",
       "Rating":"Credential Access, discovery, lateral movement & collection\n\nThis course covers credential Access, discovery, lateral movement & collection."
    },
    {
       "Url":"/learn/command-and-control-exfiltration-and-impact?specialization=pythonforcybersecurity",
       "name":"Python for Command-and-control, Exfiltration and Impact",
       "Rating":"Python for Command-and-control, Exfiltration and Impact\n\nThis course covers python for Command-and-control, Exfiltration and Impact."
    },
    {
       "Url":"/learn/python-for-active-defense?specialization=pythonforcybersecurity",
       "name":"Python for Active Defense",
       "Rating":"Python for Active Defense\n\nThis course covers Python for active defense."
    },
    "/specializations/sales-management-bridging-gap-strategy-sales",
    {
       "Url":"/learn/effective-sales-overview?specialization=sales-management-bridging-gap-strategy-sales",
       "name":"Effective Sales – An Overview",
       "Rating":"Effective Sales – An Overview\n4.5\nstars\n192 ratings\n•\n69 reviews\n\nWelcome to Strategic Sales Management specialization.\n\nThis specialization course focus on providing conceptual and practical guidance on sales planning and management.\nThe development of the specialization goes through the different phases of the sales planning process, keeping attention on the connection to the strategy of the company.\nConcepts discussed in this specialization aim to support the analyses on how to plan sales in alignment with the strategic guidelines of the company. The sales functions are discussed with models and frameworks that support the planning process, which includes assumptions regarding the strategic guidelines, such as aggregate revenue targets, company’s earnings, and expected cash flow from the company’s operations. These variables are all related to the strategy of the company.\nThe target audience of this specialization include professionals with some experience in sales, they might have been promoted to a managing position recently, or they have plans to improve their expertise in the sales area to apply to more challenging positions in the future.\nPrerequisite for this specialization is general knowledge of business concepts, models, and tools. Professionals who have concluded undergraduate courses of business administration, and also of different areas of knowledge, such as engineering, economics, accounting, and social sciences.\nIt’s also important to emphasize that sales involve a broad range of areas, there are products and services related to agriculture, petrochemical, automobile, aeronautics, chemical, pharmaceutical, medical, insurance, education, retail, and consulting industries, just to mention some examples. That means sales professionals are from all sectors.\nTherefore, learners of different academic backgrounds may benefit from doing this specialization, which is structured to support sales planning and management from a methodological standpoint. And this approach applies to a diverse range of sectors.\nThe primary learning outcome of this specialization is the improvement of the sales planning and management competencies and skills, by providing a set of concepts, models, tools, and techniques to support the development of the sales plan structure, which will support the sale plan development.\n\nSHOW ALL ABOUT EFFECTIVE SALES – AN OVERVIEW\nSHOW ALL"
    },
    {
       "Url":"/learn/sales-strategy?specialization=sales-management-bridging-gap-strategy-sales",
       "name":"Sales Strategy",
       "Rating":"Sales Strategy\n4.4\nstars\n124 ratings\n•\n30 reviews\n\nWelcome to Course 2 - Sales Strategy - This course is designed to discuss the application of intelligence analysis in the sales planning process. And this approach contributes to integrating the sales planning process into the corporate strategy of the company because, in the strategy analysis and formulation process, we apply models, frameworks, tools, and techniques that also apply to the sales planning and management process. \n\nTherefore, the expected outcomes of this course focus on the transition from traditional to strategic sales planning, by discussing and applying the concepts recommended to support the development of the strategic guidelines. \nThe concepts, models, tools, and techniques discussed and practiced during the course focus on the improvement of value creation from the sales function empowered by intelligence analysis, a process which typically applies in the strategy analysis front. \nThe discussions go through how intelligence analysis can support the sales function, by providing methods to connect strategy to marketing and sales planning processes. \nIn this course, the primary learning outcome is the ability to apply intelligence analysis to support sales planning process, and by being able to do this, you’ll improve your competencies and skills to support sales planning with a strategic approach. \nYou’ll develop a final assignment at the end of the course, and it is designed from an adapted real-life business case. The challenges of the case comprise the business context, through which you’ll apply the conceptual framework discussed during Course 2. \nThe outcomes of your analysis on the assignment case will be evaluated through a peer-review process.\n\nSHOW ALL ABOUT SALES STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/models-frameworks-support-sales-planning?specialization=sales-management-bridging-gap-strategy-sales",
       "name":"Models & Frameworks to Support Sales Planning",
       "Rating":"Models & Frameworks to Support Sales Planning\n4.4\nstars\n46 ratings\n•\n15 reviews\n\nWelcome to Course 3 - Models & Frameworks to Support Sales Planning – In this course, you’ll go through a conceptual approach to selling models and frameworks.\n\nAs a primary learning outcome of this course, we emphasize the improvement in the analytical competencies and skills to develop sales planning and management. And the learning process goes through the application of the models and frameworks that contribute to supporting these processes.\nThis course is aimed at professionals who seek improvement in conceptual support to the sales planning process, especially with an emphasis on applying selling models and frameworks methodology.\nAt this point of the Strategic Sales Management specialization, you have an excellent understanding of the integration of sales planning to the strategy of the company. You also have a vision of major prescriptions and recommendations to support this integration, and proceed to strategic sales planning by applying intelligence analysis.\nNow, in this course, selling models and frameworks will be discussed, from a conceptual standpoint to add methodological structure into the sales planning process. Therefore, throughout the modules of this course, the subjects discussed will include topics of sales management (module 1), the selling models and frameworks (module 2) that support sales planning, which relates to the hard skills that may be applied. \nIn the third module of this course, soft skills are brought to the discussion, since they comprise an essential component because sales functions include many aspects of the human interactions.\nPlease follow the steps of the course, and for academic objectives, we would recommend you to do it in the sequence of modules proposed, though you may take them in a different order.\nWe look forward to having you during the course modules and lessons.\n\nSHOW ALL ABOUT MODELS & FRAMEWORKS TO SUPPORT SALES PLANNING \nSHOW ALL"
    },
    {
       "Url":"/learn/sales-marketing-alignment?specialization=sales-management-bridging-gap-strategy-sales",
       "name":"Sales & Marketing Alignment",
       "Rating":"Sales & Marketing Alignment\n4.6\nstars\n59 ratings\n•\n18 reviews\n\nWelcome to Course 4 – Sales & Marketing Alignment.\n\nThis course focus on what is considered by most academics and practitioners as the biggest challenge that sales professionals have to face.\nAs we discussed in Course 1 – Effective Sales, strategy, and sales must be integrated to support a high potential for value creation through the sales functions. We also mentioned that strategy and sales integration can be supported by marketing functions.\nThe discussions then went through sales strategy supported by intelligence analysis (Course 2), sales models and frameworks to support sales planning (Course 3).\nBy the consequence, at this point of this specialization, you are in a good position to go further in the sales planning and management functions. And this is the moment to tackle one of the biggest challenges that most sales professionals must address with diligence – Sales & Marketing Alignment.\nThe primary learning outcome of this course is to prepare you to apply concepts to support this alignment, with prescriptions and recommendations that contribute to improving the alignment. The improvement in the knowledge, competencies, and skills regarding sales & marketing alignment will contribute to increasing the potential for value creation from a strategic sales planning approach.\n\nSHOW ALL ABOUT SALES & MARKETING ALIGNMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/ssm-final-project?specialization=sales-management-bridging-gap-strategy-sales",
       "name":"Strategic Sales Management Final Project",
       "Rating":"Strategic Sales Management Final Project\n4.5\nstars\n20 ratings\n•\n8 reviews\n\nWelcome to Course 5 – Strategic Sales Management Final Project.\n\nIn this course, you’ll develop the final project of the specialization, which is an application of the whole set of concepts, models, frameworks, tools, and techniques discussed and practiced through the four previous courses.\nA business case provides the business context to serve as the reference to support your analyses regarding strategy, marketing, and sales integration. The case is adapted from a real-life experience. Having developed these analyses, you will follow the project instructions that lead you to the application of the concepts you have learned so far, and proceed to the sales planning processes to support the development of a sales guidelines, which will support the sales planning process in a later moment.\nThe primary learning outcome of this course is to master concepts application to create sales guidelines, based on a structured analysis of a business case. The sales guidelines serve as the background of a sales plan structure, and they also connect the sales planning process to the strategy, at the same time that supports the development of a sales plan at a later moment. \nWhereas the sales plan structure may not be a detailed sales plan, it will provide all the aspects necessary to develop the sales plan later. \nThe project will be peer-reviewed, and the instructions to develop it also bring the rubrics to develop the review.\n\nSHOW ALL ABOUT STRATEGIC SALES MANAGEMENT FINAL PROJECT\nSHOW ALL"
    },
    "/specializations/creativity-ai",
    {
       "Url":"/learn/artificial-creativity?specialization=creativity-ai",
       "name":"Artificial Creativity",
       "Rating":"Artificial Creativity\n\nArtificial Creativity is about exploring the emerging field of artificial intelligence (A.I.) from a design perspective with the intent to bring those with a programming background and more “traditional” creatives together. In this course, you will look back at the history and theories behind today's A.I., analyze the unorthodox approaches that have advanced the field, utilize current A.I. tools, and practice design thinking methodologies that can be applied to everyday business decision making. You will examine the potential of creative A.I. in everyday experience. You will implement various design research methodologies through observation, reflective writing and discussion prompts. Then, you will actively engage and collaborate with others in the class while challenging your own definitions of creativity by taking a closer look at the people and projects that have changed the paradigm of what machines can do. Throughout the course, you will step away from your computer and complete a project applying the techniques and theories you’ll have just learned.\n\nSHOW ALL ABOUT ARTIFICIAL CREATIVITY\nSHOW ALL"
    },
    {
       "Url":"/learn/natural-creativity?specialization=creativity-ai",
       "name":"Natural Creativity",
       "Rating":"Natural Creativity\n\nNatural Creativity is about looking into the many theories behind creativity, examining studies, and exploring the latest machine learning techniques. You will experiment with artistic tools that are powered by the latest machine learning techniques and conduct a full iteration of design thinking research that can be applied in several different business scenarios. You’ll focus on how the concept of creativity has evolved over time and how it has been investigated. Then, you will actively engage and collaborate with others in the class through discussion prompts and have an opportunity to reflectively write about a project that inspires your creativity. Throughout the course, you will step away from your computer, plan, and conduct one iteration of a design project applying the techniques and theories you just learned, enabling you to gain deep insights on how people are creative in your own local environment.\n\nSHOW ALL ABOUT NATURAL CREATIVITY\nSHOW ALL"
    },
    {
       "Url":"/learn/creative-artifacts?specialization=creativity-ai",
       "name":"Creative Artifacts",
       "Rating":"Creative Artifacts\n\nCreative Artifacts is about expanding the definition of creativity, from multidisciplinary perspectives such as computer science, psychology and artistic practices, into domains like personal artistic practices, corporate innovations, and urban policies. You will look at renowned artists who use the latest machine learning techniques in a compelling way to expand their creative capacities. You’ll also examine different business strategies and economic policies that aim to make organizations and cities more creative. Then, you will actively engage and collaborate with others in the class through discussion prompts and have an opportunity to reflectively write about a creative project that inspires you. Throughout this course, you will manage your own design research project on the topic of your choice, through multiple iterations that can translate to actionable insights and business strategies.\n\nSHOW ALL ABOUT CREATIVE ARTIFACTS\nSHOW ALL"
    },
    "/specializations/speaklistenenglish",
    {
       "Url":"/learn/note-taking?specialization=speaklistenenglish",
       "name":"Academic Listening and Note-Taking",
       "Rating":"Academic Listening and Note-Taking\n4.5\nstars\n746 ratings\n•\n205 reviews\n\nThis course will help non-native English speakers improve their listening and note-taking skills for the purpose of listening to academic lectures. You will learn techniques for improving your understanding and skills for taking more effective notes, and you will get lots of practice in using these. If you're planning to attend college classes in English, then this class is for you.\n\nUpon completing this course, you will be able to:\n1.       Understand and follow a lecture\n2.       Take better lecture notes\n3.       Discuss courses with classmates and professors\n4.       Give an effective academic presentation\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.\n\nSHOW ALL ABOUT ACADEMIC LISTENING AND NOTE-TAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/presentations-speaking-so-that-people-listen?specialization=speaklistenenglish",
       "name":"Presentations: Speaking so that People Listen",
       "Rating":"Presentations: Speaking so that People Listen\n4.5\nstars\n266 ratings\n•\n77 reviews\n\nDo you have to give presentations in school or at your work? Is it nerve-racking? Then you've come to the right place. Everyone gets a little nervous when they think about having to stand in front of other people and speak intelligently. This course will give you helpful tips for making effective speeches and delivering them well in typical American settings. You'll learn how to organize a presentation, how to make it memorable, and how to communicate clearly. In the course, you'll have several opportunities to demonstrate the presentation skills that you learn. This will help you gain the experience you need to be more confident when you give a speech in an American classroom or on the job.  Learners will record several videos of themselves giving assigned presentations and upload the videos for peer feedback.\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.\n\nSHOW ALL ABOUT PRESENTATIONS: SPEAKING SO THAT PEOPLE LISTEN\nSHOW ALL"
    },
    {
       "Url":"/learn/academic-discussion-english?specialization=speaklistenenglish",
       "name":"Academic Discussions in English",
       "Rating":"Academic Discussions in English\n4.5\nstars\n96 ratings\n•\n28 reviews\n\nThis is the third course in the Learn English: Advanced Speaking and Listening specialization. In this class you will learn about different types of conversations you will have in academic settings. You will also learn some strategies for helping you understand other people's meaning and for helping you express yourself effectively. Learners will record several videos of themselves participating in assigned group discussions with their own friends and upload the videos for peer feedback. While this might seem intimidating, it will be a great opportunity for you to practice and improve your discussion skills.\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.\n\nSHOW ALL ABOUT ACADEMIC DISCUSSIONS IN ENGLISH\nSHOW ALL"
    },
    {
       "Url":"/learn/speaking-listening-capstone?specialization=speaklistenenglish",
       "name":"Advanced Speaking and Listening Project",
       "Rating":"Advanced Speaking and Listening Project\n4.9\nstars\n26 ratings\n•\n5 reviews\n\nLearners will present a well-organized academic speech on a topic in an academic field of the learner's choice. The learner will need to recall all of the skills learned in the previous three courses and complete several steps to complete the project. The learner will choose an academic topic and will then need to do some research, interview a couple of experts in the field, create visual elements, and record a video of the presentation. The presenter will use techniques for preparing and practicing a presentation and demonstrate effective verbal and non-verbal skills. Doing this will help prepare you for presentations in school or work.\n\nSHOW ALL ABOUT ADVANCED SPEAKING AND LISTENING PROJECT\nSHOW ALL"
    },
    "/specializations/sales-training-high-performing-teams",
    {
       "Url":"/learn/build-sales-career?specialization=sales-training-high-performing-teams",
       "name":"Sales Training: Building Your Sales Career",
       "Rating":"Sales Training: Building Your Sales Career\n4.7\nstars\n426 ratings\n•\n103 reviews\n\nWhether you're thinking about a career in sales, just getting started at your new sales job, or managing entry level sales people, this course will provide you a valuable perspective on your sales career. You'll start out the course with an overview of what it takes to be successful in sales. It might surprise you. You'll learn why most people have it all wrong about sales! \n\nThe following five lessons will cover the inbound sales methodology, a framework used by thousands of sales professionals to get started in sales. You'll learn the difference between active and passive buyers, and how to build relationships and earn their attention. You'll learn why understanding the buyer's context is imperative providing them solutions. \n\nIn this course, you'll gain the fundamental knowledge required to be successful in sales. By investing your time in sales training, you're already ahead of the curve.\n\nSHOW ALL ABOUT SALES TRAINING: BUILDING YOUR SALES CAREER\nSHOW ALL"
    },
    {
       "Url":"/learn/sales-process-techniques-training?specialization=sales-training-high-performing-teams",
       "name":"Sales Training: Techniques for a Human-Centric Sales Process",
       "Rating":"Sales Training: Techniques for a Human-Centric Sales Process\n4.7\nstars\n377 ratings\n•\n103 reviews\n\nThis course will teach you an inbound approach to sales that focuses on being helpful, not salesy. By the end of this course, you'll be able to prospect for new business, qualify for high-quality prospects, book meetings with decision makers, handle buyer's objections, and negotiate and close a deal. By following this process, you'll be able to jumpstart your career in sales with tactical tips and advice to run an effective sales playbook.\n\nFree accounts you'll need to go through this course:\n- HubSpot Academy: https://hubs.ly/H0dM-NY0\n- LinkedIn: https://linkedin.com\n- Gmail: https://google.com/mail/\n- About.me: https://about.me/\n\nSHOW ALL ABOUT SALES TRAINING: TECHNIQUES FOR A HUMAN-CENTRIC SALES PROCESS\nSHOW ALL"
    },
    {
       "Url":"/learn/sales-team-management?specialization=sales-training-high-performing-teams",
       "name":"Sales Training: Sales Team Management",
       "Rating":"Sales Training: Sales Team Management\n4.7\nstars\n61 ratings\n•\n13 reviews\n\nIn this course, you will learn how to define your target market, create a scalable sales process, and build training, coaching, hiring, and onboarding programs to help your sales team grow better.\n\nWhether you're already managing a sales team, or aspire to manage one at some point in your career, this course will explain what's involved when it comes to setting up a sales process, coaching your team, hiring new team members, and getting those team members up to speed as fast as possible.\n\nSHOW ALL ABOUT SALES TRAINING: SALES TEAM MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/inbound-business-strategy?specialization=sales-training-high-performing-teams",
       "name":"Sales Training: Inbound Business Strategy",
       "Rating":"Sales Training: Inbound Business Strategy\n4.9\nstars\n76 ratings\n•\n13 reviews\n\nWelcome to the Inbound Certification course!\n\nThis course will introduce you to inbound and provide you with a big picture view of everything you need for a successful inbound strategy.\n\nSo, why inbound?\n\nInbound is a fundamental shift in the way you do business. Instead of an interruption-based message where the marketer or salesperson had all the control, inbound is about empowering potential customers. Consumer’s buying behaviors have changed and will continue to change. That's the driving force behind inbound. What your customers want today is different than what they wanted 10 years ago. That means you need to change the way you market, sell, and service to match the way people actually want to shop and buy.\n\nSo, wondering what to expect in this course?\n\nAfter an initial lesson on an introduction to the inbound fundamentals, the course consists of a set of lessons that follows the inbound methodology. The inbound methodology illustrates the four stages that make an inbound business. It reflects the entire inbound marketing, sales, services, and relationship process. The stages are Attract, Convert, Close, and Delight.\n\nEach lesson includes different tactics that you can apply to help you and your business grow better. You’ll also hear from HubSpot executives and leadership including: HubSpot’s Co-founders Brian Halligan & Dharmesh Shah. Chief People Officer, Katie Burke. VP of HubSpot Academy, Mark Kilens. VP of Marketing, Meghan Anderson. SVP of Product, Christopher O’Donnell. VP of Sales, Michelle Benfer. And VP of Customer Success, Alison Elworthy\n\nSHOW ALL ABOUT SALES TRAINING: INBOUND BUSINESS STRATEGY\nSHOW ALL"
    },
    "/specializations/career-brand-management",
    {
       "Url":"/learn/strategic-career-self-management?specialization=career-brand-management",
       "name":"Strategic Career Self-Management",
       "Rating":"Strategic Career Self-Management\n4.5\nstars\n266 ratings\n•\n61 reviews\n\nAccording to the U.S. Bureau of Labor Statistics, in the current economy, Americans shift jobs every 4-5 years, which translates into 8-10 job transitions, including several career changes, over one’s life time. With competition for jobs on the rise, a person’s continuing employability and career success are increasingly defined by his or her mastery of individual career development and the ability to effectively \"manage oneself\" (P. Drucker). \n\nIn this course, you will learn how to think strategically and professionally about your career self-management. Through this course you'll develop an objective, external view of your marketable skills as a solid foundation for building a strong career brand. In particular, you'll be able to:\n\n-  explain why developing a protean and boundaryless career perspective based on transferable (portable) skills is advantageous for continuing employability and career growth; \n-  design your portable skills portfolio, identify and examine critically important competencies underpinning your transferable skills, and analyze your career self-management competency gaps;\n- increase self-awareness, pinpoint your career goals, and envision your future work self; \n- recognize the central role of self-management for developing transferable, marketable, skills and create a customized self-management information system (Career Development Lab) for ongoing personal development and professional growth;\n- conduct a thorough, competency-based job analysis in your area of interest and examine practices of evidence-based, data-driven competitive employee selection; \n-implement your newly developed skills for crafting effective selection criteria statements and refining your job applications.\n\nSHOW ALL ABOUT STRATEGIC CAREER SELF-MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/career-brand-development-self-coaching?specialization=career-brand-management",
       "name":"Career Brand Development and Self-Coaching",
       "Rating":"Career Brand Development and Self-Coaching\n4.5\nstars\n103 ratings\n•\n23 reviews\n\nIn this course, you will engage in developing and strengthening the functional component of your career brand. Acting as “your own Chief Executive Officer” (P. Drucker), you will learn how to use strategic management models and techniques for enhancing your skills portfolio. You will learn how to increase your human capital by developing and documenting high-demand marketable skills. After completing this course, you will be able to: \n\n- Implement business strategy and models and tools, such as benchmarking and SWOT analysis, for identifying and analyzing your competitive strengths and addressing competency gaps in a skill-based, competitive job selection context; \n- Understand evidence-based, data-driven skill assessment methodologies and techniques; \n- Select appropriate assessment tools and apply them for a thorough, accurate, evidence-based and data driven self-assessment of your transferable skills; \n- Create your critical competency profile (\"The Self-Assessment Grid for Evaluation, or SAGE\") and use it as an effective instrument for an objective, 360 degree self-assessment of your competitive strengths and competency gaps; \n- Create and use an effective instrument for organizing, directing and monitoring your skill-building activities (“The Skill-Building Dashboard, or Skill-Builder”); \n- Develop an effective tool (“The T-Portfolio”) for gathering and organizing samples of standards, best practices, assessment instruments and techniques in your chosen field; \n- Effectively organize your self-management information system to systematically collect and analyze job-related data, evaluate and assess required competencies and skills, develop and implement plans for self-improvement, and monitor your progress; \n- Develop and implement a realistic performance metric for your career development activities (\"Your Present Job Market Value\"); \n- Engage in self-coaching to support active self-development.\n\nSHOW ALL ABOUT CAREER BRAND DEVELOPMENT AND SELF-COACHING\nSHOW ALL"
    },
    {
       "Url":"/learn/self-marketing?specialization=career-brand-management",
       "name":"Strategic Self-Marketing and Personal Branding",
       "Rating":"Strategic Self-Marketing and Personal Branding\n4.4\nstars\n163 ratings\n•\n30 reviews\n\nIn this course, you will learn how to use strategic marketing and personal branding techniques for designing, enhancing, and promoting your professional image. Acting as \"your own Chief Executive Officer\" (P. Drucker), you will learn how to use relationship and network marketing and impression management to showcase your skills to prospective employers, colleagues, supervisors, and other interested parties. This course will help you to:\n\n- Recognize the importance of marketing orientation and career brand building for your career development; use marketing communication strategies for your self-marketing;\n\n- Implement strategic marketing planning for your career development and engage in creating your own strategic self-marketing plan;\n\n- Devise strategies for managing your professional reputation; begin creating your personal brand, and plan steps for strategic personal branding;\n\n- Create personal branding statements, and integrate social networking into your career branding;\n\n- Refine your self-management information system to systematically collect and analyze self-marketing and personal branding related data, select appropriate tools and apply them for a thorough, accurate, evidence-based and data driven self-assessment of your self-marketing and personal branding skills;\n\n- Develop and implement an effective instrument for displaying your artifacts and monitoring your marketing communications strategies (\"The Showcaser\") and a realistic performance metric for evaluating your career brand building activities (\"The Career Brand Equity Builder\").\n\nSHOW ALL ABOUT STRATEGIC SELF-MARKETING AND PERSONAL BRANDING\nSHOW ALL"
    },
    {
       "Url":"/learn/career-fitness?specialization=career-brand-management",
       "name":"Career Total Fitness Annual Retreat",
       "Rating":"Career Total Fitness Annual Retreat\n\nIn the business world, modern organizations conduct corporate retreats on a regular basis to consider their strategic direction, review progress, and set up goals and objectives for the year.  In this course you will use the same approach to organize, strategize, re-energize, and re-invigorate your career building activities. The final Capstone Project is designed as an annual retreat aimed at facilitating your ability to step back from day-to-day demands and strategically focus on gaining a competitive edge on the job market by investigating new opportunities for career growth, conducting a thorough audit of your skill-building and self-marketing strategies, and developing new ways to enhance and showcase your marketable skills. The Capstone Project will allow you to integrate concepts and tools from the entire Career Brand Management specialization to effectively manage your career brand and increase personal effectiveness.\n\nSome unique program highlights:\n•\tThe Capstone Project is designed as a virtual training and development facility where you will engage in career investigation research, self-audit, and creating evidence-based portfolios, professional development plans, self-marketing and personal branding strategies, presentations, and public profiles;\n•\tYou’ll be actively working with your cohort (study group members) to review their work and receive peer feedback;\n•\tYou may also use the Capstone as a “career fitness gym” and work independently on a project where you will share your results with others and receive peer feedback. Examples of these projects include but are not limited to developing a self-marketing plan, creating a new digital artifact, developing communication strategy, working on a job application, creating a selection criteria statement, and looking for best practices and self-assessment tools;\n•\tIt is completely self-paced; you may want to either do it as a 4-week course, or focus and complete in just 3-4 days.\n\nOverall, the Capstone Project will help you organize yourself, fine tune your self-management information system, provide a framework for strategic self-management, and serve as an effective self-coaching support system.  In the end, you will be well positioned to succeed in the marketplace as the CEO of your own career!\n\nSHOW ALL ABOUT CAREER TOTAL FITNESS ANNUAL RETREAT\nSHOW ALL"
    },
    "/specializations/cybersecurity-cloud",
    {
       "Url":"/learn/cloud-security-basics?specialization=cybersecurity-cloud",
       "name":"Cloud Security Basics",
       "Rating":"Cloud Security Basics\n4.6\nstars\n44 ratings\n•\n11 reviews\n\nThis course introduces you to cybersecurity for the cloud. We'll learn and apply classic security techniques to today’s cloud security problems. We start with a deceptively simple and secure web service and address the problems arising as we improve it. We’ll analyze recent cloud security vulnerabilities using standard, systematic techniques. We’ll build our own web service case studies and construct security solutions for them. Our toolkit contains classic security concepts like Least Privilege and Separation of Duty, as well as more technical cryptographic and access control techniques.\n\nSHOW ALL ABOUT CLOUD SECURITY BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/cloud-data-security?specialization=cybersecurity-cloud",
       "name":"Cloud Data Security",
       "Rating":"Cloud Data Security\n\nThis course gives learners an opportunity to explore data security in the cloud. In this course, learners will:\n\n* Dive into the data services offered by cloud providers and compare their security features.\n* Analyze a data breach and trace it back to the vulnerability that made it possible.\n* Learn about database injection and aggregation attacks.\n* Follow the life cycle of a data item and its relationship to privacy and integrity.\n* Associate modern privacy requirements with US and European laws.\n\nSHOW ALL ABOUT CLOUD DATA SECURITY\nSHOW ALL"
    },
    {
       "Url":"/learn/cloud-application-security?specialization=cybersecurity-cloud",
       "name":"Cloud Application Security",
       "Rating":"Cloud Application Security\n\nAfter completing the course, the student should be able to do the following:\n\n● List and describe the OWASP Top 10 vulnerabilities.\n● Identify methods to provide cloud security assurance as part of the development life cycle, e.g. in a continuous delivery environment.\n● List and describe the different types of virtualization or sandboxing used to protect cloud applications at either the server or client.\n● Describe the application of authentication factors and federated identity solutions in cloud client and server authentication.\n● Given a cloud application, explain where and how the necessary crypto keys, passwords, and other security secrets should be stored and distributed.\n\nSHOW ALL ABOUT CLOUD APPLICATION SECURITY\nSHOW ALL"
    },
    {
       "Url":"/learn/cloud-top-ten-risks?specialization=cybersecurity-cloud",
       "name":"Cloud Top Ten Risks",
       "Rating":"Cloud Top Ten Risks\n\nAfter completing the course, the student should be able to do the following:\n\n● Associate lists of OWASP Top Ten Risks with major cloud cybersecurity risks.\n● Apply appropriate cryptographic techniques to secure authentication mechanisms and cloud data.\n● Identify the most effective strategies for resisting injection attacks, cross-site scripting attacks, and object deserialization attacks. \n● Assess strategies to address risks posed by administrative failures, including misconfiguration, broken access control, vulnerable software components, and security monitoring.\n\nSHOW ALL ABOUT CLOUD TOP TEN RISKS\nSHOW ALL"
    },
    "/specializations/requirements-engineering-secure-software",
    {
       "Url":"/learn/requirements-gathering-secure?specialization=requirements-engineering-secure-software",
       "name":"Requirements Gathering for Secure Software Development",
       "Rating":"Requirements Gathering for Secure Software Development\n4.6\nstars\n476 ratings\n•\n87 reviews\n\nIn Software Requirements Elicitation for Secure Software Development, we're going to discuss the overall software requirements process as it applies  in waterfall, spiral, and agile models.  You'll learn about each of these processes and your goals as a software requirements analyst.  This is not an easy task! Who do you talk to, when, and what kind of knowledge are you trying to obtain, in any software life cycle? How do you handle obstacles as you go?\n\nThese are the questions we will focus on answering in this specialization.\n\nSHOW ALL ABOUT REQUIREMENTS GATHERING FOR SECURE SOFTWARE DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/requirements-elicitation?specialization=requirements-engineering-secure-software",
       "name":"Requirements Elicitation: Artifact and Stakeholder Analysis",
       "Rating":"Requirements Elicitation: Artifact and Stakeholder Analysis\n4.6\nstars\n73 ratings\n•\n16 reviews\n\nIn Elicitation: Artifact and Stakeholder Driven Analysis, you will learn to use both recorded and presently unrecorded knowledge in your elicitation techniques.  As you get started in finding out about the new product, you must first learn about the product that was (if there was one) and then learn about the system to be.  Oftentimes, you'll find yourself in an environment you know nothing about! This course will help you find ways to learn about the domain, the system that was, and the system to be.  Please review: \"Who this class is for to determine if you are ready to take this graduate level course\".\n\nSHOW ALL ABOUT REQUIREMENTS ELICITATION: ARTIFACT AND STAKEHOLDER ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/requirements-specification-goals?specialization=requirements-engineering-secure-software",
       "name":"Requirements Specifications: Goals and Conflict Analysis",
       "Rating":"Requirements Specifications: Goals and Conflict Analysis\n4.7\nstars\n50 ratings\n•\n9 reviews\n\nIn Requirements Goal Development and Language Analysis, we move from the spoken word to precise writing.  A first step in this is writing goals.  We will talk about goals used in requirements engineering and, from this, writing use cases from what we learn.  Use cases can be in diagram and written form.  Then- the villains enter- misuse cases and abuse cases are discussed in how we can deal with them in a Requirements environment.  In gathering requirements, you'll have many questions remaining.  Often this leads to the need of more interviews and group sessions.  We'll go through how to handle group meetings, dealing with inconsistency, and handling conflict between stakeholders.\n\nSHOW ALL ABOUT REQUIREMENTS SPECIFICATIONS: GOALS AND CONFLICT ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/software-requirements-prioritization?specialization=requirements-engineering-secure-software",
       "name":"Software Requirements Prioritization: Risk Analysis",
       "Rating":"Software Requirements Prioritization: Risk Analysis\n4.6\nstars\n90 ratings\n•\n15 reviews\n\nRisk Analysis, Assessment, and Prioritization looks at how you can manage conflicts at system levels, but it can also be applied to lower level assessments.   How do you manage and document conflict, along with alternatives?  In analyzing alternatives, you must consider risks.  In this course, we'll look into how to analyze risk, evaluate risk, document risks, and use this information for prioritization of requirements.  Qualitative and Quantitative approaches will be covered.\n\nSHOW ALL ABOUT SOFTWARE REQUIREMENTS PRIORITIZATION: RISK ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/srs-documents-requirements?specialization=requirements-engineering-secure-software",
       "name":"SRS Documents: Requirements and Diagrammatic Notations",
       "Rating":"SRS Documents: Requirements and Diagrammatic Notations\n4.5\nstars\n43 ratings\n•\n8 reviews\n\nAs requirements are being gathered and prioritized, they also need to be documented. In Diagrammatic Notations and Software Requirements Specification Writing, we discuss and practice the process of turning requirements into something readable to the customers at a high level, and the developers.  When a designer or developer reads your document, they should be able to understand the overall idea, the scope, the domain, the resources, the expectations, and why alternative choices are not selected. To create a document in this way, you use a balance between storytelling (with pictures!) and complex diagrams.\n\nSHOW ALL ABOUT SRS DOCUMENTS: REQUIREMENTS AND DIAGRAMMATIC NOTATIONS\nSHOW ALL"
    },
    "/specializations/gcp-architecture-fr",
    {
       "Url":"/learn/gcp-fundamentals-fr?specialization=gcp-architecture-fr",
       "name":"Google Cloud Fundamentals: Core Infrastructure en Français",
       "Rating":"Google Cloud Fundamentals: Core Infrastructure en Français\n4.7\nstars\n50 ratings\n•\n6 reviews\n\nCe cours présente des concepts et des termes à connaître pour exploiter Google Cloud Platform (GCP). Vous y découvrirez et y comparerez de nombreux services informatiques et services de stockage disponibles sur Google Cloud Platform, tels que Google App Engine, Google Compute Engine, Google Kubernetes Engine, Google Cloud Storage, Google Cloud SQL et BigQuery. Vous y découvrirez aussi d'importants outils de gestion des ressources et des règles, comme la hiérarchie de Google Cloud Resource Manager et Google Cloud Identity and Access Management. Des ateliers pratiques vous permettront d'acquérir les compétences fondamentales dont vous aurez besoin pour exploiter GCP.\n\nRemarque :\n• Les services Google ne sont pas disponibles en Chine pour le moment.\n\nSHOW ALL ABOUT GOOGLE CLOUD FUNDAMENTALS: CORE INFRASTRUCTURE EN FRANÇAIS\nSHOW ALL"
    },
    {
       "Url":"/learn/gcp-infrastructure-foundation-fr?specialization=gcp-architecture-fr",
       "name":"Essential Cloud Infrastructure: Foundation en Français",
       "Rating":"Essential Cloud Infrastructure: Foundation en Français\n4.6\nstars\n12 ratings\n•\n1 reviews\n\nCe cours à la demande accéléré d'une semaine présente aux participants l'infrastructure et les services de plate-forme complets et flexibles de Google Cloud Platform. À travers un ensemble de cours vidéo, de démonstrations et d'ateliers pratiques, les participants découvrent et déploient des éléments de solution, y compris des composants d'infrastructure tels que les réseaux, les machines virtuelles et les services d'application. Vous découvrirez comment utiliser Google Cloud Platform via la console et Cloud Shell. Vous en apprendrez également plus sur le rôle d'un architecte cloud, sur les approches de la conception d'infrastructure et sur la configuration de réseaux virtuels avec Virtual Private Cloud (VPC), les projets, les réseaux, les sous-réseaux, les adresses IP, les routes et les règles de pare-feu.\n\nPrérequis\n Pour tirer pleinement parti de ce cours, les participants doivent remplir les prérequis suivants :\n • Avoir suivi la formation Google Cloud Platform Fundamentals (Core Infrastructure ou utilisateurs professionnels d'AWS) ou disposer d'une expérience équivalente.\n • Maîtriser les principes de base des outils de ligne de commande et des environnements du système d'exploitation Linux.\n • Disposer d'une expérience dans le domaine de l'exploitation de systèmes, y compris le déploiement et la gestion d'applications sur site ou dans un environnement de cloud public.\n\nSHOW ALL ABOUT ESSENTIAL CLOUD INFRASTRUCTURE: FOUNDATION EN FRANÇAIS\nSHOW ALL"
    },
    {
       "Url":"/learn/gcp-infrastructure-core-services-fr?specialization=gcp-architecture-fr",
       "name":"Essential Cloud Infrastructure: Core Services en Français",
       "Rating":"Essential Cloud Infrastructure: Core Services en Français\n\nCe cours à la demande accéléré présente aux participants l'infrastructure et les services de plate-forme complets et flexibles de Google Cloud Platform. À travers un ensemble de vidéos de présentation, de démonstrations et d'ateliers pratiques, les participants découvrent et déploient des éléments de solution, y compris des composants d'infrastructure tels que les réseaux, les systèmes et les services applicatifs. Ce cours aborde également le déploiement de solutions pratiques, telles que l'interconnexion sécurisée des réseaux, les clés de chiffrement fournies par le client, la sécurité et la gestion des accès, les quotas et la facturation, ainsi que la surveillance des ressources.\n\nPrérequis : \nPour tirer pleinement parti de ce cours, les participants doivent remplir les prérequis suivants :\n • Avoir suivi la formation Google Cloud Platform Fundamentals (Core Infrastructure ou AWS Professionals) ou disposer d'une expérience équivalente.\n • Avoir suivi la formation Essential Cloud Infrastructure: Foundation ou disposer d'une expérience équivalente.\n • Maîtriser les principes de base des outils de ligne de commande et des environnements du système d'exploitation Linux.\n • Disposer d'une expérience dans l'exploitation de systèmes, y compris le déploiement et la gestion d'applications sur site ou dans un environnement de cloud public.\n\n>>> En vous inscrivant à ce cours, vous acceptez les conditions d'utilisation de Qwiklabs (disponibles à l'adresse suivante : https://qwiklabs.com/terms_of_service) comme indiqué dans les questions fréquentes. <<<\n\nSHOW ALL ABOUT ESSENTIAL CLOUD INFRASTRUCTURE: CORE SERVICES EN FRANÇAIS\nSHOW ALL"
    },
    {
       "Url":"/learn/gcp-infrastructure-scaling-automation-fr?specialization=gcp-architecture-fr",
       "name":"Elastic Cloud Infrastructure: Scaling and Automation en Français",
       "Rating":"Elastic Cloud Infrastructure: Scaling and Automation en Français\n\nCe cours à la demande accéléré présente aux participants l'infrastructure et les services de plate-forme complets et flexibles de Google Cloud Platform. À travers un ensemble de vidéos de présentation, de démonstrations et d'ateliers pratiques, les participants découvrent et déploient des éléments de solution, y compris des composants d'infrastructure tels que les réseaux, les systèmes et les services applicatifs. Ce cours aborde également le déploiement de solutions pratiques, telles que l'interconnexion sécurisée des réseaux, l'équilibrage de charge, l'autoscaling, l'automatisation d'infrastructure et les services gérés.\n\nPrérequis : \n Pour tirer pleinement parti de ce cours, les participants doivent remplir les prérequis suivants :\n • Avoir suivi la formation Google Cloud Platform Fundamentals (Core Infrastructure ou utilisateurs professionnels d'AWS) ou disposer d'une expérience équivalente\n • Avoir suivi la formation Essential Cloud Infrastructure: Foundation ou disposer d'une expérience équivalente\n • Avoir suivi la formation Essential Cloud Infrastructure: Core Services ou disposer d'une expérience équivalente\n • Maîtriser les principes de base des outils de ligne de commande et des environnements du système d'exploitation Linux\n • Disposer d'une expérience dans le domaine de l'exploitation de systèmes, y compris en ce qui concerne le déploiement et la gestion d'applications sur site ou dans un environnement de cloud public\n \n >>> En vous inscrivant à ce cours, vous acceptez les conditions d'utilisation de Qwiklabs comme indiqué dans les questions fréquentes. Celles-ci sont disponibles à l'adresse suivante : https://qwiklabs.com/terms_of_service <<<\n\nSHOW ALL ABOUT ELASTIC CLOUD INFRASTRUCTURE: SCALING AND AUTOMATION EN FRANÇAIS\nSHOW ALL"
    },
    {
       "Url":"/learn/cloud-infrastructure-design-process-fr?specialization=gcp-architecture-fr",
       "name":"Reliable Cloud Infrastructure: Design and Process en Français",
       "Rating":"Reliable Cloud Infrastructure: Design and Process en Français\n\nCe cours permet d'apprendre à créer des solutions hautement fiables et efficaces sur Google Cloud, en s'appuyant sur des modèles de conception éprouvés. Il s'inscrit dans la continuité du cours \"Architecting with Google Compute Engine\" et du cours \"Architecting with Google Kubernetes Engine\", et propose des expériences pratiques qui font appel aux technologies abordées dans l'un ou l'autre de ces cours. Grâce à une série de présentations, d'activités de conception et d'ateliers pratiques, vous apprendrez à définir et équilibrer des exigences techniques et commerciales de manière à concevoir des déploiements Google Cloud hautement fiables et disponibles, sécurisés et rentables.\n\nCe cours vous permettra d'acquérir les compétences suivantes :\n● Exploiter une boîte à outils composée de questions, de techniques et de considérations conceptuelles\n● Définir les exigences d'une application et les exprimer objectivement sous forme de KPI, SLO et SLI\n● Décomposer les exigences d'une application afin de trouver des limites adéquates pour les microservices\n● Tirer parti des outils de développement Google Cloud pour créer des pipelines de déploiement automatisé modernes\n● Choisir les services Cloud Storage appropriés en fonction des exigences de l'application\n● Construire des réseaux cloud et hybrides\n● Mettre en œuvre des applications fiables, évolutives et résilientes, en trouvant le bon compromis entre statistiques clés de performance et coût\n● Choisir les bons services de déploiement Google Cloud pour vos applications\n● Sécuriser des applications, des données et des infrastructures cloud\n● Surveiller les objectifs de niveau de service et les coûts à l'aide des outils Google Cloud\n\nPrérequis\n● Avoir suivi les cours précédents de la spécialisation Architecting with Google Cloud Platform ou Architecting with Google Kubernetes Engine, ou justifier d'une expérience équivalente\n● Maîtriser les principes de base des outils de ligne de commande et des environnements du système d'exploitation Linux\n● Justifier d'une expérience en exploitation des systèmes, y compris en déploiement et en gestion d'applications, localement ou dans un\nenvironnement de cloud public\n\nSHOW ALL ABOUT RELIABLE CLOUD INFRASTRUCTURE: DESIGN AND PROCESS EN FRANÇAIS\nSHOW ALL"
    },
    "/specializations/start-your-own-business",
    {
       "Url":"/learn/entrepreneurial-mindset?specialization=start-your-own-business",
       "name":"Developing An Entrepreneurial Mindset: First Step Towards Success",
       "Rating":"Developing An Entrepreneurial Mindset: First Step Towards Success\n4.5\nstars\n541 ratings\n•\n171 reviews\n\nThis course is the first in a series on starting a business. Though new venture creation is the focus of the specialization, this course is important for everyone.To create a successful business it is not only about what you do (technical execution), it is also about how you think.  This course provides learners with insights to re-frame their thinking in order to maximize their chances for success. \n\nSo what can a learner expect to gain from this course? At the end of this course a learner:\n     1.)  will be able to argue effectively against all of the reasons for not starting their business (or reaching some goal);\n     2.) will be  able to operate effectively within the new framework or model for starting a business (or any new endeavor),\n        thus increasing their chances for success; and\n     3.)  will be able to make the initial business startup decisions of what type of business to start, and what type of business \n       owner to be.\n\nHaving an entrepreneurial mindset is critical to being successful as an entrepreneur. An entrepreneurial mindset stands alone in terms of its importance. No other attribute, personality, inherent entrepreneurial proclivities, training, or demographic profile is common to all successful entrepreneurs whether Warren Buffet, Steve Jobs, or the neighborhood florist or grocer.\n\nThe course provides learners with an understanding of the attributes and perspectives of an entrepreneurial mindset, and the process to acquire one. We suggest that learners bring an open mind and be willing to thoroughly explore the nascent business ventures they have been carrying with them.The course introduces concepts that enables a person to start a trans-formative process in the way they think generally, and in the way they think about business specifically. This new way of thinking has the potential to positively impact not only them, but their family, and community.\n\nSHOW ALL ABOUT DEVELOPING AN ENTREPRENEURIAL MINDSET: FIRST STEP TOWARDS SUCCESS \nSHOW ALL"
    },
    {
       "Url":"/learn/start-your-own-business-2-ideation?specialization=start-your-own-business",
       "name":"The Search for Great Ideas: Harnessing creativity to empower innovation.",
       "Rating":"The Search for Great Ideas: Harnessing creativity to empower innovation.\n4.4\nstars\n138 ratings\n•\n33 reviews\n\nWhere do great business ideas come from? We all have compelling business concepts that we've been thinking about for years. In this course we will explore how to use observational tools and other techniques for idea generation and we will talk about how to evaluate the good ideas from the bad. The goal is to settle on a business idea that you are not only passionate about but also has real market application.\n\nAt the end of this course learners will be able to:\n   -build a resource inventory from which they can assess and create market opportunities;\n   -pursue market opportunities consistent with personal passions and capabilities; and\n   -triage potential ideas in terms of which have the greatest potential for commercial and personal success.\n\nSHOW ALL ABOUT THE SEARCH FOR GREAT IDEAS: HARNESSING CREATIVITY TO EMPOWER INNOVATION. \nSHOW ALL"
    },
    {
       "Url":"/learn/business-planning?specialization=start-your-own-business",
       "name":"Planning: Principled, Proposing, Proofing, and Practicing to a Success Plan",
       "Rating":"Planning: Principled, Proposing, Proofing, and Practicing to a Success Plan\n4.4\nstars\n73 ratings\n•\n23 reviews\n\nAccording to Steven Blank a business startup, or any new venture startup is essentially a proto-type. Thus the startup process essentially becomes a learning process to refine that business proto-type into a scalable, replicable finished 'product'.\n\nAt the end of this course learners will be able to:\n   -complete a business model summarizing assumptions about what value they will offer to whom, and how they will make \n    money.\n   - systematically test and validate these assumptions within the constraints of their available resources, and\n   - use these validated assumptions to generate financial projections that are based on actual resources and efforts expended.\n\nThe days of the 40 page business plan have certainly passed, but the role of planning in the business creation process is one of extreme importance. In this course we will explore the important components that you need to explore in detail prior to business creation. Action without planning is a recipe for disaster and we will make sure you have a rock solid foundation for future actions.\n\nThe planning here is focused on learning. It is unrealistic for anyone to document in detail all of the actions they should take to make a new venture or activity successful when they (and often no one else) has any experience with the new venture and the conditions which it is likely to face. Thus the business plan based largely on assumptions and aggregate, non-applicable data is replaced with the business model which organizes the key assumptions determining what value the business will offer to whom, and how it will make money. The course will guide learners through the process of systematically testing and validating these assumptions, and obtaining specific, applicable data. It will then show learners how to use these validated assumptions to generate pro-forma financial statements directly tied to actions and resources based on this business model.\n\nSHOW ALL ABOUT PLANNING: PRINCIPLED, PROPOSING, PROOFING, AND PRACTICING TO A SUCCESS PLAN\nSHOW ALL"
    },
    {
       "Url":"/learn/business-structure?specialization=start-your-own-business",
       "name":"Structure: Building the Frame for Business Growth",
       "Rating":"Structure: Building the Frame for Business Growth\n4.7\nstars\n64 ratings\n•\n16 reviews\n\nJust like when building a house the foundation for your business provides the framework for success. A business built on weak structure will struggle to succeed. We'll address some of the most pressing issues that you as a business owner must face while constructing the proper framework for your business. \n\nSpecifically at the end of this course you will be able to:\n   - create and evaluate your company's financial documents;\n   -complete the documents and regulatory procedures to create a legal business entity;\n   - protect your intellectual property;\n   -develop a management team;\n\nSHOW ALL ABOUT STRUCTURE: BUILDING THE FRAME FOR BUSINESS GROWTH\nSHOW ALL"
    },
    {
       "Url":"/learn/launch-strategy?specialization=start-your-own-business",
       "name":"Launch Strategy: 5 Steps to Capstone Experience",
       "Rating":"Launch Strategy: 5 Steps to Capstone Experience\n4.7\nstars\n35 ratings\n•\n8 reviews\n\nThis course is the last course in this specialization before its capstone experience where you, the learner will launch your business. Consider all the activities associated with the final preparation for a NASA launch before the final countdown takes place. Those are the type of activities with respect to launching a business that will be covered in this course. The goal of the course is for you to have a document that details all the actions you need to take, and all the things that you need to think about before launching your business, with instructions on how to do those actions and how to thing about those things. \n\nSpecifically the course will provide you with five benefits or outcomes. First your attitude will be finely focused and tuned to the mindset concepts covered in course one that are likely to have the greatest impact on your business launch. Second in a similar fashion you will become keenly aware of those aspects of your business that directly impact its ability to create and deliver value on day one; and have actions plans to address each aspect. With your 'mind right' and your 'business right' the third and fourth outcomes of the course are actions plans to get your 'market connections' right. The course will allow you to explore strategies and tactics to engage the market, communication your message, and generate sales; and select those which give you the best opportunity to learn and establish a foundation for growth. Finally the course will walk you through a final checklist of operational issues that will allow you to enter the capstone course and your business launch ready to go on day one.\n\nThroughout the course we have emphasized the importance of market engagement, allowing the market to provide feedback that sharpens your business and maximizes its chances for success. As with the entire specialization the feedback you will get through the peer review assignments for this course and the capstone course are an invaluable opportunity for for such engagement.\n\nSHOW ALL ABOUT LAUNCH STRATEGY: 5 STEPS TO CAPSTONE EXPERIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/start-your-own-business-project?specialization=start-your-own-business",
       "name":"Capstone - Launch Your Own Business!",
       "Rating":"Capstone - Launch Your Own Business!\n4.8\nstars\n34 ratings\n•\n10 reviews\n\nIt is a cliché, but nevertheless very true. Experience is the best teacher. It is also the best confidence builder. It is time for you to take action! The concepts and skills presented throughout the courses in the specialization are applied in this capstone course where you will launch an actual business.\n\nIt will not be a business concept described on paper, but a functional business with legal status in your particular governmental jurisdiction, developed within your available resources whatever they are, and challenged to generate revenue.\n\nOne of the greatest benefits of this specialization is the business development environment provided by the population of learners. At the point of the capstone course your thousands of fellow learners become consultants capable of refining and adding value to your business concept, they may also be potential customers or at the very least allow you to observe the likely reactions from potential customers.\n\nWith the experience of launching this startup, and the execution capabilities and confidence gain from that experience it is our desire that you repeat the process and launch another startup or a bigger version of this startup. Hopefully going on to launch another, and another, and another, evoking another cliché, 'practice will make perfect'.\n\nSHOW ALL ABOUT CAPSTONE - LAUNCH YOUR OWN BUSINESS!\nSHOW ALL"
    },
    "/specializations/social-determinants-on-health",
    {
       "Url":"/learn/social-determinants-of-health?specialization=social-determinants-on-health",
       "name":"Social Determinants of Health",
       "Rating":"Social Determinants of Health\n4.7\nstars\n11 ratings\n•\n4 reviews\n\nThis is an introductory course on social determinants of population health with a focus on the United States. The course will introduce you to, or reinforce your knowledge of, issues related to health that consider behavioral, psychological and structural factors in population health beyond the healthcare system. We will examine social, economic, and political factors that contribute to health inequalities and suggest innovative ways to reduce disparities in health when the goal is to achieve health equity.\n\nThis course will increase your awareness, knowledge, and understanding of issues related to behavioral, psychological, and structural factors that contribute to understanding population health and health inequities. We will discuss conceptual and methodological issues key to health professionals working towards achieving health equity to reduce health disparities at multiple levels of influence. There will be opportunities to practice skills involving cultural humility, deliberative dialogues and professional self-assessments.\n\nBy the end of this course, you will be able to:\nDiscuss the means by which structural bias, social inequalities and racism undermine health and create challenges to achieving health equity at organizational, community and societal levels\n\nSHOW ALL ABOUT SOCIAL DETERMINANTS OF HEALTH \nSHOW ALL"
    },
    {
       "Url":"/learn/the-influence-of-social-context-on-health?specialization=social-determinants-on-health",
       "name":"The Influence of Social Context on Health",
       "Rating":"The Influence of Social Context on Health\n\nWhy are some groups healthier than others, and how do these differences emerge and persist over the life course? How do social policies (e.g., housing, transportation, employment) relate to health and health inequalities? Why are there health disparities even in countries that have free universal health care? This course will address conceptual models for understanding health disparities in the US and internationally, how population science identifies the main sources of these disparities, and how public health can inform policy efforts to address these disparities.\n\nAfter taking this course, you will be able to identify ways in which conditions in the healthcare setting and at work, school, and home influence health; identify models for considering how the social context provides both sources of stress and sources of support for health; and explain how social and physical environments, including schools and workplaces, the healthcare system, and neighborhoods, shape health and health inequalities over the life course.\n\nSHOW ALL ABOUT THE INFLUENCE OF SOCIAL CONTEXT ON HEALTH\nSHOW ALL"
    },
    {
       "Url":"/learn/assessing-and-improving-community-health?specialization=social-determinants-on-health",
       "name":"Assessing and Improving Community Health",
       "Rating":"Assessing and Improving Community Health\n\nThis course is intended to serve as an introduction to population health from both the vantage point of both public health and healthcare. We will examine the key components of community health needs assessments, how they are used, and how to compare population health assessments across subpopulations and time. We will also explore the epidemiological sources and criteria by which to select high quality data sources to estimate population health indicators and to select evidence-based interventions to improve population health. Finally, we will design multi sector collaborations that support the phases of population health improvement.\n\nAs a survey of the population health, the course provides an overview for students wishing no more than an introduction to the field, as well as good grounding for students who wish to pursue additional coursework in population health.\n\nAfter taking this course, you will be able to:\n- Explain differences between population health assessments for public health and healthcare.\n- Outline the key components of community health needs assessments (CHNA).\n- Compare how public health and healthcare will use a CHNA to improve population health.\n- Identify key population health indicators for social determinants of health.\n- Identify key population health indicators for mental health and opioid abuse.\n- Categorize data sources by epidemiologic criteria.\n- Analyze differences between subpopulations and across time trends.\n- Formulate multi sector collaborations that support population health improvement.\n- Outline a plan for population health improvement.\n- Evaluate evidence-based interventions based on epidemiologic criteria and community suitability.\n\nSHOW ALL ABOUT ASSESSING AND IMPROVING COMMUNITY HEALTH\nSHOW ALL"
    },
    "/specializations/palliative-care",
    {
       "Url":"/learn/what-is-palliative-care?specialization=palliative-care",
       "name":"What is Palliative Care?",
       "Rating":"What is Palliative Care?\n4.8\nstars\n230 ratings\n•\n59 reviews\n\nPalliative care provides invaluable help for patients living with serious or life-limiting illness and their family caregivers.  Palliative care should be part of healthcare services to improve quality of life, the ability to tolerate and benefit from treatment and improve survival. In this course, you will learn about the nature of suffering and how this concept can help you understand the experience of people living with serious illness. Next, you will learn skills to more effectively communicate with patients, families and other care providers to both understand their experiences and provide an extra layer of support. In the next module you will explore your own core values and beliefs and how they impact your work with others. Finally, you will learn how to do a whole person assessment to understand the needs of people with serious illness so you can develop a plan to support them. \n\nYou will be able to immediately use these insights, skills and tools in your work with people living with serious illness. In later courses, you will learn to ease pain and other symptoms, such as loss of appetite, shortness of breath and fatigue. In the final course, you will explore ways to ease psycho-social-spiritual distress. These courses will prepare you to bring basic palliative care to all in need.\n\nSHOW ALL ABOUT WHAT IS PALLIATIVE CARE?\nSHOW ALL"
    },
    {
       "Url":"/learn/pain-management-easing-pain-in-palliative-care?specialization=palliative-care",
       "name":"Pain Management: Easing Pain in Palliative Care",
       "Rating":"Pain Management: Easing Pain in Palliative Care\n4.8\nstars\n133 ratings\n•\n39 reviews\n\nIn this course, you will be able to develop a systems view for assessing and managing pain in the palliative care setting. By the end of the course, you will be able to: 1) Describe the pain problem in the palliative care setting; 2) Assess a person’s pain, 3) Explain the benefits of integrative therapies and pharmacologic strategies to manage pain.\n\nSHOW ALL ABOUT PAIN MANAGEMENT: EASING PAIN IN PALLIATIVE CARE\nSHOW ALL"
    },
    {
       "Url":"/learn/easing-physical-symptoms?specialization=palliative-care",
       "name":"Easing Physical Symptoms: It's Not Just Hospice Anymore",
       "Rating":"Easing Physical Symptoms: It's Not Just Hospice Anymore\n4.8\nstars\n70 ratings\n•\n20 reviews\n\nPalliative care provides important support for people living with serious or life-limiting illnesses and their family caregivers. In this course, you will learn to use symptom assessment tools to better understand which symptoms are present and which are most distressing. In subsequent weeks you will learn about some of the most common and distressing symptoms such as anorexia (loss of appetite), dyspnea (shortness of breath), fatigue (weakness), delirium(confusion) and constipation and nausea/vomiting. For each of these symptoms, you will learn about the underlying cause and potential ways to support people and their families to manage the symptoms with simple practical and non-medical approaches as well as a review of medications as appropriate. In addition, you will learn to help people with their emotional response to symptoms and loss of function.\n\nYou will be able to immediately use these insights, skills, and tools in your work with people living with serious illness. In other courses, you will learn communication skills, whole person assessment, how to ease physical pain and explore ways to ease psycho-social-spiritual distress.\n\nSHOW ALL ABOUT EASING PHYSICAL SYMPTOMS: IT'S NOT JUST HOSPICE ANYMORE\nSHOW ALL"
    },
    {
       "Url":"/learn/psychosocial-spiritual-aspects-palliative-care?specialization=palliative-care",
       "name":"Psychosocial and Spiritual Aspects of Palliative Care",
       "Rating":"Psychosocial and Spiritual Aspects of Palliative Care\n4.9\nstars\n72 ratings\n•\n19 reviews\n\nIn this course, you’ll learn how serious and life-threatening illnesses often affect emotional and spiritual well-being. Illnesses can increase stress as patients and families learn to live with a “new normal” that may often focus on illness. You’ll learn how to tell when normal sadness (or grief) becomes something more serious and needs to be addressed. People with serious illnesses also have social concerns as their family, friends and community support system becomes stretched, and sometimes fails. We’ll talk about resources and skills you can use to help support patients and families. You’ll learn about advance care planning, that includes shared decision-making, setting goals of care, and writing down plans for care.\n\nSHOW ALL ABOUT PSYCHOSOCIAL AND SPIRITUAL ASPECTS OF PALLIATIVE CARE\nSHOW ALL"
    },
    {
       "Url":"/learn/palliative-care-capstone-project?specialization=palliative-care",
       "name":"Palliative Care Capstone Projects",
       "Rating":"Palliative Care Capstone Projects\n4.8\nstars\n27 ratings\n•\n10 reviews\n\nIn the Capstone Course you have the opportunity to put what you have been learning about in the Palliative Care Specialization into practice. Our team has created five activities that directly relate to what you have been learning in the course. You will need to talk with someone you know, perhaps a friend or family member, about their experiences living with serious and life limiting illness. You may want to engage several people as you go through the 5 assignments as they each will have unique experiences. \n\nThe Five Assignments: \n\n1) Use the Nature of Suffering Evaluation Form to guide your conversation with someone living with serious illness and report and reflect on how this illness is impacting different aspects of their lives. \n\n2) Using SNAP/Self-Awareness skills explore the values of someone close to you and your own values as relate to health, illness and dying. \n\n3) Using the WILDA tool complete a pain assessment with someone living with serious illness. \n\n4) Using the ESAS tool complete a physical symptom assessment with someone living with serious illness. \n\n5) Have a conversation with someone you know about Advance Care Planning. In the assignment you will focus on who would be the person that they would want to speak for them if they could not speak for themselves, often known as the MDPOA. \n\nWhen you successfully complete all 5 of these assignments and the other course work you will earn the Coursera Specialization Certificate in Palliative Care. More importantly you will be prepared to help others live well with serious and life-limiting disease.\n\nSHOW ALL ABOUT PALLIATIVE CARE CAPSTONE PROJECTS\nSHOW ALL"
    },
    "/specializations/teacher-sel",
    {
       "Url":"/learn/teachers-social-emotional-learning?specialization=teacher-sel",
       "name":"The Teacher's Social and Emotional Learning",
       "Rating":"The Teacher's Social and Emotional Learning\n4.7\nstars\n472 ratings\n•\n149 reviews\n\nSocial and emotional learning, or SEL, programs have flourished in schools during the last decade.  While this growth has been impressive, inadequate attention has been paid to teachers’ social and emotional learning.  In this course Dan Liston and Randy Testa introduce you to various rationales for why teacher SEL is needed as well as examine and reflect on various emotions in teaching and learning.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization??  If so check out \"How you can earn 3 university credits from  the University of Colorado-Boulder for this specialization\" reading in the first module of this course  for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind. As a participant you may notice a bit more reading content and a little less video/lecture content. Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization?  Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.\n\nSHOW ALL ABOUT THE TEACHER'S SOCIAL AND EMOTIONAL LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/sel-for-students?specialization=teacher-sel",
       "name":"SEL for Students: A Path to Social Emotional Well-Being",
       "Rating":"SEL for Students: A Path to Social Emotional Well-Being\n4.8\nstars\n197 ratings\n•\n50 reviews\n\nSocial and emotional learning, or SEL, programs have flourished in schools during the last decade. In this course the instructor (Emily Price) introduces you to the history and framings of social and emotional learning preK-12 curricula, as well as various elementary, middle, and high school SEL programs and associated research.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization? If so check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first module of this course for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind. As a participant you may notice a bit more reading content and a little less video/lecture content. Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization?  Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.\n\nSHOW ALL ABOUT SEL FOR STUDENTS: A PATH TO SOCIAL EMOTIONAL WELL-BEING\nSHOW ALL"
    },
    {
       "Url":"/learn/expanding-sel?specialization=teacher-sel",
       "name":"Expanding SEL",
       "Rating":"Expanding SEL\n4.8\nstars\n99 ratings\n•\n14 reviews\n\nSocial and emotional learning, or SEL, programs have flourished in schools during the last decade.  In this course the instructors (Emily Price and Ben Kirshner) introduce and help you examine community based and youth-empowerment approaches to social and emotional learning.  Some of these approaches address the impact of social and political systems, such as immigration and structural racism, on children’s social and emotional experiences.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization? If so check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first module of this course for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind. As a participant you may notice a bit more reading content and a little less video/lecture content. Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization?  Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.\n\nSHOW ALL ABOUT EXPANDING SEL\nSHOW ALL"
    },
    {
       "Url":"/learn/teacher-sel-programs?specialization=teacher-sel",
       "name":"Teacher SEL: Programs, Possibilities, and Contexts",
       "Rating":"Teacher SEL: Programs, Possibilities, and Contexts\n4.8\nstars\n110 ratings\n•\n21 reviews\n\nSocial and emotional learning, or SEL, student programs have flourished in schools during the last decade.  Unfortunately inadequate attention has been paid to teachers’ social and emotional learning. \n\nIn this course the instructors (Randy Testa and Dan Liston) introduce and examine distinct and established teacher SEL programs, as well as some alternative possibilities.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization? If so check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first module of this course for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind. As a participant you may notice a bit more reading content and a little less video/lecture content. Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization?  Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.\n\nSHOW ALL ABOUT TEACHER SEL: PROGRAMS, POSSIBILITIES, AND CONTEXTS\nSHOW ALL"
    },
    {
       "Url":"/learn/sel-capstone?specialization=teacher-sel",
       "name":"SEL Capstone",
       "Rating":"SEL Capstone\n4.7\nstars\n41 ratings\n•\n13 reviews\n\nIn this course the instructors (Randy Testa, Ben Kirshner, Emily Price, and Dan Liston) have designed two culminating projects for the Coursera Specialization entitled – “The Teacher and SEL”.  The two options include: “A Teacher Implementation Plan”, and “The Cinema, SEL, and the Classroom”.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization??  If so check out \"How you can earn 3 university credits from  the University of Colorado-Boulder for this specialization\" reading in the first module of this course  for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind.  As a participant you may notice a bit more reading content and a little less video/lecture content.  Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization?  Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.\n\nSHOW ALL ABOUT SEL CAPSTONE\nSHOW ALL"
    },
    "/specializations/art-for-games",
    {
       "Url":"/learn/pixel-art-video-games?specialization=art-for-games",
       "name":"Pixel Art for Video Games",
       "Rating":"Pixel Art for Video Games\n4.6\nstars\n173 ratings\n•\n57 reviews\n\nThis course is aimed to give you the tools and knowledge you need to start creating simple art for video games made in the Unity game engine. Through the aesthetic of pixel art we will explore artistic principals like shape language, color theory, and composition as well as show you a step by step workflow for creating assets that you can use to make your own games. The course is broken into 4 main modules, props, environments, characters, and animation. Each of these courses will have a series of video lessons alternating between artistic and technical skills culminating in a peer-reviewed project based assignment. The last module will challenge you to take the knowledge learned in the previous 4 and use it to create your own pixel art asset pack.\n\nThis course is aimed at art novices who are interested in creating art for their own games or contributing to game projects. If you are a game designer or programmer, you will find this course helps give you a glimpse into the world of game art. You will be able to better work with artists, or create your own prototype or final artwork. If you are an artist or visual designer who is interested in bringing your style to the world of video game development, this course will give you the workflow to properly interface with a game engine and help contextualize how your artistic sensibilities can enable gameplay.\n\nIf you have ever wanted to start making art for video games but have no idea how to start, this course is the perfect for giving you a solid foundation while teaching you usable practical skills. Our goal is to give you a sense of the whole pipeline from creation to setting up in a game engine.\n\nSHOW ALL ABOUT PIXEL ART FOR VIDEO GAMES\nSHOW ALL"
    },
    {
       "Url":"/learn/low-poly-art-video-games?specialization=art-for-games",
       "name":"Low Poly Art For Video Games",
       "Rating":"Low Poly Art For Video Games\n4.1\nstars\n29 ratings\n•\n10 reviews\n\nThis course is aimed to give you the tools and knowledge you need to start creating simple 3D art for video games made in the Unity game engine. Through the aesthetic of pixel art we will explore artistic principals like shape language, color theory, and composition as well as show you a step by step workflow for creating assets that you can use to make your own games. The course is broken into 4 main modules, props, environments, characters, and animation. Each of these courses will have a series of video lessons alternating between artistic and technical skills culminating in a peer-reviewed project based assignment. The last module will challenge you to take the knowledge learned in the previous 4 and use it to create your own pixel art asset pack.\n\nThis course is aimed at art novices who are interested in creating art for their own games or contributing to game projects. If you are a game designer or programmer, you will find this course helps give you a glimpse into the world of game art. You will be able to better work with artists, or create your own prototype or final artwork. If you are an artist or visual designer who is interested in bringing your style to the world of video game development, this course will give you the workflow to properly interface with a game engine and help contextualize how your artistic sensibilities can enable gameplay.\n\nIf you have ever wanted to start making art for video games but have no idea how to start, this course is the perfect for giving you a solid foundation while teaching you usable practical skills. Our goal is to give you a sense of the whole pipeline from creation to setting up in a game engine.\n\nSHOW ALL ABOUT LOW POLY ART FOR VIDEO GAMES\nSHOW ALL"
    },
    {
       "Url":"/learn/3d-game-prop-production?specialization=art-for-games",
       "name":"Current Gen 3D Game Prop Production",
       "Rating":"Current Gen 3D Game Prop Production\n4.8\nstars\n19 ratings\n•\n6 reviews\n\nIn this course you will learn to create a photo-real game prop using modern game art production techniques. You will gather reference, generate a base model, create a high polygon model, bake details onto a low poly model, and then texture and present a final portfolio piece. This course is aimed at students who have some knowledge in 3d and game art and would like to learn more advanced techniques employed in the creation of modern game assets. We will be using Maya, Zbrush, Marmoset, and Substance Painter extensively throughout the course. When you are finished you will have your own model based of of a real-world prop suitable for use in modern game engines.\n\nSHOW ALL ABOUT CURRENT GEN 3D GAME PROP PRODUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/concept-art-video-games?specialization=art-for-games",
       "name":"Concept Art for Video Games",
       "Rating":"Concept Art for Video Games\n4.7\nstars\n41 ratings\n•\n7 reviews\n\nIn this course we will talk about Concept Art. As a final project we will create a fully finished environment concept, ready for presentation. Throughout the 4 week modules will dive deeply into composition and digital painting techniques to bring your art skills to the next level! So, let's get started!"
    },
    "/specializations/learn-finance",
    {
       "Url":"/learn/financial-analysis?specialization=learn-finance",
       "name":"The Language and Tools of Financial Analysis",
       "Rating":"The Language and Tools of Financial Analysis\n4.7\nstars\n1,226 ratings\n•\n226 reviews\n\nIn this course, participants will learn the foundations of accounting principles and financial analysis, develop an understanding of the links between these, and the measurement of value creation at the firm level. This is the first course in a four-course Specialization on the Essentials of Corporate Financial Analysis and Decision-Making, created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).\n\nView the MOOC promotional video here: http://tinyurl.com/jeoa83t\n\nSHOW ALL ABOUT THE LANGUAGE AND TOOLS OF FINANCIAL ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/capital-markets?specialization=learn-finance",
       "name":"The Role of Global Capital Markets",
       "Rating":"The Role of Global Capital Markets\n4.6\nstars\n542 ratings\n•\n73 reviews\n\nIn this course, participants will learn about how different markets around the world can interact to create value for, and effectively manage the risk of, corporations and their stakeholders. This is part of a Specialization in corporate finance created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).\n\nView the MOOC promotional video here: http://tinyurl.com/j7wyowo\n\nSHOW ALL ABOUT THE ROLE OF GLOBAL CAPITAL MARKETS\nSHOW ALL"
    },
    {
       "Url":"/learn/value-creation?specialization=learn-finance",
       "name":"Corporate Financial Decision-Making for Value Creation",
       "Rating":"Corporate Financial Decision-Making for Value Creation\n4.7\nstars\n405 ratings\n•\n58 reviews\n\nIn this course, participants will learn about the key financial decisions modern corporations face, as well as the alternative methods that can be employed to optimize the value of the firm’s assets. This is part of a Specialization in corporate finance created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).\n\nSHOW ALL ABOUT CORPORATE FINANCIAL DECISION-MAKING FOR VALUE CREATION\nSHOW ALL"
    },
    {
       "Url":"/learn/valuation?specialization=learn-finance",
       "name":"Alternative Approaches to Valuation and Investment",
       "Rating":"Alternative Approaches to Valuation and Investment\n4.7\nstars\n272 ratings\n•\n32 reviews\n\nIn this course, participants will develop an understanding of the intuitive foundations of asset and investment valuation, and how alternative valuation techniques may be used in practice. This is part of a Specialization in corporate finance created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon). \n\nView the MOOC promotional video here: http://tinyurl.com/h75pzt6\n\nSHOW ALL ABOUT ALTERNATIVE APPROACHES TO VALUATION AND INVESTMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/financial-analysis-project?specialization=learn-finance",
       "name":"Essentials of Corporate Finance Capstone",
       "Rating":"Essentials of Corporate Finance Capstone\n4.7\nstars\n110 ratings\n•\n19 reviews\n\nThe Capstone Project is the final part of the Essentials of Corporate Financial Analysis and Decision-Making MOOC Specialization. \n\nThe Capstone is designed to allow students to bring together the skills acquired and knowledge gained over the preceding four courses of the Specialization by taking on the role of a financial analyst tasked with advising a wealthy private client on a significant strategic investment in a large listed firm operating across the globe.\n\nView the MOOC promotional video here: http://tinyurl.com/j9fqv25\n\nSHOW ALL ABOUT ESSENTIALS OF CORPORATE FINANCE CAPSTONE\nSHOW ALL"
    },
    "/specializations/basics-in-computer-vision",
    {
       "Url":"/learn/mathematics-for-computer-vision?specialization=basics-in-computer-vision",
       "name":"Mathematics for computer vision",
       "Rating":"Mathematics for computer vision\n\nThe course is devoted to the systematization of the mathematical background of the students necessary for the successful mastering of educational disciplines in the field of computer vision. The course includes sections of mathematical analysis, probability theory, linear algebra.\n\nAim of the course:\n• Systematization of the mathematical background\n• Preparation for the use of mathematical knowledge in the professional activities of a specialist in the field of\ncomputer vision.\nPractical Learning Outcomes expected:\n• Mastering practical skills in mathematics\n• The solution of mathematical problems that are encountered in the practical work of a specialist in the field of computer vision.\n\nThis Course is part of HSE University Master of Computer Vision degree program. Learn more about the admission into the program and how your Coursera work can be leveraged if accepted into the program here  https://inlnk.ru/r381p.\n\nSHOW ALL ABOUT MATHEMATICS FOR COMPUTER VISION\nSHOW ALL"
    },
    {
       "Url":"/learn/2d-image-processing?specialization=basics-in-computer-vision",
       "name":"2D image processing",
       "Rating":"2D image processing\n\nThe course is devoted to the usage of computer vision libraries like OpenCV in 2d image processing. The course includes sections of image filtering and thresholding, edge/corner/interest point detection, local and global descriptors, video tracking.\n\nAim of the course:\n•\tLearning the main algorithms of traditional image processing\n•\tThorough understanding of benefits and limitations of traditional image processing\n\nPractical Learning Outcomes expected:\n•\tMastering programming skills of image processing with computer vision libraries\n\nThis Course is part of HSE University Master of Computer Vision degree program. Learn more about the admission into the program and how your Coursera work can be leveraged if accepted into the program here  https://inlnk.ru/r381p.\n\nSHOW ALL ABOUT 2D IMAGE PROCESSING\nSHOW ALL"
    },
    {
       "Url":"/learn/object-orient-programming?specialization=basics-in-computer-vision",
       "name":"Object-oriented programming",
       "Rating":"Object-oriented programming\n\nThis course is primarily intended for students with basic programming knowledge who want to develop their C++ programming skills and learn about OOP in the context of C++. You will understand the advantages and features of OOP over procedural programming. In addition, you will become familiar with the standard template library and CMake, a tool for building, testing, and packaging software.\n\nAim of the course:\n• Learning about OOP in the context of C++.\n• Familiarity with CMake, STL, OpenCV\n\nPractical Learning Outcomes expected: \n• Improving C ++ programming skills\n• Using CMake for project building\n• Experience with the OpenCV library.\n\nThis Course is part of HSE University Master of Computer Vision degree program. Learn more about the admission into the program and how your Coursera work can be leveraged if accepted into the program here  https://inlnk.ru/r381p.\n\nSHOW ALL ABOUT OBJECT-ORIENTED PROGRAMMING\nSHOW ALL"
    },
    "/specializations/privacy",
    {
       "Url":"/learn/history-privacy-laws?specialization=privacy",
       "name":"Privacy in the Western World",
       "Rating":"Privacy in the Western World\n4.5\nstars\n171 ratings\n•\n32 reviews\n\nWelcome to this course about privacy, \n\nWe are thrilled to see that you are interested and will provide you with a comprehensive study of this intriguiging subject. We hope this course will enthuse you to look further into privacy and personal data regulation. Especially in the light of recent events it becomes more important to know about your (alleged!?) rights and freedoms. \n\nAfter showing you a number of interesting examples of privacy in recent events, this course continues to provide you with an historic introduction, and varying cases and court decisions. It will guide you through the cultural and legal changes in perception of privacy over time. Sometimes with a more technological perspective. Notably, in the Western world differences have accumulated over time and the differences between the USA and Europe will be explained extensively in the follow-up courses. \n\nThrough video lectures and quizzes we endeavor to build a solid foundation for you to construct a well-founded opinion on privacy. Last but not least we sincerely hope you enjoy the course! \n\nProf.mr.dr. Jan Smits\n\nSHOW ALL ABOUT PRIVACY IN THE WESTERN WORLD\nSHOW ALL"
    },
    {
       "Url":"/learn/privacy-laws-us?specialization=privacy",
       "name":"Privacy in the USA",
       "Rating":"Privacy in the USA\n4.4\nstars\n36 ratings\n•\n11 reviews\n\nAfter having followed Privacy in the Western world you have become acquainted with the overall global legal system and the origins of privacy as a concept as well as privacy as a (human) right. This course deals with the American legal system to protect privacy.\n\nIn the USA privacy is protected through different legal concepts. Constitutional protection through the 4th Amendment plays a crucial role in protecting the US citizen against unjust governmental intrusion. As part of a myriad of consumer protection laws (e.g. health, financial) personal data is also protected. And last but not least there are a number of specific laws dealing with the (privacy) protection of all sorts of communications, such as mobile telephony, e-mail, online searches, etc. \n\nThe course deals with the main legal concepts in such a way that the learner will, after having successfully completed the course, be able to follow the legal developments in the USA. \n\nWe hope you enjoy the course!\n\nSHOW ALL ABOUT PRIVACY IN THE USA\nSHOW ALL"
    },
    {
       "Url":"/learn/privacy-eu?specialization=privacy",
       "name":"Privacy in Europe",
       "Rating":"Privacy in Europe\n4.5\nstars\n45 ratings\n•\n10 reviews\n\nAfter having followed Privacy in the Western world you have become acquainted with the overall global legal system and the origins of privacy as a concept as well as privacy as a (human) right. This course deals with the European legal system to protect privacy. European privacy protection is based upon human rights treaties, both on a European level as well global level such as, e.g. the UN Declaration on Human Rights. This course outlines and deals with these human rights treaties as well as with the specific rules and regulations that govern day to day privacy protection in Europe. \n\nThe course deals with how the European cooperation came into being after the devastating effects of World War II. Economic cooperation was deemed necessary to prevent another war. From economic cooperation other issues became part of the negotiations, and to this day more and more policy fields have become part of the European cooperation. Dealing with and having respect for different human rights is paramount in this cooperation. And privacy protection and regulation has become an increasingly important subject that has attracted a lot of global attention. \n\nThe course deals with the different legal elements that have played an important role into grabbing in legal terms the notion of privacy and how to legally protect it. The rules that enable the exchange of personal data between the USA and Europe is being dealt with. It also deals with the constituting legal elements that have become part of the General Data Protection Regulation (GDPR). \n\nAfter successful completion of the course you will have sufficient baggage to know about the important legal elements and historical background on the coming into being of European privacy protection. I wish you a lot of success with following the course.\n\nSHOW ALL ABOUT PRIVACY IN EUROPE\nSHOW ALL"
    },
    {
       "Url":"/learn/standardisation?specialization=privacy",
       "name":"Standardisation & Technology",
       "Rating":"Standardisation & Technology\n4.5\nstars\n25 ratings\n•\n5 reviews\n\nWelcome to the course standardisation and technology! \n\nDo you already know what standards are? Could you image a world without standards? It is certainly not easy to visualize a world without standards and the huge importance of standards is often underestimated in our society. That is because such a vast amount are common to us and have been for ages. We don’t even realise they are standards anymore. \n\nWe are excited to see you join and explore the world of standards that goes unnoticed by so many! First we visit historic examples of standards and see that even Before Christ standards were ever present. But since then standards have grown and evolved alongside societies and we need to discuss the fundamentals of standards and standard setting. \n\nNowadays technology is rapidly advancing and standards play an ever increasing role. Have you ever wondered what happens under the hood of your mobile phone? How are we able to orchestrate something so huge as the internet without technical agreements and protocols, without standards? We take a look at the organisations that develop and maintain these standards and even take a brief glimpse in the future of this ever evolving field! \n\nEach week video lectures and reading material according to the bibliography in in the introduction will be provided. Practice tests will help you to prepare for the graded assessment at the end of each week. \n\nGood luck and we hope you enjoy the course!\n\nSHOW ALL ABOUT STANDARDISATION & TECHNOLOGY\nSHOW ALL"
    },
    {
       "Url":"/learn/privacy-capstone?specialization=privacy",
       "name":"Privacy & Standardisation Capstone",
       "Rating":"Privacy & Standardisation Capstone\n\nWelcome to the capstone on the specialisation on Privacy & Standardisation. This capstone will build on the knowledge you obtained in the courses: Standardisation & Technology, Privacy in the Western World, Privacy in the USA and Privacy in Europe. The capstone will help you build a comprehensive opinion and it will challenge you in all areas of present-day privacy protection. The assignments invite you to use and revisit the material of all the courses. This capstone will link historic milestones to current limitations and offer you a journey through jurisdictions and technological fields alike. \n\nWhereas in the previous courses you were assessed by quizzes, the capstone will require you to carefully consider all you have learned so far and detail your opinion. The assessment in this course will mainly be done by in-depth assignments. Use the few practice exercises well to give you a head start in the graded assignments!\n\nSHOW ALL ABOUT PRIVACY & STANDARDISATION CAPSTONE\nSHOW ALL"
    },
    "/specializations/introduction-to-blockchain",
    {
       "Url":"/learn/blockchain-evolution-and-technology-concepts?specialization=introduction-to-blockchain",
       "name":"Blockchain Evolution and Technology Concepts",
       "Rating":"Blockchain Evolution and Technology Concepts\n4.7\nstars\n67 ratings\n•\n14 reviews\n\nThis specialization offers the latest developments in blockchain technology through a highly engaging learning experience with animated video components and intuitive course flow to maximize your knowledge retention."
    },
    {
       "Url":"/learn/blockchain-opportunities-beyond-crypto-assets?specialization=introduction-to-blockchain",
       "name":"Blockchain Opportunities Beyond Crypto Assets",
       "Rating":"Blockchain Opportunities Beyond Crypto Assets\n4.7\nstars\n42 ratings\n•\n8 reviews\n\nThis specialization offers the latest developments in blockchain technology through a highly engaging learning experience with animated video components and intuitive course flow to maximize your knowledge retention."
    },
    {
       "Url":"/learn/blcf20b?specialization=introduction-to-blockchain",
       "name":"Understanding, Using, and Securing Crypto and Digital Assets",
       "Rating":"Understanding, Using, and Securing Crypto and Digital Assets\n4.8\nstars\n36 ratings\n•\n5 reviews\n\nThis specialization offers the latest developments in blockchain technology through a highly engaging learning experience with animated video components and intuitive course flow to maximize your knowledge retention."
    },
    "/specializations/precalculus-data-modelling",
    {
       "Url":"/learn/precalculus-relations-functions?specialization=precalculus-data-modelling",
       "name":"Precalculus: Relations and Functions",
       "Rating":"Precalculus: Relations and Functions\n4.6\nstars\n86 ratings\n•\n28 reviews\n\nThis course helps to build the foundational material to use mathematics as a tool to model, understand, and interpret the world around us.  This is done through studying functions, their properties, and applications to data analysis.  Concepts of precalculus provide the set of tools for the beginning student to begin their scientific career, preparing them for future science and calculus courses. This course is designed for all students, not just those interested in further mathematics courses.  Students interested in the natural sciences, computer sciences, psychology, sociology, or similar will genuinely benefit from this introductory course, applying the skills learned to their discipline to analyze and interpret their subject material.  Students will be presented with not only new ideas, but also new applications of an old subject. Real-life data, exercise sets, and regular assessments help to motivate and reinforce the content in this course, leading to learning and mastery.\n\nSHOW ALL ABOUT PRECALCULUS: RELATIONS AND FUNCTIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/precalculus-periodic-functions?specialization=precalculus-data-modelling",
       "name":"Precalculus: Periodic Functions",
       "Rating":"Precalculus: Periodic Functions\n4.7\nstars\n35 ratings\n•\n11 reviews\n\nThis course helps to build the foundational material to use mathematics as a tool to model, understand, and interpret the world around us.  This is done through studying functions, their properties, and applications to data analysis.  Concepts of precalculus provide the set of tools for the beginning student to begin their scientific career, preparing them for future science and calculus courses. This course is designed for all students, not just those interested in further mathematics courses.  Students interested in the natural sciences, computer sciences, psychology, sociology, or similar will genuinely benefit from this introductory course, applying the skills learned to their discipline to analyze and interpret their subject material.  Students will be presented with not only new ideas, but also new applications of an old subject. Real-life data, exercise sets, and regular assessments help to motivate and reinforce the content in this course, leading to learning and mastery.\n\nSHOW ALL ABOUT PRECALCULUS: PERIODIC FUNCTIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/precalculus-mathematical-modelling?specialization=precalculus-data-modelling",
       "name":"Precalculus: Mathematical Modeling",
       "Rating":"Precalculus: Mathematical Modeling\n4.4\nstars\n23 ratings\n•\n13 reviews\n\nThis course helps to build the foundational material to use mathematics as a tool to model, understand, and interpret the world around us.  This is done through studying functions, their properties, and applications to data analysis.  Concepts of precalculus provide the set of tools for the beginning student to begin their scientific career, preparing them for future science and calculus courses. This course is designed for all students, not just those interested in further mathematics courses.  Students interested in the natural sciences, computer sciences, psychology, sociology, or similar will genuinely benefit from this introductory course, applying the skills learned to their discipline to analyze and interpret their subject material.  Students will be presented with not only new ideas, but also new applications of an old subject. Real-life data, exercise sets, and regular assessments help to motivate and reinforce the content in this course, leading to learning and mastery.\n\nSHOW ALL ABOUT PRECALCULUS: MATHEMATICAL MODELING\nSHOW ALL"
    },
    "/specializations/integral-calculus-data-modeling",
    {
       "Url":"/learn/calculus-through-data-and-modelling-series-and-integrals?specialization=integral-calculus-data-modeling",
       "name":"Calculus through Data & Modelling: Series and Integration",
       "Rating":"Calculus through Data & Modelling: Series and Integration\n5.0\nstars\n10 ratings\n•\n1 reviews\n\nThis course continues your study of calculus by introducing the notions of series, sequences, and integration.  These foundational tools allow us to develop the theory and applications of the second major tool of calculus: the integral.  Rather than measure rates of change, the integral provides a means for measuring the accumulation of a quantity over some interval of input values.  This notion of accumulation can be applied to different quantities, including money, populations, weight, area, volume, and air pollutants.  The concepts in this course apply to many other disciplines outside of traditional mathematics. Through projects, we will apply the tools of this course to analyze and model real world data, and from that analysis give critiques of policy. \n\nFollowing the pattern as with derivatives, several important methods for calculating accumulation are developed. Our course begins with the study of the deep and significant result of the Fundamental Theorem of Calculus, which develops the relationship between the operations of differentiation and integration. If you are interested in learning more advanced mathematics, this course is the right course for you.\n\nSHOW ALL ABOUT CALCULUS THROUGH DATA & MODELLING: SERIES AND INTEGRATION\nSHOW ALL"
    },
    {
       "Url":"/learn/calculus-through-data-and-modelling-techniques-of-integration?specialization=integral-calculus-data-modeling",
       "name":"Calculus through Data & Modelling: Techniques of Integration",
       "Rating":"Calculus through Data & Modelling: Techniques of Integration\n\nIn this course, we build on previously defined notions of the integral of a single-variable function over an interval. Now, we will extend our understanding of integrals to work with functions of more than one variable. First, we will learn how to integrate a real-valued multivariable function over different regions in the plane. Then, we will introduce vector functions, which assigns a point to a vector. This will prepare us for our final course in the specialization on vector calculus. Finally, we will introduce techniques to approximate definite integrals when working with discrete data and through a peer reviewed project on, apply these techniques real world problems.\n\nSHOW ALL ABOUT CALCULUS THROUGH DATA & MODELLING: TECHNIQUES OF INTEGRATION\nSHOW ALL"
    },
    {
       "Url":"/learn/calculus-through-data-and-modelling-integration-applications?specialization=integral-calculus-data-modeling",
       "name":"Calculus through Data & Modelling: Integration Applications",
       "Rating":"Calculus through Data & Modelling: Integration Applications\n\nThis course continues your study of calculus by focusing on the applications of integration. The applications in this section have many common features.  First, each is an example of a quantity that is computed by evaluating a definite integral.  Second, the formula for that application is derived from Riemann sums.  \n\nRather than measure rates of change as we did with differential calculus, the definite integral allows us to measure the accumulation of a quantity over some interval of input values.  This notion of accumulation can be applied to different quantities, including money, populations, weight, area, volume, and air pollutants.  The concepts in this course apply to many other disciplines outside of traditional mathematics.\n\nWe will expand the notion of the average value of a data set to allow for infinite values, develop the formula for arclength and curvature, and derive formulas for velocity, acceleration, and areas between curves.  Through examples and projects, we will apply the tools of this course to analyze and model real world data.\n\nSHOW ALL ABOUT CALCULUS THROUGH DATA & MODELLING: INTEGRATION APPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/calculus-through-data-and-modelling-vector-calculus?specialization=integral-calculus-data-modeling",
       "name":"Calculus through Data & Modelling: Vector Calculus",
       "Rating":"Calculus through Data & Modelling: Vector Calculus\n\nThis course continues your study of calculus by focusing on the applications of integration to vector valued functions, or vector fields. These are functions that assign vectors to points in space, allowing us to develop advanced theories to then apply to real-world problems.  We define line integrals, which can be used to fund the work done by a vector field.  We culminate this course with Green's Theorem, which describes the relationship between certain kinds of line integrals on closed paths and double integrals. In the discrete case, this theorem is called the Shoelace Theorem and allows us to measure the areas of polygons. We use this version of the theorem to develop more tools of data analysis through a peer reviewed project.\n\nUpon successful completion of this course, you have all the tools needed to master any advanced mathematics, computer science, or data science that builds off of the foundations of single or multivariable calculus.\n\nSHOW ALL ABOUT CALCULUS THROUGH DATA & MODELLING: VECTOR CALCULUS\nSHOW ALL"
    },
    "/specializations/cyber-incident-response",
    {
       "Url":"/learn/incident-response?specialization=cyber-incident-response",
       "name":"Cyber Incident Response",
       "Rating":"Cyber Incident Response\n4.6\nstars\n31 ratings\n•\n6 reviews\n\nThe Cyber Incident Response course will give students an understanding of how incidents are responded to at a high level, as well as allow them to build important technical skills through the hands-on labs and projects.\n\nThis course starts with a high-level discussion of what happens at each phase of responding to an incident, followed by a technical deep dive into some of the more exciting parts of memory, network, and host analysis and forensics. This course is for anyone wishing to apply learned forensics and offensive knowledge such as ethical hacking to the incident response process.\n\nSHOW ALL ABOUT CYBER INCIDENT RESPONSE\nSHOW ALL"
    },
    {
       "Url":"/learn/stages-of-incident-response?specialization=cyber-incident-response",
       "name":"Stages of Incident Response",
       "Rating":"Stages of Incident Response\n\nThe Cyber Incident Response course will give students an understanding of how incidents are responded to at a high level, as well as allow them to build important technical skills through the hands-on labs and projects.\n\nThis course starts with a high-level discussion of what happens at each phase of responding to an incident, followed by a technical deep dive into some of the more exciting parts of memory, network, and host analysis and forensics. This course is for anyone wishing to apply learned forensics and offensive knowledge such as ethical hacking to the incident response process.\n\nSHOW ALL ABOUT STAGES OF INCIDENT RESPONSE\nSHOW ALL"
    },
    {
       "Url":"/learn/technical-deep-dive-with-incident-response-tools?specialization=cyber-incident-response",
       "name":"Technical Deep Dive with Incident Response Tools",
       "Rating":"Technical Deep Dive with Incident Response Tools\n5.0\nstars\n13 ratings\n\nThe Cyber Incident Response course will give students an understanding of how incidents are responded to at a high level, as well as allow them to build important technical skills through the hands-on labs and projects.\n\nThis course starts with a high-level discussion of what happens at each phase of responding to an incident, followed by a technical deep dive into some of the more exciting parts of memory, network, and host analysis and forensics. This course is for anyone wishing to apply learned forensics and offensive knowledge such as ethical hacking to the incident response process.\n\nSHOW ALL ABOUT TECHNICAL DEEP DIVE WITH INCIDENT RESPONSE TOOLS\nSHOW ALL"
    },
    "/specializations/solving-complex-problems",
    {
       "Url":"/learn/analysing-complexity?specialization=solving-complex-problems",
       "name":"Analysing Complexity",
       "Rating":"Analysing Complexity\n4.5\nstars\n127 ratings\n•\n39 reviews\n\nThe first course of the specialization ANALYZING COMPLEXITY will teach you what unifying patterns lie at the core of all complex problems. It advances your knowledge of your own field by teaching you to look at it in new ways. \n\nANALYZING COMPLEXITY is constructed in the following way: Week I. \"What is Complexity?\" - What is at the core of all complex problems Week II. \"Complex Physical Systems\" - What complex problems all have in common in the inanimate world Week III. \"Complex Adaptive Systems\" - What complex problems all have in common in nature Week IV. \"Complex Cultural Systems\" - What complex problems all have in common in human society Week V. \"Complexity, Fragility, and Breakdown\" - Why complex problems arise Week VI. \"Complexity in the Anthropocene\" - What complex problems face us today\n\nSHOW ALL ABOUT ANALYSING COMPLEXITY\nSHOW ALL"
    },
    {
       "Url":"/learn/evaluating-problems?specialization=solving-complex-problems",
       "name":"Evaluating Problems",
       "Rating":"Evaluating Problems\n4.7\nstars\n38 ratings\n•\n10 reviews\n\nThe second course of the specialization EVALUATING PROBLEMS will show you how humans think and how to utilize different disciplinary approaches to tackle problems more effectively.  It advances your knowledge of your own field by teaching you to look at it in new ways. \n\nEVALUATING PROBLEMS is constructed in the following way: Week I. “Thinking about Thinking” – How problem solving evolved in nature, how the mechanics of our brains work, and the psychological biases that can emerge when we think. Week II. “Philosophy, Science, and Problem Solving” – How humans have historically approached problem solving, from ancient times to the present. Week III. “Approaching Problems in the Natural Sciences” – How people in the natural sciences deconstruct problems. Week IV. “Statistics and Problem Solving” – How statistics can be used to evaluate problems and think critically. Week V. “Approaching Problems in the Humanities” – How people in the social sciences and humanities deconstruct problems. Week VI. “Evaluating the Anthropocene” – How to evaluate the problems of the Anthropocene.\n\nSHOW ALL ABOUT EVALUATING PROBLEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/creating-innovation?specialization=solving-complex-problems",
       "name":"Creating Innovation",
       "Rating":"Creating Innovation\n4.8\nstars\n38 ratings\n•\n11 reviews\n\nThe third course of the specialization CREATING INNOVATION will teach you what is at the core of all innovations that solve complex problems and how to foster methods to make big breakthroughs possible. It advances your knowledge of your own field by teaching you to look at it in new ways.\n\nCREATING INNOVATION is constructed in the following way: Week I. “What is Innovation?” – What lies at the core of all innovations. Week II. “The Evolution of Human Creativity” – How humans developed the ability to innovate and think creatively. Week III. “Innovation in a Complex Global Network” – How innovations emerge from human networks. Week IV. “Planning Innovation” – How organisations seek out and create the right conditions for new breakthroughs. Week V. “Market Innovation” – What makes innovations more likely to emerge in a market setting. Week VI. “Innovation in the Anthropocene” – How innovations are crucial to meet the problems of the 21st century.\n\nSHOW ALL ABOUT CREATING INNOVATION\nSHOW ALL"
    },
    {
       "Url":"/learn/solving-complex-problems?specialization=solving-complex-problems",
       "name":"Solving Complex Problems Capstone",
       "Rating":"Solving Complex Problems Capstone\n4.5\nstars\n17 ratings\n•\n3 reviews\n\nFrom the very start of the specialization, your assignments will be geared toward tackling a complex issue of your choice that you face in your career path, industry, or field. Each phase of the course builds up to a briefing paper that analyzes, evaluates, and attempts to solve a highly complex problem. Not only does this course teach you a skill set, but it puts you further down the road in understanding the problems of your chosen field. It advances your knowledge of your own field by teaching you to look at it in new ways. This is the CAPSTONE where the scaffolding of our problem solving and innovation skills will bear fruit in a series of preparatory assignments to make your briefing paper as effective as possible.\n\nSHOW ALL ABOUT SOLVING COMPLEX PROBLEMS CAPSTONE\nSHOW ALL"
    },
    "/specializations/fintech-startups-emerging-markets",
    {
       "Url":"/learn/financial-regulation?specialization=fintech-startups-emerging-markets",
       "name":"Financial Regulation in Emerging Markets and the Rise of Fintech Companies",
       "Rating":"Financial Regulation in Emerging Markets and the Rise of Fintech Companies\n4.6\nstars\n116 ratings\n•\n25 reviews\n\nThis course gives an overview of the changing regulatory environment since the 1997 Asian and 2008 global financial crisis. Following these two major crises, governments around the globe enacted a set of far-reaching new financial regulations that are aimed towards safeguarding financial stability. However, banks find it increasingly difficult to be profitable in this new regulatory environment. Technology, at the same time, has taken important leaps forward with the emergence of sophisticated models of artificial intelligence and the invention of the blockchain. These two developments fuel the emergence of fintech companies around the world. \n\nThis course discusses fintech regulation in emerging markets using case studies from China and South Africa. The course pays special attention to the socioeconomic environment in emerging markets, as well as to political risk as a major source of uncertainty for fintech entrepreneurs. Peer-to-peer lending and remittances are used as leading examples for fintech innovation in emerging markets.\n\nSHOW ALL ABOUT FINANCIAL REGULATION IN EMERGING MARKETS AND THE RISE OF FINTECH COMPANIES\nSHOW ALL"
    },
    {
       "Url":"/learn/entrepreneurs-blockchain-technology?specialization=fintech-startups-emerging-markets",
       "name":"How Entrepreneurs in Emerging Markets can master the Blockchain Technology",
       "Rating":"How Entrepreneurs in Emerging Markets can master the Blockchain Technology\n4.5\nstars\n28 ratings\n•\n9 reviews\n\nIn this course, you will gain a thorough understanding of the blockchain and distributed ledger technologies, including an introduction to the necessary foundations in cryptography. The course will discuss blockchain as a distributed ledger and introduce distributed consensus as a mechanism to maintain the integrity of the blockchain. The other revolutionary technologies that are changing the world as we speak are artificial intelligence and machine learning. You will learn about the three major types of AI algorithms: supervised and unsupervised machine learning, as well as reinforcement learning. \n\nYou will learn about the application of blockchain outside of finance. In particular, how blockchain fundamentally changes the way we deal with our personal data. You will see how the web 2.0 model--where big companies like facebook and google collect as much of your personal data as possible to sell it to third parties--is coming to an end. The new web 3.0 is decentralized and uses the power of the blockchain to put users in full control over their own data. Finally, we will look at the benefits and considerations of blockchain and whether blockchain is the right solution for your problem.\n\n#UCTFintech\n\nSHOW ALL ABOUT HOW ENTREPRENEURS IN EMERGING MARKETS CAN MASTER THE BLOCKCHAIN TECHNOLOGY\nSHOW ALL"
    },
    {
       "Url":"/learn/building-fintech-startups?specialization=fintech-startups-emerging-markets",
       "name":"Building Fintech Startups in Emerging Markets",
       "Rating":"Building Fintech Startups in Emerging Markets\n4.5\nstars\n13 ratings\n•\n4 reviews\n\nStarting a small business in an emerging market can be very rewarding. Many of entrepreneurship opportunities in emerging markets arise out of necessity, or the drive to solve a real need or a social problem. Thus emerging markets often offer huge opportunities for disruptive innovation. Entrepreneurship has contributed to economic growth and been able to respond to social problems, helping some communities prosper. With the rise of fintech, financial solutions using technologies such as the cloud, blockchain and machine learning have by-passed or partnered with established financial institutions to serve new markets. \n\nThis course takes us through the basics from “What is entrepreneurship?” to applying commonly used business planning tools, such as design thinking and business model canvas. Design thinking is a methodology that encourages startups to focus on user-centric products and services. There are also insights on topics like regulation, intellectual property, funding and growth that are important for startups.\n\nI’ve invited along experts who teach and support entrepreneurs. This includes some really interesting people in various stages of their start-up business development. We will be talking with Zlto (a digital currency), Yoco (mobile payments), Proof of Steak (alternative asset investment) and Kuba (a digital ‘middleman’ for small businesses) to name a few. \n\nAs we will learn, there is no such thing as being ‘ready’ or, choosing the ‘perfect time’ to become an entrepreneur. You are already one, so let’s take the next steps on your entrepreneurial journey by joining your peers around the world on this course. This course is for everyone, and not only those interested in only fintech.\n\nSHOW ALL ABOUT BUILDING FINTECH STARTUPS IN EMERGING MARKETS\nSHOW ALL"
    },
    {
       "Url":"/learn/startup-fintech-capstone?specialization=fintech-startups-emerging-markets",
       "name":"Capstone Course: Start Up Your Fintech Future",
       "Rating":"Capstone Course: Start Up Your Fintech Future\n\nThis is the final course in the Fintech Emerging Markets specialization. This course assumes you have completed the first three courses of this specialization. For this capstone project, you will need to prepare a business model canvas and pitch for your startup. This will involve identifying opportunities for a new service, product, or application, assessing the regulatory context and proposing appropriate fintech or non-fintech technologies. The three main parts of the business plan are to (i) the business challenge statement - identifying opportunities for new services and the customers (ii) a business model canvas, which will include a feasibility analysis that includes assessing the regulatory context, and (iii) presenting a video pitch which includes developing a pitch deck.\n\nSHOW ALL ABOUT CAPSTONE COURSE: START UP YOUR FINTECH FUTURE\nSHOW ALL"
    },
    "/specializations/healthcare-it",
    {
       "Url":"/learn/healthcare-it-support-staff?specialization=healthcare-it",
       "name":"The Critical Role of IT Support Staff in Healthcare",
       "Rating":"The Critical Role of IT Support Staff in Healthcare\n4.7\nstars\n172 ratings\n•\n51 reviews\n\nThis is a very exciting time to be exploring a career in Health IT Support! In this introductory course, you’ll learn about various roles in IT support that are common in healthcare. IT support staff play critical roles in many different healthcare venues. In addition to helping clinics, hospitals, and emergency rooms, you may end up providing support in a skilled nursing facility, ambulatory surgical center, virtual care setting, or even a patient’s home! On any given day, you may interact with nurses, physicians, pharmacists, physical therapists, social workers, other allied health professionals, patients or caregivers. Each of these individuals rely on IT support specialists to help them maintain a high reliability healthcare organization. As you learn about what makes Health IT unique, we hope you find inspiration in the stories shared by some of our very own IT support staff at Johns Hopkins. They’ll talk to you about the most common problems they help resolve as well as the complexity and range of issues that arise. Whether you dream of being an end-user computer support specialist, working at a healthcare help desk, or rising to an analyst role, we’re thrilled that you are embarking upon this journey. Welcome again!\n\nSHOW ALL ABOUT THE CRITICAL ROLE OF IT SUPPORT STAFF IN HEALTHCARE\nSHOW ALL"
    },
    {
       "Url":"/learn/health-it-fundamentals?specialization=healthcare-it",
       "name":"Health Information Technology Fundamentals",
       "Rating":"Health Information Technology Fundamentals\n4.8\nstars\n116 ratings\n•\n23 reviews\n\nIn this course you will receive an overview of the health IT ecosystem with a specific focus on the role of electronic health records (EHRs). You’ll be introduced to the factors that contributed to the move from paper records to digitized records and who the most common vendors are. We’ll go over features of EHRs such as computerized provider order entry, clinical decision support, documentation capabilities, and medication reconciliation. Like a physician’s stethoscope, the EHR has become an important tool in healthcare delivery and plays a part throughout the patient’s journey. You’ll go through each of the steps from patient scheduling, to front desk registration, outpatient visits, emergency room encounters, and inpatient admissions.   \n\nDuring the course, we’ll also cover examples of how technical issues related to the EHR can be as simple as problems with logging or password resets. But how they can also be more complex related to alerts that are firing and the display of information. Although some of those challenges are beyond the scope of the IT support staff, having familiarity with the scope of potential problems and the broader EHR landscape is important. This course also includes an introduction to database architecture, servers, and interfaces. We wrap up by discussing the importance of training end-users on healthcare technology and the way in which effective change management strategies are crucial.\n\nSHOW ALL ABOUT HEALTH INFORMATION TECHNOLOGY FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/healthcare-it-operations-patient-safety?specialization=healthcare-it",
       "name":"Operations and Patient Safety for Healthcare IT Staff",
       "Rating":"Operations and Patient Safety for Healthcare IT Staff\n4.8\nstars\n57 ratings\n•\n5 reviews\n\nNow that you've been introduced to the world of Health IT and the important role played by electronic health records (EHRs), we'll focus on other technologies that play a role in maintaining ongoing operations in healthcare. Telemedicine, patient portals, barcode scanners, printers, and medical devices are just some of the technologies that impact providers and patients. As an IT support specialist, you’ll be asked to troubleshoot issues with a wide variety of tools. You'll see a scenario with a medical device installation where issues related to IP addresses, networking, and MAC addresses come up.  \n\nWhen there are disruptions in technology, you’ll need to use training, tip sheets, and problem-solving skills to determine how best to handle the situation. Supporting a high reliability organization means being familiar with the existing processes and protocols for handling calls, creating tickets, escalating issues, and resolving matters. We’ll introduce you to the concept of self-service tickets and the guidance given to hospital staff on how to submit a ticket. You’ll learn about the different priority levels for tickets as well as the tiers of IT support. When a call comes in, there are some important resources you’ll need to access in order to troubleshoot the problem. These can range from standard question templates to tip sheets to complex matrices and knowledge base articles (KBAs). Having these tools in your arsenal is essential as a Health IT support specialist. We‘ll also cover the JIRA process, the need for excellent documentation, and ways in which requests for change are communicated.\n\nSHOW ALL ABOUT OPERATIONS AND PATIENT SAFETY FOR HEALTHCARE IT STAFF\nSHOW ALL"
    },
    {
       "Url":"/learn/healthcare-data-security?specialization=healthcare-it",
       "name":"Healthcare Data Security, Privacy, and Compliance",
       "Rating":"Healthcare Data Security, Privacy, and Compliance\n4.8\nstars\n96 ratings\n•\n17 reviews\n\nIn the final course of the Healthcare IT Support program, we will focus on the types of healthcare data that you need to be aware, complexities of security and privacy within healthcare, and issues related to compliance and reporting. As a health IT support specialist, you’ll be exposed to different types of data sources and data elements that are utilized in healthcare. It’s important for you to understand the basic language of healthcare data and for you to recognize the sensitive nature of protected health information (PHI). Maintaining data privacy and security is everyone’s responsibility, including IT support staff! We’ll go into detail about HIPAA and the risks associated with security breaches, ransomware and phishing. We’ll go into detail about some of the key laws and regulations specific to healthcare and the importance of compliance with them. \n\nYou'll leave this course well versed on the Stark Law, the Joint Commission and the purpose of quality measures.  \n\nWe wrap up the Healthcare IT Support certificate with tips on job interviews, skills that can make you standout, and words of advice on the endless possibilities in this dynamic and growing field. Make sure you talk to others who’ve been there before about the process of being hired at a large health system. Be rest assured that you’ll receive training when you start a new role, and you might even be partnered with someone else for the first few weeks as you get onboarded. Remember, this is not the end--rather, it’s just the beginning of the next step in your journey!\n\nSHOW ALL ABOUT HEALTHCARE DATA SECURITY, PRIVACY, AND COMPLIANCE\nSHOW ALL"
    }
 ]