[
    "/specializations/leadership-development-engineers",
    {
       "Url":"/learn/self-awareness?specialization=leadership-development-engineers",
       "name":"Self Awareness and the Effective Leader",
       "Rating":"Self Awareness and the Effective Leader\n4.7\nstars\n540 ratings\n•\n110 reviews\n\nPart of being an effective leader is learning how to play to your strengths and overcome characteristics that don't lend to good leadership practices. During the course, you will examine your own strengths and learn ways to use them in a leadership role. Learn to manage stress and solve problems creatively. Throughout the course, you will also build a tool kit of useful techniques that you can begin using right away in your engineering career.\n\nThis course is designed for engineers who are interested in and have the desire to advance into leadership and management roles. You don't need any leadership experience to do well in this course. We ask you to reflect on your personal experiences pretty often,, so some work experience will help you in that aspect, but we hope that most of what you learn here will be applicable to many areas of your life.\n\nSHOW ALL ABOUT SELF AWARENESS AND THE EFFECTIVE LEADER\nSHOW ALL"
    },
    {
       "Url":"/learn/relationship-management?specialization=leadership-development-engineers",
       "name":"Relationship Management",
       "Rating":"Relationship Management\n4.8\nstars\n268 ratings\n•\n66 reviews\n\nTo be a successful engineer, you must work and play well with others. This course focuses on developing the skills you will need to build and sustain professional relationships and networks. Learn to coach and mentor others, manage conflict and build power and influence in the workplace."
    },
    {
       "Url":"/learn/leadership-development-planning?specialization=leadership-development-engineers",
       "name":"Personal Leadership Development Planning and Leading High Performing Teams",
       "Rating":"Personal Leadership Development Planning and Leading High Performing Teams\n4.7\nstars\n164 ratings\n•\n49 reviews\n\nAn actionable leadership improvement plan enables you to leverage strengths and close the gaps on weaknesses. In this course, you will build your own plan that you can put into practice immediately and realize goals within the next two years. It lays the foundation for an evergreen process of selection and prioritization of skills, and action planning for sustained leadership development.\n\nSHOW ALL ABOUT PERSONAL LEADERSHIP DEVELOPMENT PLANNING AND LEADING HIGH PERFORMING TEAMS\nSHOW ALL"
    },
    "/specializations/python-data-products-for-predictive-analytics",
    {
       "Url":"/learn/basic-data-processing-visualization-python?specialization=python-data-products-for-predictive-analytics",
       "name":"Basic Data Processing and Visualization",
       "Rating":"Basic Data Processing and Visualization\n4.3\nstars\n165 ratings\n•\n47 reviews\n\nThis is the first course in the four-course specialization Python Data Products for Predictive Analytics, introducing the basics of reading and manipulating datasets in Python. In this course, you will learn what a data product is and go through several Python libraries to perform data retrieval, processing, and visualization. \n\nThis course will introduce you to the field of data science and prepare you for the next three courses in the Specialization: Design Thinking and Predictive Analytics for Data Products, Meaningful Predictive Modeling, and Deploying Machine Learning Models. At each step in the specialization, you will gain hands-on experience in data manipulation and building your skills, eventually culminating in a capstone project encompassing all the concepts taught in the specialization.\n\nSHOW ALL ABOUT BASIC DATA PROCESSING AND VISUALIZATION\nSHOW ALL"
    },
    {
       "Url":"/learn/design-thinking-predictive-analytics-data-products?specialization=python-data-products-for-predictive-analytics",
       "name":"Design Thinking and Predictive Analytics for Data Products",
       "Rating":"Design Thinking and Predictive Analytics for Data Products\n4.5\nstars\n61 ratings\n•\n11 reviews\n\nThis is the second course in the four-course specialization Python Data Products for Predictive Analytics, building on the data processing covered in Course 1 and introducing the basics of designing predictive models in Python. In this course, you will understand the fundamental concepts of statistical learning and learn various methods of building predictive models. At each step in the specialization, you will gain hands-on experience in data manipulation and building your skills, eventually culminating in a capstone project encompassing all the concepts taught in the specialization.\n\nSHOW ALL ABOUT DESIGN THINKING AND PREDICTIVE ANALYTICS FOR DATA PRODUCTS\nSHOW ALL"
    },
    {
       "Url":"/learn/meaningful-predictive-modeling?specialization=python-data-products-for-predictive-analytics",
       "name":"Meaningful Predictive Modeling",
       "Rating":"Meaningful Predictive Modeling\n4.4\nstars\n45 ratings\n•\n9 reviews\n\nThis course will help us to evaluate and compare the models we have developed in previous courses. So far we have developed techniques for regression and classification, but how low should the error of a classifier be (for example) before we decide that the classifier is \"good enough\"? Or how do we decide which of two regression algorithms is better?\n\nBy the end of this course you will be familiar with diagnostic techniques that allow you to evaluate and compare classifiers, as well as performance measures that can be used in different regression and classification scenarios. We will also study the training/validation/test pipeline, which can be used to ensure that the models you develop will generalize well to new (or \"unseen\") data.\n\nSHOW ALL ABOUT MEANINGFUL PREDICTIVE MODELING\nSHOW ALL"
    },
    {
       "Url":"/learn/deploying-machine-learning-models?specialization=python-data-products-for-predictive-analytics",
       "name":"Deploying Machine Learning Models",
       "Rating":"Deploying Machine Learning Models\n3.6\nstars\n47 ratings\n•\n14 reviews\n\nIn this course we will learn about Recommender Systems (which we will study for the Capstone project), and also look at deployment issues for data products. By the end of this course, you should be able to implement a working recommender system (e.g. to predict ratings, or generate lists of related products), and you should understand the tools and techniques required to deploy such a working system on real-world, large-scale datasets.\n\nThis course is the final course in the Python Data Products for Predictive Analytics Specialization, building on the previous three courses (Basic Data Processing and Visualization, Design Thinking and Predictive Analytics for Data Products, and Meaningful Predictive Modeling). At each step in the specialization, you will gain hands-on experience in data manipulation and building your skills, eventually culminating in a capstone project encompassing all the concepts taught in the specialization.\n\nSHOW ALL ABOUT DEPLOYING MACHINE LEARNING MODELS\nSHOW ALL"
    },
    "/specializations/applied-crypto",
    {
       "Url":"/learn/crypto-info-theory?specialization=applied-crypto",
       "name":"Cryptography and Information Theory",
       "Rating":"Cryptography and Information Theory\n4.5\nstars\n331 ratings\n•\n59 reviews\n\nWelcome to Cryptography and Information Theory! \n\nThis course combines cryptography (the techniques for protecting information from unauthorized access) and information theory (the study of information coding and transfer). More specifically, the course studies cryptography from the information-theoretical perspectives and discuss the concepts such as entropy and the attacker knowledge capabilities, e.g., Kerckhoff's Principle. It also contrasts information-theoretic security and computational security to highlight the different train of thoughts that drive the cryptographic algorithmic construction and the security analyses.\n\nThis course is a part of the Applied Cryptography specialization.\n\nSHOW ALL ABOUT CRYPTOGRAPHY AND INFORMATION THEORY\nSHOW ALL"
    },
    {
       "Url":"/learn/symmetric-crypto?specialization=applied-crypto",
       "name":"Symmetric Cryptography",
       "Rating":"Symmetric Cryptography\n4.6\nstars\n203 ratings\n•\n39 reviews\n\nWelcome to Symmetric Cryptography! \n\nSymmetric cryptography relies on shared secret key to ensure message confidentiality, so that the unauthorized attackers cannot retrieve the message. The course describes substitution and transposition techniques, which were the bases for classical cryptography when the message is encoded in natural language such as English. Then, we build on product ciphers (using both substitution and transposition/permutation) to describe modern block ciphers and review the widely used cipher algorithms in DES, 3-DES, and AES. Lastly, we enable the use of block ciphers to support variable data length by introducing different modes of block cipher operations in ECB, CBC, CFB, OFB, and CTR modes.\n\nThis course is cross-listed and is a part of the two specializations, the Applied Cryptography specialization and the Introduction to Applied Cryptography specialization.\n\nSHOW ALL ABOUT SYMMETRIC CRYPTOGRAPHY\nSHOW ALL"
    },
    {
       "Url":"/learn/asymmetric-crypto?specialization=applied-crypto",
       "name":"Asymmetric Cryptography and Key Management",
       "Rating":"Asymmetric Cryptography and Key Management\n4.7\nstars\n210 ratings\n•\n28 reviews\n\nWelcome to Asymmetric Cryptography and Key Management! \n\nIn asymmetric cryptography or public-key cryptography, the sender and the receiver use a pair of public-private keys, as opposed to the same symmetric key, and therefore their cryptographic operations are asymmetric. This course will first review the principles of asymmetric cryptography and describe how the use of the pair of keys can provide different security properties. Then, we will study the popular asymmetric schemes in the RSA cipher algorithm and the Diffie-Hellman Key Exchange protocol and learn how and why they work to secure communications/access. Lastly, we will discuss the key distribution and management for both symmetric keys and public keys and describe the important concepts in public-key distribution such as public-key authority, digital certificate, and public-key infrastructure. This course also describes some mathematical concepts, e.g., prime factorization and discrete logarithm, which become the bases for the security of asymmetric primitives, and working knowledge of discrete mathematics will be helpful for taking this course; the Symmetric Cryptography course (recommended to be taken before this course) also discusses modulo arithmetic.\n\nThis course is cross-listed and is a part of the two specializations, the Applied Cryptography specialization and the Introduction to Applied Cryptography specialization.\n\nSHOW ALL ABOUT ASYMMETRIC CRYPTOGRAPHY AND KEY MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/cryptographic-hash-integrity-protection?specialization=applied-crypto",
       "name":"Cryptographic Hash and Integrity Protection",
       "Rating":"Cryptographic Hash and Integrity Protection\n4.5\nstars\n59 ratings\n•\n6 reviews\n\nWelcome to Cryptographic Hash and Integrity Protection! \n\nThis course reviews cryptographic hash functions in general and their use in the forms of hash chain and hash tree (Merkle tree). Building on hash functions, the course describes message authentication focusing on message authentication code (MAC) based on symmetric keys. We then discuss digital signatures based on asymmetric cryptography, providing security properties such as non-repudiation which were unavailable in symmetric-cryptography-based message authentication.\n\nThis course is a part of the Applied Cryptography specialization.\n\nSHOW ALL ABOUT CRYPTOGRAPHIC HASH AND INTEGRITY PROTECTION\nSHOW ALL"
    },
    "/specializations/data-driven-decision-making",
    {
       "Url":"/learn/data-driven-process-improvement?specialization=data-driven-decision-making",
       "name":"Data-Driven Process Improvement",
       "Rating":"Data-Driven Process Improvement\n4.4\nstars\n34 ratings\n•\n9 reviews\n\nBy the end of this course, learners are empowered to implement data-driven process improvement objectives at their organization. The course covers: the business case for IoT (Internet of Things), the strategic importance of aligning operations and performance goals, best practices for collecting data, and facilitating a process mapping activity to visualize and analyze a process’s flow of materials and information. Learners are prepared to focus efforts around business needs, evaluate what the organization should measure, discern between different types of IoT data and collect key performance indicators (KPIs) using IoT technology. Learners have the opportunity to implement process improvement objectives in a mock scenario and consider how the knowledge can be transferred to their own organizational contexts.\n\nMaterial includes online lectures, videos, demos, project work, readings and discussions. This course is ideal for individuals keen on developing a data-driven mindset that derives powerful insights useful for improving a company’s bottom line. It is helpful if learners have some familiarity with reading reports, gathering and using data, and interpreting visualizations. It is the first course in the Data-Driven Decision Making (DDDM) specialization. To learn more about the specialization, check out a video overview at  https://www.youtube.com/watch?v=Oi4mmeSWcVc&list=PLQvThJe-IglyYljMrdqwfsDzk56ncfoLx&index=11.\n\nSHOW ALL ABOUT DATA-DRIVEN PROCESS IMPROVEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/data-analyze-visualize?specialization=data-driven-decision-making",
       "name":"Data Analysis and Visualization",
       "Rating":"Data Analysis and Visualization\n4.4\nstars\n25 ratings\n•\n6 reviews\n\nBy the end of this course, learners are provided a high-level overview of data analysis and visualization tools, and are prepared to discuss best practices and develop an ensuing action plan that addresses key discoveries. It begins with common hurdles that obstruct adoption of a data-driven culture before introducing data analysis tools (R software, Minitab, MATLAB, and Python). Deeper examination is spent on statistical process control (SPC), which is a method for studying variation over time. The course also addresses do’s and don’ts of presenting data visually, visualization software (Tableau, Excel, Power BI), and creating a data story.              \n\nMaterial features online lectures, videos, demos, project work, readings and discussions. This course is ideal for individuals keen on developing a data-driven mindset that derives powerful insights useful for improving a company’s bottom line. It is helpful if learners have some familiarity with reading reports, gathering and using data, and interpreting visualizations. It is the second course in the Data-Driven Decision Making (DDDM) specialization. To learn more about the specialization, check out a video overview at  https://www.youtube.com/watch?v=Oi4mmeSWcVc&list=PLQvThJe-IglyYljMrdqwfsDzk56ncfoLx&index=11.\n\nSHOW ALL ABOUT DATA ANALYSIS AND VISUALIZATION\nSHOW ALL"
    },
    {
       "Url":"/learn/analytics-data-decisions?specialization=data-driven-decision-making",
       "name":"Applied Analytics and Data for Decision Making",
       "Rating":"Applied Analytics and Data for Decision Making\n\nBy the end of this course, learners are prepared to identify and test the best solutions for improving performance and integrating concepts from operational excellence methodologies for optimum data-driven decision making. The course begins with a focus on deciphering the root cause of problems through a variety of tools before determining and assessing best-fit solutions. Learners discover how to apply ISO, Lean and Six Sigma in the pursuit of aligning organizational operations data with performance standards. Hospitality, manufacturing and e-commerce case studies help illustrate how to build data literacy while ensuring privacy and data ethics measures are in place. \n\nMaterial features online lectures, videos, demos, project work, readings and discussions. This course is ideal for individuals keen on developing a data-driven mindset that derives powerful insights useful for improving a company’s bottom line. It is helpful if learners have some familiarity with reading reports, gathering and using data, and interpreting visualizations. It is the third course in the Data-Driven Decision Making (DDDM) specialization. To learn more about the specialization, check out a video overview at  https://www.youtube.com/watch?v=Oi4mmeSWcVc&list=PLQvThJe-IglyYljMrdqwfsDzk56ncfoLx&index=11.\n\nSHOW ALL ABOUT APPLIED ANALYTICS AND DATA FOR DECISION MAKING\nSHOW ALL"
    },
    "/specializations/homeland-security-cybersecurity",
    {
       "Url":"/learn/homeland-security-cybersecurity-connection?specialization=homeland-security-cybersecurity",
       "name":"Homeland Security & Cybersecurity Connection - It's Not About the Terrorists",
       "Rating":"Homeland Security & Cybersecurity Connection - It's Not About the Terrorists\n4.7\nstars\n323 ratings\n•\n92 reviews\n\nWelcome to Course 1 in CS4950, Homeland Security and Cybersecruity. In this course we examine the origins of homeland security and its connection with cybersecurity. Homeland security is about safeguarding the United States from domestic catastrophic destruction. Catastrophic destruction comes in two forms: natural and man-made. For most of history the man-made variety came in the form of warfare and required the combined resources of a nation state. All that changed March 20th, 1995. On that date, members of a quasi-religious cult in Japan attacked the Tokyo subway system using Sarin gas. It was the first deployment of a weapon of mass destruction my a non-state actor. The power of destruction once reserved to nation states was now available to small groups, even individuals. The incident was a wake up call for governments around the world. Defense establishments designed to keep rogue states in check were practically useless against non-state actors. Overnight, the number of potential enemies multiplied a hundred, maybe even a thousand-fold. In response to the Tokyo Subway Attacks, the United States took measures to protect itself from WMD attack by non-state actors. Those measures were still being enacted when the nation was attacked on 9/11. On September 11, 2001, nineteen hijackers inflicted as much damage as the Imperial Japanese Navy on December 7, 1941. The investigating 9/11 Commission noted the attacks for their \"surpassing disproportion\". The hijackers had achieved WMD effects without using WMD. They did this by subverting the nation's transportation infrastructure, turning passenger jets into guided missiles. Again, the security implications were profound. Non-state actors seeking to inflict domestic catastrophic destruction did not need to import, fabricate, or acquire WMD as the nation was surrounded by the means of its own destruction in the form of critical infrastructure. The vulnerability of critical infrastructure had not gone unnoticed. Again, in response to the Tokyo Subway attacks, which themselves had been an attack on Japanese infrastructure, President Clinton in 1996 commissioned a panel to investigate the threat to United States' infrastructure. The panel replied in 1997 that there was no immediate threat to US infrastructure, but they were concerned with the growing risk of cyber attack. The same cyber physical systems that fueled the explosive growth of the Internet were being incorporated into Industrial Control Systems that underpinned much of the nation's critical infrastructure. The panel noted that the knowledge and skills necessary to mount a cyber attack on the nation's infrastructure was growing. As a result of this observation, President Clinton in 1998 ordered the protection of US critical infrastructure, especially from cyber attack. Following 9/11, critical infrastructure protection and cybersecurity were designated core missions in the 2002 Homeland Security Act establishing the new Department of Homeland Security. They remain core missions to this day, but many don't see the connection. The connection is this: cybersecurity is essential to critical infrastructure protection, which is essential to homeland security, which is about safeguarding the United States from domestic catastrophic destruction.  I look forward to working with you in the coming lessons.  Best wishes and good luck!\n\nCourse 1: Homeland Security & Cybersecurity Connection\nCourse 2: Cybersecurity Policy for Water and Electricity Infrastructures\nCourse 3: Cybersecurity Policy for Aviation and Internet Infrastructures\nCourse 4: Homeland Security & Cybersecurity Future\n\nSHOW ALL ABOUT HOMELAND SECURITY & CYBERSECURITY CONNECTION - IT'S NOT ABOUT THE TERRORISTS\nSHOW ALL"
    },
    {
       "Url":"/learn/cybersecurity-policy-water-electricity?specialization=homeland-security-cybersecurity",
       "name":"Cybersecurity Policy for Water and Electricity Infrastructures",
       "Rating":"Cybersecurity Policy for Water and Electricity Infrastructures\n4.6\nstars\n159 ratings\n•\n42 reviews\n\nThis course will examine the drinking water and electricity infrastructures, and various policies that have been developed to help guide and strengthen their cybersecurity programs.  The drinking water and electricity infrastructures are two of fourteen subsectors comprising what are known as \"lifeline infrastructure\". The 2013 National Infrastructure Protection Plan identifies four lifeline infrastructure sectors: 1) water, 2) energy, 3) transportation, and 4) communications. These sectors are designated \"lifeline\" because many other infrastructures depend upon them.  The drinking water subsector is part of the water sector, and the electricity subsector is part of the energy sector.  Both subsectors are overseen by the Department of Homeland Security National Protection and Programs Directorate which manages the DHS National Infrastructure Protection Program. The NIPP employs a five-step continuous improvement program called the Risk Management Framework. NIPP implementation is overseen by DHS-designated Sector-Specific Agencies staffed by various Federal departments. The Sector-Specific Agencies work in voluntary cooperation with industry representatives to apply the Risk Management Framework and document results in corresponding Sector-Specific Plans.  The program began in 2007 and the most recent Sector-Specific Plans were published in 2016. In February 2013, President Obama issued Executive 13636 directing the National Institute of Standards and Technology to develop a voluntary set of recommendations for strengthening infrastructure cybersecurity measures. EO13636 also asked Federal agencies with regulating authority to make a recommendation whether the NIST Cybersecurity Framework should be made mandatory. The Environmental Protection Agency who is both the SSA and regulatory authority for the drinking water subsector recommended voluntary application of the NIST Cybersecurity Framework. The Department of Energy who is both the SSA and regulatory authority for the electricity subsector replied that it was already implementing the Electricity Subsector Cybersecurity Capability Maturity Model, which indeed was what the NIST Cybersecurity Framework was based on.  The Department of Energy, though, recommended voluntary application of the ES-C2M2. This module will examine both the drinking water and electricity lifeline infrastructure subsectors, and elements and application of the NIST Cybersecurity Framework and ES-C2M2.\n\nSHOW ALL ABOUT CYBERSECURITY POLICY FOR WATER AND ELECTRICITY INFRASTRUCTURES\nSHOW ALL"
    },
    {
       "Url":"/learn/cybersecurity-policy-aviation-internet?specialization=homeland-security-cybersecurity",
       "name":"Cybersecurity Policy for Aviation and Internet Infrastructures",
       "Rating":"Cybersecurity Policy for Aviation and Internet Infrastructures\n4.7\nstars\n204 ratings\n•\n51 reviews\n\nIn this course we will examine the aviation and Internet infrastructures, and various policies that have been developed to help guide and strengthen their cybersecurity programs.  The aviation and Internet infrastructures are also considered \"lifeline infrastructure\" as part of the transportation and communications sectors. Both subsectors are overseen by the Department of Homeland Security National Protection and Programs Directorate which manages the DHS National Infrastructure Protection Program. SSA responsibility for the aviation subsector is shared between the Transportation Security Administration and Federal Aviation Administration under the auspices of the Department of Homeland Security and Department of Transportation respectively.  The Department of Homeland Security retains sole responsibility as the Sector-Specific Agency for the Internet subsector.  While TSA and FAA have regulatory over the aviation subsector, DHS has no regulatory authority whatsoever over the Internet. In response to Executive Order 13636 issued by President Obama in February 2013, both sets of SSAs recommended continuing with voluntary cybersecurity measures. TSA and FAA reported they were working to implement the Transportation Roadmap across all transportation subsectors, including aviation. DHS reported that it was working with Internet providers to implement the Cyber Assessment Risk Management Approach. Despite some differences, the Transportation Roadmap and CARMA are very similar to the NIST Cybersecrity Framework and ES-C2M2 examined previously.  That is to say, they are predicated on a continuous improvement process that engages the whole organization in identifying and implementing incremental changes to enhance cybersecurity practices based on prevailing standards. This module will examine both the aviation and Internet lifeline infrastructure subsectors, and elements and application of the Transportation Roadmap and CARMA.\n\nSHOW ALL ABOUT CYBERSECURITY POLICY FOR AVIATION AND INTERNET INFRASTRUCTURES\nSHOW ALL"
    },
    {
       "Url":"/learn/homeland-security-cybersecurity-future?specialization=homeland-security-cybersecurity",
       "name":"Homeland Security and Cybersecurity Future",
       "Rating":"Homeland Security and Cybersecurity Future\n4.6\nstars\n138 ratings\n•\n38 reviews\n\nThis course takes a look at the future of cybersecurity with respect to what is being done to lessen the potential for catastrophic destruction resulting from cyber attack on critical infrastructure.  In this respect, we take a short survey of potential technological solutions and response options.  We conclude this module by taking a look at unique aspects of the cyber profession and personal considerations for those who want to make cybersecurity a career.\n\nSHOW ALL ABOUT HOMELAND SECURITY AND CYBERSECURITY FUTURE\nSHOW ALL"
    },
    "/specializations/learn-mandarin-chinese-intermediate",
    {
       "Url":"/learn/mandarin-chinese-intermediate-learners-1?specialization=learn-mandarin-chinese-intermediate",
       "name":"Mandarin Chinese for Intermediate Learners: Part 1",
       "Rating":"Mandarin Chinese for Intermediate Learners: Part 1\n4.7\nstars\n86 ratings\n•\n35 reviews\n\n\"Mandarin Chinese 1: Chinese for Intermediate Learners\" is the first course of the MOOC specialization  \"Learn Intermediate Mandarin Chinese\" created by Shanghai Jiao Tong University."
    },
    {
       "Url":"/learn/mandarin-chinese-intermediate-learners-2?specialization=learn-mandarin-chinese-intermediate",
       "name":"Mandarin Chinese for Intermediate Learners: Part 2",
       "Rating":"Mandarin Chinese for Intermediate Learners: Part 2\n4.0\nstars\n22 ratings\n•\n8 reviews\n\n\"Mandarin Chinese 2: Chinese for Intermediate Learners\" is the second course of the MOOC specialization  \"Learn Intermediate Mandarin Chinese\" created by Shanghai Jiao Tong University."
    },
    {
       "Url":"/learn/mandarin-chinese-intermediate-learner-3?specialization=learn-mandarin-chinese-intermediate",
       "name":"Mandarin Chinese for Intermediate Learners: Part 3",
       "Rating":"Mandarin Chinese for Intermediate Learners: Part 3\n4.8\nstars\n18 ratings\n•\n6 reviews\n\n\"Mandarin Chinese 3: Chinese for Intermediate Learners\" is the third course of the MOOC specialization  \"Learn Intermediate Mandarin Chinese\" created by Shanghai Jiao Tong University."
    },
    {
       "Url":"/learn/mandarin-chinese-intermediate-learner-capstone?specialization=learn-mandarin-chinese-intermediate",
       "name":"Mandarin Chinese for Intermediate Learners: Capstone Project",
       "Rating":"Mandarin Chinese for Intermediate Learners: Capstone Project\n\n\"Mandarin Chinese: Capstone Project for Intermediate Learners\" is the fourth and final course of the MOOC specialization  \"Learn Intermediate Mandarin Chinese\" created by Shanghai Jiao Tong University."
    },
    "/specializations/legal-aspects-of-entrepreneurship",
    {
       "Url":"/learn/legal-foundations-for-entrepreneurs?specialization=legal-aspects-of-entrepreneurship",
       "name":"Legal Foundations for Entrepreneurs",
       "Rating":"Legal Foundations for Entrepreneurs\n\nBy its nature, the law touches on many aspects of entrepreneurship, making it an applicable and versatile topic of study. For aspiring entrepreneurs, it's important to understand how to form the business and work with the initial customers. For active entrepreneurs, there are critical considerations on employment law and operating policies. For everyone, the role that the law plays in managing the company, and its associated risks, must be properly understood to navigate challenges and capitalize on opportunities.\n\nWith the aspiring and active entrepreneur in mind, this course focuses on the foundational elements of law. We'll begin with an introduction to the nature of law and modern legal systems and sources. Initial priorities, including what legal activities you may pursue on your own, versus when and how to select and work with an attorney, are explored. Business formation choices and considerations are also central points of discussion. Employments laws and liabilities are examined, with the closing topic being entering and existing your business.\n\n\"Legal Foundations for Entrepreneurs\" is one of three courses in the \"Legal Aspects of Entrepreneurship Specialization\" by Coursera and the University of Maryland. This specialization explores the critical legal and business issues entrepreneurs face as they build and launch a new venture. Learners examine real-world scenarios and address legal and business issues from ideation to all of the important junctures along the path to success. Significant attention is placed on new venture formation, intellectual property management, and contracts and financing arrangements.\n\nSHOW ALL ABOUT LEGAL FOUNDATIONS FOR ENTREPRENEURS\nSHOW ALL"
    },
    {
       "Url":"/learn/intellectual-property-for-entrepreneurs?specialization=legal-aspects-of-entrepreneurship",
       "name":"Intellectual Property for Entrepreneurs",
       "Rating":"Intellectual Property for Entrepreneurs\n\nFor aspiring and active entrepreneurs, this course focuses on the opportunities and challenges of intellectual property. Intellectual property is a commonly discussed, often misunderstand, element of entrepreneurship and law. Knowing how to create and manage patents, copyrights, trademarks, and trade secrets is a valuable skill for entrepreneurs and business leaders. \n\nRegardless of size and industry, a business’s intellectual property is often more valuable than its physical assets. Companies invest tremendous resources in developing innovative new products and services. Intellectual property law discourages competitors from immediately profiting from another’s invention, and provides incentives for continued innovation.\n\n\"Intellectual Property for Entrepreneurs\" is one of three courses in the \"Legal Aspects of Entrepreneurship Specialization\" by Coursera and the University of Maryland. This specialization explores the critical legal and business issues entrepreneurs face as they build and launch a new venture. Learners examine real-world scenarios and address legal and business issues from ideation to all of the important junctures along the path to success. Significant attention is placed on new venture formation, intellectual property management, and contracts and financing arrangements.\n\nSHOW ALL ABOUT INTELLECTUAL PROPERTY FOR ENTREPRENEURS\nSHOW ALL"
    },
    {
       "Url":"/learn/legal-contracts-and-agreements-for-entrepreneurs?specialization=legal-aspects-of-entrepreneurship",
       "name":"Legal Contracts and Agreements for Entrepreneurs",
       "Rating":"Legal Contracts and Agreements for Entrepreneurs\n\nThis course focuses on how legal contracts may impact or impede the success of aspiring and active entrepreneurs. We explore a wide variety of legal considerations, including:\n\n* What types of legal contracts and agreements are appropriate for which entrepreneurial activities and actions?\n* What is the role of torts, liability, and negligence in creating and managing products and services?\n* How should contracts and sales agreements be created, evaluated, and negotiated?\n* What legal considerations are applicable when raising financial capital?\n\n\"Legal Contracts and Agreements for Entrepreneurs\" is one of three courses in the \"Legal Aspects of Entrepreneurship Specialization\" by Coursera and the University of Maryland. This specialization explores the critical legal and business issues entrepreneurs face as they build and launch a new venture. Learners examine real-world scenarios and address legal and business issues from ideation to all of the important junctures along the path to success. Significant attention is placed on new venture formation, intellectual property management, and contracts and financing arrangements.\n\nSHOW ALL ABOUT LEGAL CONTRACTS AND AGREEMENTS FOR ENTREPRENEURS\nSHOW ALL"
    },
    "/specializations/shangwu-yingyu",
    {
       "Url":"/learn/guanli-lingdao-yingyu?specialization=shangwu-yingyu",
       "name":"商务英语课程:管理与领导力英语 Management & Leadership",
       "Rating":"商务英语课程:管理与领导力英语 Management & Leadership\n4.6\nstars\n28 ratings\n•\n7 reviews\n\n在你的职业生涯中，你是需使用英文的商务执行主管或是经理吗 ? 那么你知道要有良好的商务英文沟通能力是需要有专注力、字汇和运用特定的语言语法。在本课程中，你将跟着刚升迁的经理来了解她如何建立和领导出成功的团队。同时，你会将用英文来练习沟通的语言和方式，并用于以下的需求情况:\n\n● 以诚信和尊重来召聘和训练专业的团队共同合作\n● 管理及参与有条理的会议\n● 召开有效率的电话会议\n● 书写专业也易懂的电子邮件\n\n本课程的活动将提供机会来分享你的经验和接收来自全世界其他专业商务人士的回馈。\n\nAre you a business executive or a manager who uses English in your career? Then you know that good business communication in English requires focus, vocabulary, and specific linguistic structures. In this course, you will follow along a recently promoted manager as she builds and leads her team to success. Together, you will practice the language and styles of communication  needed in English for: \n•\tRecruiting and training a professional team to work together with integrity and respect\n•\tManaging and participating in well-organized meetings\n•\tMaking telephone conferences more efficient\n•\tWriting professional emails that are easy to read\n\nThe activities in this course will give you the opportunity to share your experience and receive immediate feedback from other business professionals around the world.\n\nSHOW ALL ABOUT 商务英语课程:管理与领导力英语 MANAGEMENT & LEADERSHIP\nSHOW ALL"
    },
    {
       "Url":"/learn/caijing-yingyu?specialization=shangwu-yingyu",
       "name":"商务英语课程:财经英语 Finance & Economics",
       "Rating":"商务英语课程:财经英语 Finance & Economics\n\n你在财务领域工作或是和财务专业人员常互动吗 ? 在你的职业生涯，你需说、写或是听得懂英文吗? 跟着本课程真实情境的人物，你会看到他们试着解决一般的商务情况，你会从你的成功和失败的经验中学习，并批判式的思考你沟通方式的抉择。在上完本课程后，你将能够读写电子邮件，报告，以及使用财务和经济的一般用语给予有效的简报。在压力之下，清楚地沟通、利用最近所学的策略，并对于你的商务沟通技巧的有效性，立即得到其他全世界财务专业人士的回馈! 获得你所想要的和全球的经理所期待的英语沟通能力。\n\nDo you work in finance or interact with finance professionals? Is it necessary to speak, write or understand English in your career? Follow the authentic characters in this course as they work through common business situations in finance and economics. Learn from your successes and failure, and think critically about your own communication options. After taking this course, you will be able to read and create efficient e-mails, reports, and impactful presentations with words and phrases commonly used in finance and economics. Communicate clearly under pressure utilizing recently learned strategies, and obtain immediate feedback about the efficiency of your business communication skills in English from other finance professionals around the world! Gain the English communication skills that you desire and that global managers expect.\n\nSHOW ALL ABOUT 商务英语课程:财经英语 FINANCE & ECONOMICS\nSHOW ALL"
    },
    {
       "Url":"/learn/shichang-yingxiao-yingyu?specialization=shangwu-yingyu",
       "name":"商务英语课程:市场与营销英语 Marketing & Sales",
       "Rating":"商务英语课程:市场与营销英语 Marketing & Sales\n\n如果你在营销、销售或是广告部工作，你已经知道有效率的沟通是必要的。当你要用英文并用说服他人的方式来表达你的想法，这可能会是很困难的。在本课程，你和全球的成功专业人士加入学习行列时，你将学到有效地使用英文。当你随着在营销部工作的真实情境的人物，看着他们努力地提升他们的沟通技巧，同时你也会提高你的能力。从你的成功和失败的经验中学习，反省你自己的沟通方式、优点和需改进的方面。上完本课程后，你将能够:\n\n● 透过有效率的电子邮件、报告和有说服力的简报来表达你的想法\n● 学习有关市场调查研究、品牌建立，直接营销和广告费用等字汇和用语\n● 对于你商务英语沟通能力的效率，立即获得全世界的销售和营销专业人士的回馈\n● 成为提升商务英语沟通能力全球商务专业人士社群的一份子\n\nIf you work in marketing, sales, or advertising, you already know that effective communication is a requirement. This can be even more difficult when expressing your ideas in a persuasive manner in English.  In this course, you will learn to use English more efficiently while joining successful global professionals around the world. Develop your skills along with authentic characters that work in marketing and also work hard to improve their communication skills. Learn from your successes and failures, reflect on your own style, strengths, and improvement areas. After taking this course, you will be able to:\n● Express your ideas through efficient emails, reports and persuasive presentations\n● Learn words and phrases related to market research, branding, direct marketing, advertising costs, etc.\n● Get instant feedback about the efficiency of your business communication skills in English from sales and marketing professionals from around the world\n● Become part of a global community of business professionals who are developing their English communication skills\n\nSHOW ALL ABOUT 商务英语课程:市场与营销英语 MARKETING & SALES\nSHOW ALL"
    },
    {
       "Url":"/learn/shangwu-yingyu-zong-jihuaan?specialization=shangwu-yingyu",
       "name":"总计划案 Final Project",
       "Rating":"总计划案 Final Project\n\n对于国际工作环境不熟悉的商务专业人士，普遍需要的能力是能写发表新产品的行动方案。在这工作实务，有一人必须和公司内的各不同的部门沟通，包括财务和营销部。在这总计划案，你将写一份发表新产品的行动方案。这计划将包含:\n\n● 项目现况报告\n● 营销活动\n● 项目的基本预算分析报告\n● 对管理阶层做项目阶段简报\n \n这项目将提供机会让你应用本课程你所学的英语技能，提升你目前工作所要求的有用文件，或是用一份文件来当作范例，可呈现出你的新能力和技能。\n\nA common necessity among business professionals who are new to an international work environment is the ability to create a plan of action to launch a new product. In this task, one has to communicate with many different departments within a company including finance and marketing. In this capstone project, you will create a plan of action to launch a new product. This plan will include:\n·      A project status report\n·      A copy of the marketing campaign\n·      A basic budget analysis for the project\n·      A short presentation for upper management with details on the project’s status\n \nThis project will give you the opportunity to apply your English skills learned in the courses to develop a useful document for your current job or a document that you could use as an example to demonstrate your new abilities and skills.\n\nSHOW ALL ABOUT 总计划案 FINAL PROJECT\nSHOW ALL"
    },
    "/specializations/good-with-words-speaking-and-presenting",
    {
       "Url":"/learn/speaking-and-presenting-poise?specialization=good-with-words-speaking-and-presenting",
       "name":"Speaking and Presenting: Poise",
       "Rating":"Speaking and Presenting: Poise\n\nPoise is not some elusive or innate characteristic. It’s a series of choices, all of which can help you better connect with your intended audience. This course will help you identify those choices and teach you how to consistently make them."
    },
    {
       "Url":"/learn/speaking-and-presenting-pitches-persuasion?specialization=good-with-words-speaking-and-presenting",
       "name":"Speaking and Presenting: Pitches and Persuasion",
       "Rating":"Speaking and Presenting: Pitches and Persuasion\n\nThe hope good presenters project when pitching their ideas is not naïve hope. They’re not Pollyanna at the podium. Instead, the solutions they offer are supported by research, data, and expertise. This course will teach you how to merge hard facts with an imaginative vision in a way that at once resonates with and inspires your audience.\n\nSHOW ALL ABOUT SPEAKING AND PRESENTING: PITCHES AND PERSUASION\nSHOW ALL"
    },
    {
       "Url":"/learn/speaking-presenting-conversation-starters?specialization=good-with-words-speaking-and-presenting",
       "name":"Speaking and Presenting: Conversation Starters",
       "Rating":"Speaking and Presenting: Conversation Starters\n\nThis course will teach you how to build persuasive surprises into your presentations, the kind of surprises that will change how your audience sees a particular situation or proposal and then gets them talking—in a good way. It will also identify several techniques you can use to start (and maintain) your own conversations, whether with a big group, a small group, or even just one-one-one.\n\nSHOW ALL ABOUT SPEAKING AND PRESENTING: CONVERSATION STARTERS\nSHOW ALL"
    },
    {
       "Url":"/learn/speaking-and-presenting-tact?specialization=good-with-words-speaking-and-presenting",
       "name":"Speaking and Presenting: Tact",
       "Rating":"Speaking and Presenting: Tact\n\nTo be an effective speaker you don’t need to overwhelm people with your intellect. You don’t need to dazzle them from start to finish. You simply need to give them the sense that what they are receiving was especially prepared with their interests and needs in mind. This course will help you develop the judgment and dexterity needed to craft a perfectly tailored message.\n\nSHOW ALL ABOUT SPEAKING AND PRESENTING: TACT\nSHOW ALL"
    },
    "/specializations/app-development",
    {
       "Url":"/learn/swift-programming?specialization=app-development",
       "name":"Introduction To Swift Programming",
       "Rating":"Introduction To Swift Programming\n3.9\nstars\n1,397 ratings\n•\n378 reviews\n\nIntroduction to Swift Programming is the first course in a four part specialization series that will provide you with the tools and skills necessary to develop an iOS App from scratch. By the end of this first course you will be able to demonstrate intermediate application of programming in Swift, the powerful new programming language for iOS. Guided by best practices you will become proficient with syntax, object oriented principles, memory management, functional concepts and more in programming with Swift. \n\nThis course is unique in its dedication to teaching Swift programming. With new features and capabilities you will be at the forefront of writing iOS apps.\n\nCurrently this course is taught using Swift 2. The team is aware of the release of Swift 3 and will be making edits to the course in time. Please be aware that at this time the instruction is entirely with Swift 2. \n\nPlease note that to take part in this course (and the full specialization) it is required to have a Mac computer and, though not required, ideally an iPhone, iPod, or an iPad. NOTE: This course has been designed and tested (and content delivered) on a Mac. While we are aware of hacks and workarounds for running Mac in a virtual machine on windows we do not recommended a PC. \n\nWe hope you have fun on this new adventure.\n\nSHOW ALL ABOUT INTRODUCTION TO SWIFT PROGRAMMING\nSHOW ALL"
    },
    {
       "Url":"/learn/ios-app-development-basics?specialization=app-development",
       "name":"iOS App Development Basics",
       "Rating":"iOS App Development Basics\n4.3\nstars\n542 ratings\n•\n123 reviews\n\niOS App Development Basics, the second course in the iOS App Development with Swift specialization, expands your programming skills and applies them to authentic app development projects. The topics covered in this course include Xcode basics, Core iOS and Cocoa Touch frameworks, simple user interface creation, MVC Architecture and much more.  With a focus on using Apple’s components to access sensors like camera, microphone and GPS, by the end of this course you will be able to create a basic App according to specified parameters and guidelines.\n\nCurrently this course is taught using Swift 2. The team is aware of the release of Swift 3 and will be making edits to the course in time. Please be aware that at this time the instruction is entirely with Swift 2.\n\nSHOW ALL ABOUT IOS APP DEVELOPMENT BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/ios-app-design-development?specialization=app-development",
       "name":"App Design and Development for iOS",
       "Rating":"App Design and Development for iOS\n4.1\nstars\n264 ratings\n•\n64 reviews\n\nIn App Design and Development for iOS, the third course of the iOS App Development with Swift specialization, you will be developing foundational programming skills to support graphical element presentation and data manipulation from basic functions through to advanced processing. You will continue to build your skill set to use and apply core graphics, touch handling and gestures, animations and transitions, alerts and actions as well as advanced algorithms, threading and more. By the end of this course you will be able to develop a more advanced, fully functioning app.\n\nCurrently this course is taught using Swift 2. The team is aware of the release of Swift 3 and will be making edits to the course in time. Please be aware that at this time the instruction is entirely with Swift 2.\n\nSHOW ALL ABOUT APP DESIGN AND DEVELOPMENT FOR IOS\nSHOW ALL"
    },
    {
       "Url":"/learn/build-app?specialization=app-development",
       "name":"Build Your Own iOS App",
       "Rating":"Build Your Own iOS App\n3.3\nstars\n67 ratings\n•\n19 reviews\n\nIn the Build Your Own iOS App capstone you will expand your repertoire of additional features and more advanced functions that may be implemented within the iOS environment. You will refine your development skill set and will apply your accumulated skills over the entire specialization series in an applied application development capstone project. This particular course is project based and structured around you building a high quality app as a capstone to the specialization.\n\nCurrently this course is taught using Swift 2. The team is aware of the release of Swift 3 and will be making edits to the course in time. Please be aware that at this time the instruction is entirely with Swift 2.\n\nSHOW ALL ABOUT BUILD YOUR OWN IOS APP\nSHOW ALL"
    },
    "/specializations/globalization-economic-growth-and-stability",
    {
       "Url":"/learn/economic-policy?specialization=globalization-economic-growth-and-stability",
       "name":"Understanding economic policymaking",
       "Rating":"Understanding economic policymaking\n4.8\nstars\n934 ratings\n•\n223 reviews\n\nThis is the first of the three courses part of the Globalization, Economic Growth and Stability Specialization. This course will employ a non-technical approach to analyze how governments use policy to influence a country's economy. Upon completing the course you should be able to discuss national debts and deficits, examine fiscal and monetary policy and their appropriateness to the situation of an economy, and anticipate the results of fiscal and monetary policies and structural reform on a country. These concepts will give you the tools to develop your own position in many current economic debates, such as fiscal stimulus vs. austerity, the merits of quantitative easing, the need for higher interest rates or the future growth path of many modern economies.\n\nSHOW ALL ABOUT UNDERSTANDING ECONOMIC POLICYMAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/trade-immigration-exchange-rates-globalized-world?specialization=globalization-economic-growth-and-stability",
       "name":"Trade, Immigration and Exchange Rates in a Globalized World",
       "Rating":"Trade, Immigration and Exchange Rates in a Globalized World\n4.8\nstars\n235 ratings\n•\n51 reviews\n\nThis is the second of the three courses part of the Globalization, Economic Growth and Stability Specialization. This course will focus on facets of globalization that affect a country´s economic perspectives and decisions. Globalization has recently been the predominant subject in many political debates, and this course will go into the determinants of globalization. It will be separated into four modules; the first module will explain exchange rates. It will cover what determines exchange rate and how different exchange rates affect the economy and the reality of currencies. The second module will explore trade, the reality of free trade, and what occurs to a country´s economy with protectionism. The third module will go into the balance of payments, it will help you understand how economic transactions between a country and the rest of the world work. The fourth module will focus on Immigration, which is probably one of the most controversial subjects today. It will explain how migration affects host countries and it will cover current migration trends.\n\nSHOW ALL ABOUT TRADE, IMMIGRATION AND EXCHANGE RATES IN A GLOBALIZED WORLD\nSHOW ALL"
    },
    {
       "Url":"/learn/business-opportunities-and-risks-in-a-globalized-economy?specialization=globalization-economic-growth-and-stability",
       "name":"Business Opportunities and Risks in a Globalized Economy",
       "Rating":"Business Opportunities and Risks in a Globalized Economy\n4.8\nstars\n126 ratings\n•\n25 reviews\n\nThis is the last of the three courses part of the Globalization, Economic Growth and Stability Specialization.¨Business Opportunities and Risks in a Globalized World¨ is the the 3rd and final course of the ¨Globalization, Economic Growth and Stability¨ Specialization taught by IE Business School's Professor Gayle Allard. This course is designed to help an investor, businessperson or economist approach macroeconomic, institutional and international data and derive information from the indicators that point to the types of opportunities and risks that they present.  Students will gain practice by handling the data of some of the largest economies in the world –the United States, Japan, the European Union, China and India—and “reading the story” of their economies from their data, yielding surprisingly profound conclusions about their present and future. The course is the third in a series for the specialization but it is also a stand-alone course for anyone who wants practice in practical macroeconomics.\n\nThis course includes 4 modules, each one deep-diving into the macroeconomic circumstances that have been brought up in the recent history of four key regions: the USA, Japan, Europe, and China and India.  Students will analyze the ways in which international economies relate with one another, the benefits of trade and migration and economic development and how it occurs, among other themes.  \n\nProfessor Allard takes overarching macroeconomic theory and turns it into a practical tool for those interested in the opportunities and risks of investment and doing business in each of the four regions covered.\n\nSHOW ALL ABOUT BUSINESS OPPORTUNITIES AND RISKS IN A GLOBALIZED ECONOMY\nSHOW ALL"
    },
    "/specializations/startup-entrepreneurship",
    {
       "Url":"/learn/startup-entrepreneurship-discovering-ideas?specialization=startup-entrepreneurship",
       "name":"Cracking the Creativity Code: Discovering Ideas",
       "Rating":"Cracking the Creativity Code: Discovering Ideas\n4.7\nstars\n936 ratings\n•\n229 reviews\n\nSkill at discovering new ideas, and delivering them, may be one of the most important practical job skills, in today’s and tomorrow’s job market. Creativity is an acquired skill, one that improves with practice. This course aims to empower individuals who believe they have lost their innate creativity, because they, their employers or teachers prefer the three R's: replication, repetition and rote, to innovation. We show how to re-ignite rusty creative powers. \n\nDuring this course, you will learn proven tools, frameworks and concepts useful for discovery– generating an endless stream of new ideas implementing at least some of those ideas with skill and persistence, based on books and articles written by the instructors. \n\nIn the first part of the course, you will learn a proven structured method for generating and implementing world-changing ideas known as ‘Zoom in, Zoom out, Zoom in’  that makes creativity more accessible to everyone. In the following weeks, you will learn practical proven tools useful for delivering ideas by employing the basic principles of business and management. You will practice the method, use it to tackle challenging real-world needs and produce a 2-3 minutes video presenting your idea.\n\nCourse Learning Outcomes\n\nOn successfully completing this four-week course, you will be able to:\n- Manage a process to generate an unending stream of creative ideas\n- Lead a process of innovation and implement ideas through all phases from discovery to delivery.\n- Apply creativity to a wide range of strategic management issues.\n- Solve problems with a high degree of innovation, creative thinking and risk taking.\n- Use and apply proven structured method for generating and implementing world-changing ideas known as ‘Zoom in, Zoom out, Zoom in’.\n- Develop and implement an innovation in your own practice.\n- Identify new and unfamiliar challenges and reflect on these challenges from a creative point of view, action they require and service they provide.\n- Demonstrate creative problem solving skills for defining, structuring and solving real world operations management problems.\n\nSHOW ALL ABOUT CRACKING THE CREATIVITY CODE: DISCOVERING IDEAS\nSHOW ALL"
    },
    {
       "Url":"/learn/startup-entrepreneurship-from-idea-to-startup?specialization=startup-entrepreneurship",
       "name":"From Idea to Startup",
       "Rating":"From Idea to Startup\n4.8\nstars\n727 ratings\n•\n150 reviews\n\nHow do you implement ideas?  \n\nThis course provides practical proven tools for transforming an idea into a product or service that creates value for others.  As students acquire these tools, they learn how to tell bad ideas from good, how to build a winning strategy, how to shape a unique value proposition, prepare a business plan, compare their innovation to existing solutions, build flexibility into their plan and determine when best to quit.\n\nAs a vital part of the course students conduct on-site interviews with entrepreneurs who have launched startups, and are eager to share their valuable insights with them.\n\nUpon completing this course successfully, graduates will be able to:\n1.\tTransform ideas into real products, services and processes, by validating the idea, testing it, and turning it into a growing, profitable and sustainable business.\n2.\tIdentify the major steps and requirements in order to estimate the potential of an innovative idea as the basis of an innovative project.\n3.\tReach creative solutions via an iteration of a virtually endless stream of world-changing ideas and strategies, integrating feedback, and learning from failures along the way.\n4.\tApply the 10 entrepreneurial tools in creating a business plan for a new innovative venture.\n5.\tApply methods and strategies learned from interviews with startup entrepreneurs and innovators. \n6.\tCommunicate and sell innovative ideas successfully.\n\nSHOW ALL ABOUT FROM IDEA TO STARTUP\nSHOW ALL"
    },
    {
       "Url":"/learn/startup-entrepreneurship-innovation-career-lessons?specialization=startup-entrepreneurship",
       "name":"Innovation Career Lessons from a Master",
       "Rating":"Innovation Career Lessons from a Master\n4.8\nstars\n321 ratings\n•\n80 reviews\n\nThis course, which is Part Three in the series of Startup Entrepreneurship specialization, offers Life Lessons from a Master Innovator, with proven achievements. During this course you will listen to conversations and interviews with Mr. David (Dadi) Perlmutter, who until recently was Executive VP of Intel corporate. Dadi will talk about 10 life lessons, based on his 34 years as a rebel innovator and entrepreneur. \n\nWe will share with you the following lessons: \nLove and Knowledge are infinite: grow and share; \nLearn from Failures and Successes; \nNothing Moves without a Vision; \nHave a Differentiated Market Transforming Strategy; \nDare to Take Action; \nFight Resistance; \nIt is All About the Ecosystem; \nBuild a Team; \nKeep it Simple and Work Hard.\n\nBy the end of the course the learner will:\n* Know how to lead a process of innovation and implement ideas through all its phases from discovery to delivery in your own field of choice.\n* Know how to apply creativity to  generate creative ideas in a wide range of strategic management issues.\n* Know how to solve problems in general, with a high degree of innovative creative thinking, to widen the range of possible choices\n* Identify new and unfamiliar challenges and needs, reflect on them from a creative point of view (zoom in), decide on the   \naction they require (zoom out)  and generate a novel and useful solution\n* Transform ideas into real value-creating products, services and processes.\n* Be able to analyze both success and failure  and draw conclusions from both, for improving future innovative efforts.\n* Be able to identify and create key features of innovative products and services and in doing so,  generate strategically differentiated innovations that are unique\n* Be able to present your  ideas persuasively and overcome resistance.\n* Know how to simplify a complex product and make it user friendly.\n\n\nCourse assignments will include participation in two discussion groups and four assignments. In each assignment you will be asked to deal with a question relating to an interview you have seen.\n\nSHOW ALL ABOUT INNOVATION CAREER LESSONS FROM A MASTER\nSHOW ALL"
    },
    {
       "Url":"/learn/startup-entrepreneurship-capstone?specialization=startup-entrepreneurship",
       "name":"Action-Driven Business Plan: From the ‘Classroom’ to the World",
       "Rating":"Action-Driven Business Plan: From the ‘Classroom’ to the World\n4.9\nstars\n318 ratings\n•\n75 reviews\n\n\"Action-Driven Business Plan: From the ‘Classroom’ to the World\" is a capstone project, that requires you, our learner, to pull together all you will have learned in the three courses that comprise the \"Startup Entrepreneurship\" Specialization. This course is in fact the culmination of the process designed to provide you with the opportunity to demonstrate what you have learned on a real-world project of your choice.\n\nDuring the following six weeks you will gradually create, improve and refine your business plan, moving from one milestone to another. Each week will begin with a short note from Prof. Maital, explaining what the current phase is about and providing you with points to consider while working on the assignments.  We encourage you to practice what you have learned using the self-assessment practice quizzes and brainstorm with your peers in the weekly forums.\n\nDuring the first week you will create a non-business plan as an initial step towards creating your business plan. In weeks two, three and five, you will be required to submit three assignments for peer evaluation, which will help you to prepare your final business plan. At the end of the course you will prepare and submit your completed business plan and an effective two-minute video describing your idea. Your business plan will include the following sections:  The Need, the Product, Unique Features, The Market and Future Developments, a Gantt chart and a project budget.\n\nSHOW ALL ABOUT ACTION-DRIVEN BUSINESS PLAN: FROM THE ‘CLASSROOM’ TO THE WORLD\nSHOW ALL"
    },
    "/specializations/embedded-systems-security",
    {
       "Url":"/learn/embedded-operating-system?specialization=embedded-systems-security",
       "name":"Embedded Hardware and Operating Systems",
       "Rating":"Embedded Hardware and Operating Systems\n4.2\nstars\n573 ratings\n•\n130 reviews\n\nThis course is intended for the Bachelor and Master's students, who like practical programming and making IoTs applications!\n\nIn this course we will talk about two components of a cyber physical system, namely hardware and operating systems. \n\n\nAfter completing this course, you will have the knowledge of both hardware components and operating systems. You are able to plan and use embedded operating systems in resource-constraint devices for Internet-of-Things (cyber physical system) applications. In addition, you can use Cooja simulation for designing and simulating wireless sensor network applications.\n\nWe have 4 modules, each with a graded quiz in the end and finally we have one peer reviewed programming assignment\nIn case you have no experience with C programming, please check you a practical course like:\nhttps://www.coursera.org/learn/arduino-platform. \n\nThe course is actually quite fun at the end when you are playing around with Cooja simulation for IoTs applications. So you can create and simulate your own design for sensor network applications. A lot of features and examples of Contiki and Cooja can be explored via assignments. There are some optional assignments of wireless sensor network applications for students who want to explore more about embedded OS in IoTs applications.\n    \n- Marco Ramirez /University of Turku\n- Igor Tcarenko/ University of Turku\n- Nguyen Gia Tuan /University of Turku\n\nCheck out our whole curriculum: http://iot4health.utu.fi/\n\nSHOW ALL ABOUT EMBEDDED HARDWARE AND OPERATING SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/iot-connectivity-security?specialization=embedded-systems-security",
       "name":"Web Connectivity and Security in Embedded Systems",
       "Rating":"Web Connectivity and Security in Embedded Systems\n4.5\nstars\n156 ratings\n•\n26 reviews\n\nWelcome to Web Connectivity and Security in Cyber Physical Systems!\n\nIn this course, we will explore several technologies that bring modern devices together, facilitating a network of connected things and making devices internet enabled. We will discuss rules, protocols, and standards for these devices to communicate with each other in the network. We will also go through security and privacy issues and challenges in cyber physical systems (CPS). We will explore measures and techniques for securing systems from different perspectives. Possible attack models are introduced and solutions to tackle such attacks are discussed. Moreover, some basic concepts related to privacy in cyber physical systems are presented.\n\nThe course comprises altogether five modules and is split up into two main sections. The first section contains three modules and centers on the problem of web connectivity in cyber physical systems. The second section consist of two modules focusing on security measures in such systems. Each module ends with a graded quiz, and there is a final peer reviewed exam at the end of the course covering the two main sections of the course. \n\nAfter completing this course, you will have the basic knowledge and capacity for designing the network architecture of your cyber physical system. This includes putting together different components, selecting suitable communication protocols, and utilizing these protocols in your system. You will also be able to define security requirements for your system and choose and implement a proper security and privacy technique to protect it.\n\nSHOW ALL ABOUT WEB CONNECTIVITY AND SECURITY IN EMBEDDED SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/real-time-systems?specialization=embedded-systems-security",
       "name":"Development of Real-Time Systems",
       "Rating":"Development of Real-Time Systems\n4.6\nstars\n500 ratings\n•\n105 reviews\n\nThis course is intended for the Master's student and computer engineer who likes practical programming and problem solving!\n\nAfter completing this course, you will have the knowledge to plan and set-up a real-time system both on paper and in practice.\n\nThe course centers around the problem of achieving timing correctness in embedded systems, which means to guarantee that the system reacts within the real-time requirements.\nExamples of such systems include airbags, emergency breaks, avionics, and also multi-media systems like video playback and QoS in web servers.\n\nThe course teaches how to plan real-time systems in theory using established mathematical proofs and how to implement them in practice by using the most common scheduling methods.\nWe also learn and how to program the system in the C language using the FreeRTOS real-time kernel.\nFinally we have a look at the future of real-time systems namely multi-core real-time systems!\n\nThis course focus on the learn-by-doing approach with many examples and real-world programming assignments.\nWe have 5 modules, each with a gentle graded quiz in the end and one peer reviewed programming assignment.\nIn case you have no experience with C programming, please check you a practical course like:\nhttps://www.coursera.org/learn/arduino-platform\n\nThe course is actually quite fun!\n-Simon Holmbacka / Åbo Akademi University\n\nCheck out our whole curriculum: https://research.it.abo.fi/\n\nSHOW ALL ABOUT DEVELOPMENT OF REAL-TIME SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/autonomous-runway-detection?specialization=embedded-systems-security",
       "name":"Capstone: Autonomous Runway Detection for IoT",
       "Rating":"Capstone: Autonomous Runway Detection for IoT\n4.6\nstars\n67 ratings\n•\n7 reviews\n\nThis capstone project course ties together the knowledge from three previous courses in IoT though embedded systems: Development of Real-Time Systems, Web Connectivity & Security and Embedded Hardware and Operating Systems. The students will develop a larger system using the learning outcomes from these courses, and the students will evaluate the developed system in a real-world programming environment. This course is a true engineering task in which the student must, not only implement the algorithm code, but also handle the interfaces between many different actors and hardware platforms. The students will learn how to motivate engineering decisions and how to choose implementations to make a system actually running. The students will also learn to evaluate the efficiency and the correctness of their system as well as real-world parameters such as energy consumption and cost.\n\nSHOW ALL ABOUT CAPSTONE:  AUTONOMOUS RUNWAY DETECTION FOR IOT\nSHOW ALL"
    },
    "/specializations/introduction-computer-infosystems",
    {
       "Url":"/learn/computer-hardware-software?specialization=introduction-computer-infosystems",
       "name":"Computer Hardware and Software",
       "Rating":"Computer Hardware and Software\n\nThis course provides foundational understanding of how computers process information through hardware and software. You will investigate the world of Information Technology (IT) and survey hardware components, mobile devices, operating systems, programs and apps, network fundamentals, the Internet, and touch on security and ethics.\n\nSHOW ALL ABOUT COMPUTER HARDWARE AND SOFTWARE\nSHOW ALL"
    },
    {
       "Url":"/learn/data-security-privacy?specialization=introduction-computer-infosystems",
       "name":"Data, Security, and Privacy",
       "Rating":"Data, Security, and Privacy\n\nThis course provides hands-on experience with technology-based productivity tools, as well as foundational knowledge and understanding of system design and development. The course is designed to integrate concepts of hardware, software, and the Internet. This course also provides an overview of data security, data privacy, and ways to increase productivity and efficiency. Students will also investigate technology career paths and some of the various certifications available in the industry.\n\nSHOW ALL ABOUT DATA, SECURITY, AND PRIVACY\nSHOW ALL"
    },
    {
       "Url":"/learn/productivity-systems-development?specialization=introduction-computer-infosystems",
       "name":"Productivity and Systems Development",
       "Rating":"Productivity and Systems Development\n\nThis course provides hands-on experience with technology-based productivity tools, as well as foundational knowledge and understanding of system design and development. The course is designed to integrate concepts of hardware, software, and the Internet. This course also provides an overview of data security, data privacy, and ways to increase productivity and efficiency. Students will also investigate technology career paths and some of the various certifications available in the industry.\n\nSHOW ALL ABOUT PRODUCTIVITY AND SYSTEMS DEVELOPMENT\nSHOW ALL"
    },
    "/specializations/emerging-technologies",
    {
       "Url":"/learn/big-data-emerging-technologies?specialization=emerging-technologies",
       "name":"Big Data Emerging Technologies",
       "Rating":"Big Data Emerging Technologies\n4.6\nstars\n188 ratings\n•\n47 reviews\n\nEvery time you use Google to search something, every time you use Facebook, Twitter, Instagram or any other SNS (Social Network Service), and every time you buy from a recommended list of products on Amazon.com you are using a big data system. In addition, big data technology supports your smartphone, smartwatch, Alexa, Siri, and automobile (if it is a newer model) every day. The top companies in the world are currently using big data technology, and every company is in need of advanced big data technology support. Simply put, big data technology is not an option for your company, it is a necessity for survival and growth. So now is the right time to learn what big data is and how to use it in advantage of your company. This 6 module course first focuses on the world’s industry market share rankings of big data hardware, software, and professional services, and then covers the world’s top big data product line and service types of the major big data companies. Then the lectures focused on how big data analysis is possible based on the world’s most popular three big data technologies Hadoop, Spark, and Storm. The last part focuses on providing experience on one of the most famous and widely used big data statistical analysis systems in the world, the IBM SPSS Statistics. This course was designed to prepare you to be more successful in businesses strategic planning in the upcoming big data era. Welcome to the amazing Big Data world!\n\nSHOW ALL ABOUT BIG DATA EMERGING TECHNOLOGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/smart-device-mobile-emerging-technologies?specialization=emerging-technologies",
       "name":"Smart Device & Mobile Emerging Technologies",
       "Rating":"Smart Device & Mobile Emerging Technologies\n4.7\nstars\n366 ratings\n•\n76 reviews\n\nEvery day you use your smartphone. Your smartphone wakes you up, it is the first thing you use in the morning, and the last thing you check (e.g., alarm setting) before you sleep. In addition, you use it all day. A typical cellphone user touches their mobile phone 2,617 times a day (Dscout report based on 2017) and people spend over 4 hours a day on their mobile phones (Hackernoon report) on average. Smartphones and smart watches are very useful and will become even more useful due to their smaller sizes, lighter weights, versatile functionalities, advanced mobile communications & wireless networking (e.g., Wi-Fi & Bluetooth) technologies. In this course, the start-of-the-art smartphone and smart watch technology and components in addition to the global market trends and future forecasts are introduced. Since everybody uses smartphones and smart watches, knowing the details about the most globally used electronic device will definitely help you in all aspects of new product and app design & development, as well as business planning. In addition, the core technology and components of the world’s most popular smartphones (i.e., the Samsung Galaxy Note8 and Apple iPhone X) and smart watches (i.e., Samsung Gear S3 and the Apple Watch Series 3) are introduced along with details of the iOS and Android smartphone OSs (Operating Systems) and mobile communications 1G to 5G (for details on Wi-Fi and Bluetooth, please take my course “IoT Wireless & Cloud Emerging Technology”). This course ends with projects that teach how to analyze the components of smartphones and check the mobile network. Consequently, this course will prepare you to be more successful in businesses strategic planning in the upcoming smart device era. I cordially welcome you in to the amazing internal dynamics of the smart device world!\n\nSHOW ALL ABOUT SMART DEVICE & MOBILE EMERGING TECHNOLOGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/iot-wireless-cloud-computing?specialization=emerging-technologies",
       "name":"IoT (Internet of Things) Wireless & Cloud Computing Emerging Technologies",
       "Rating":"IoT (Internet of Things) Wireless & Cloud Computing Emerging Technologies\n4.7\nstars\n977 ratings\n•\n267 reviews\n\nIoT (Internet of Things) devices are already abundant, but new products that include IoT modules are now a common trend. Also, almost everything is already connected to a Cloud, and much more will be in the future. Naturally, as this trend continues, in the near future almost all devices and appliances will include IoT modules which will use sensor data collection and control/management based on Clouds. Since we will live in an IoT world supported by Clouds, knowledge of the core technologies and platforms of IoT and Clouds will enable you with the tools to become a true leader in the future product and business world. In this course, the start-of-the-art IoT and wireless networks and Cloud technologies are introduced (for details on 1G to 5G mobile communications and smartphone and smart device technology, please take my course “Smart Device & Mobile Emerging Technologies”). This course ends with projects that teach how to analyze Bluetooth and W-Fi wireless networks and setup and use an EC2 (Elastic Compute Cloud) Virtual Computer in AWS (Amazon Web Service), which is the most powerful and popular Cloud technology in the world. Comparing to the human body, IoT is the neural network and the Cloud is the brain. Thus, I cordially welcome you into the brain and neural network of the future intelligence world!\n\nSHOW ALL ABOUT IOT (INTERNET OF THINGS) WIRELESS & CLOUD COMPUTING EMERGING TECHNOLOGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/ar-technologies-video-streaming?specialization=emerging-technologies",
       "name":"AR (Augmented Reality) & Video Streaming Services Emerging Technologies",
       "Rating":"AR (Augmented Reality) & Video Streaming Services Emerging Technologies\n4.6\nstars\n97 ratings\n•\n26 reviews\n\nWelcome to the course “Augmented Reality & Video Service Emerging Technologies.” The level of AR (Augmented Reality) and advanced video & multimedia technology included in a product is what determines the level of value and luxury. The objective of this course is to teach all important technologies that are used in state-of-the-art AR, Skype, and YouTube video and multimedia products and services. This includes the advanced video and real-time multimedia delivery mechanisms based on H.264/MPEG-4 AVC, MPEG-DASH, CDN, and mobile CDN. If you have knowledge of these core technologies, you can understand the operations that are used in every advanced video and multimedia system in the World. As the future World of business and products are driven to be more and more video and multimedia oriented, having knowledge of these core technologies will enable you to lead your company to become the true World leader in AR and video multimedia technology products, services, and business. Thus, I cordially welcome you into the beautiful and powerful World of advanced AR and video multimedia!\n\nSHOW ALL ABOUT AR (AUGMENTED REALITY) & VIDEO STREAMING SERVICES EMERGING TECHNOLOGIES\nSHOW ALL"
    },
    "/specializations/climate-change-and-health",
    {
       "Url":"/learn/introduction-climate-change-health?specialization=climate-change-and-health",
       "name":"Introduction to Climate Change and Health",
       "Rating":"Introduction to Climate Change and Health\n4.8\nstars\n579 ratings\n•\n129 reviews\n\nClimate change is one of the greatest threats to human health in the 21st century. Yet these impacts to health are still not well recognized. Since you can’t change what you don’t understand, this course is designed to equip health and environmental professionals, as well as other changemakers and the public, with critical and usable knowledge to take positive action. The course begins with an introduction to the science of climate change and how climate change affects human health. It takes a deep dive into climate change’s adverse health effects, including those related to extreme heat, waterborne infections, insect-borne diseases, and exposure to storms and floods. Throughout, the theme of health equity is interwoven by pointing to what factors make some populations more vulnerable than others to climate change’s negative health impacts. Finally, the course explains how measures to reduce greenhouse gas emissions can not only limit future climate change but can also generate substantial immediate health “co-benefits” over and above the benefit of reducing climate change.\n\nFollowing completion of the course, students will be able to: \n·       At an introductory level, describe how the climate has changed, explain the role of greenhouse gases in climate change, and describe how the climate is predicted to change in the future. \n·       Describe how climate change adversely impacts population health, with differing vulnerability across population sub-groups, through direct effects; through ecosystem transformation and degradation; and through the stress it places on political, economic, and social systems. \n·       Explain how adaptation and mitigation strategies can reduce adverse health impacts of climate change and can generate substantial non-climate health benefits in a just and equitable manner.\n\nSHOW ALL ABOUT INTRODUCTION TO CLIMATE CHANGE AND HEALTH\nSHOW ALL"
    },
    {
       "Url":"/learn/climateadaptation?specialization=climate-change-and-health",
       "name":"Climate Adaptation for Human Health",
       "Rating":"Climate Adaptation for Human Health\n4.5\nstars\n97 ratings\n•\n25 reviews\n\nThe world’s climate is changing, and among the most significant negative consequences is to human health. While climate change is a global health issue, its health impacts vary across geographies and populations. In this course, you will learn why taking action to plan for and adapt to climate change is necessary for protecting human health, as well as what kinds of actions are most appropriate for a particular location and population. You also will learn tools and strategies to effectively plan for and enact adaptation actions that build resilience to climate change’s negative effects.\n\nSHOW ALL ABOUT CLIMATE ADAPTATION FOR HUMAN HEALTH\nSHOW ALL"
    },
    {
       "Url":"/learn/climatecommunication?specialization=climate-change-and-health",
       "name":"Communicating Climate Change and Health",
       "Rating":"Communicating Climate Change and Health\n4.7\nstars\n83 ratings\n•\n23 reviews\n\nHow can you persuasively discuss the negative effects of climate change on human health to motivate change in your community? How do you encourage your friends, family, neighbors and community leaders to take meaningful action to address these impacts? In this course, you will learn to communicate the health-related risks of climate change effectively to the public and policymakers and motivate positive changes in climate-related behaviors. Starting with a review of best practices in health risk communication, the course examines the specific challenges of climate change communication and successful strategies to address these challenges. Throughout the course, you will build a step-by-step plan for developing and delivering a communications campaign.\n\nSHOW ALL ABOUT COMMUNICATING CLIMATE CHANGE AND HEALTH\nSHOW ALL"
    },
    "/specializations/architecting-hybrid-cloud-infrastructure-anthos",
    {
       "Url":"/learn/hybrid-cloud-infrastructure-foundations-anthos?specialization=architecting-hybrid-cloud-infrastructure-anthos",
       "name":"Hybrid Cloud Infrastructure Foundations with Anthos",
       "Rating":"Hybrid Cloud Infrastructure Foundations with Anthos\n4.7\nstars\n267 ratings\n•\n40 reviews\n\nThis on-demand course equips students to build reliable and manageable multi-cluster Kubernetes infrastructures using Anthos GKE, whether deployed with Anthos on Google Cloud or with Anthos deployed on VMware. It is a continuation of Architecting with GKE and assumes hands-on experience with the technologies covered in that course.\n\nSHOW ALL ABOUT HYBRID CLOUD INFRASTRUCTURE FOUNDATIONS WITH ANTHOS\nSHOW ALL"
    },
    {
       "Url":"/learn/hybrid-cloud-service-mesh-anthos?specialization=architecting-hybrid-cloud-infrastructure-anthos",
       "name":"Hybrid Cloud Service Mesh with Anthos",
       "Rating":"Hybrid Cloud Service Mesh with Anthos\n4.8\nstars\n128 ratings\n•\n14 reviews\n\nThis on-demand course equips students to understand and adopt Istio-based service-mesh with Anthos for centralized observability, traffic management, and service-level security."
    },
    {
       "Url":"/learn/hybrid-cloud-multi-cluster-anthos?specialization=architecting-hybrid-cloud-infrastructure-anthos",
       "name":"Hybrid Cloud Multi-Cluster with Anthos",
       "Rating":"Hybrid Cloud Multi-Cluster with Anthos\n4.8\nstars\n112 ratings\n•\n20 reviews\n\nThis on-demand course equips students to understand, configure, and maintain multi-cluster Kubernetes infrastructures using Anthos GKE and Istio-based service mesh, whether deployed with Anthos on Google Cloud or with Anthos deployed on VMware."
    },
    "/specializations/computer-network-security",
    {
       "Url":"/learn/design-secure-networked-systems?specialization=computer-network-security",
       "name":"Design and Analyze Secure Networked Systems",
       "Rating":"Design and Analyze Secure Networked Systems\n3.8\nstars\n174 ratings\n•\n53 reviews\n\nIn this MOOC, we will learn the basic cyber security concepts, how to identify vulnerabilities/threat in a network system. We will apply CIA basic security services in the triage of recent cyberattack incidents, such as OPM data breach.   We will learn the risk management framework for analyzing the risks in a network system, and apply the basic security design principles to protect the data and secure computer systems. We will examine the trustworthiness of programs and data installed in our systems and show the proper way to verify their integrity and authenticity. We will apply principle of least privileges for controlling the shared access given to different groups of users and system processes. On Amazon Cloud instances, we will use GnuPG software to generate public/private key pair for signing/verifying documents and open source software, and for encrypting documents. We will learn how to publish software, the related signature and release key on  web server and publish public key to PGP key server for others to retrieve. We will learn Public Key Infrastructure (PKI) and  Linux utility to serve as a CA for an organization, learn how to sign certificate request for clients or servers in secure email and web applications.\n\nSHOW ALL ABOUT DESIGN AND ANALYZE SECURE NETWORKED SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/basic-cryptography-and-crypto-api?specialization=computer-network-security",
       "name":"Basic Cryptography and Programming with Crypto API",
       "Rating":"Basic Cryptography and Programming with Crypto API\n4.3\nstars\n58 ratings\n•\n13 reviews\n\nIn this MOOC, we will learn the basic concepts and principles of crytography, apply basic cryptoanalysis to decrypt messages encrypted with mono-alphabetic substitution cipher, and discuss the strongest encryption technique of the one-time-pad and related quantum key distribution systems.  We will also learn the efficient symmetric key cryptography algorithms for encrypting data, discuss the DES and AES standards, study the criteria for selecting AES standard, present the block cipher operating modes and discuss how they can prevent and detect the block swapping attacks,  and examine how to defend against replay attacks. We will learn the Diffie-Hellman Symmetric Key Exchange Protocol to generate a symmetric key for two parties to communicate over insecure channel. We will learn  the modular arithmetic and the Euler Totient Theorem to appreciate the RSA Asymmetric Crypto Algorithm,  and use OpenSSL utility to realize the basic operations of RSA Crypto Algorithm. Armed with these knowledge, we learn how to use PHP  Crypto API to write secure programs for encrypting and decrypting documents  and for signing and verify documents. We then apply these techniques to enhance the registration process of a web site which ensures the account created is actually requested by the owner of the email account.\n\nSHOW ALL ABOUT BASIC CRYPTOGRAPHY AND PROGRAMMING WITH CRYPTO API\nSHOW ALL"
    },
    {
       "Url":"/learn/hacking-patching?specialization=computer-network-security",
       "name":"Hacking and Patching",
       "Rating":"Hacking and Patching\n3.9\nstars\n201 ratings\n•\n55 reviews\n\nIn this MOOC, you will learn how to hack web apps with command injection vulnerabilities in a web site of your AWS Linux instance.   You will learn how to search valuable information on a typical Linux systems with LAMP services, and deposit and hide Trojans for future exploitation.  You will learn how to patch these web apps with input validation using regular expression. You will learn a security design pattern to avoid introducing injection vulnerabilities by input validation and replacing generic system calls with specific function calls.  You will learn how to hack web apps with SQL injection vulnerabilities and retrieve user profile information and passwords.  You will learn how to patch them with input validation and SQL parameter binding.  You will learn the hacking methodology, Nessus tool for scanning vulnerabilities, Kali Linux for penetration testing, and Metasploit Framework for gaining access to vulnerable Windows Systems, deploying keylogger, and perform Remote VNC server injection.  You will learn security in memory systems and virtual memory layout, and understand buffer overflow attacks and their defenses.  You will learn how to clone a Kali instance with AWS P2 GPU support and perform hashcat password cracking using dictionary attacks and known pattern mask attacks.\n\nSHOW ALL ABOUT HACKING AND PATCHING\nSHOW ALL"
    },
    {
       "Url":"/learn/secure-networked-system-with-firewall-ids?specialization=computer-network-security",
       "name":"Secure Networked System with Firewall and IDS",
       "Rating":"Secure Networked System with Firewall and IDS\n3.8\nstars\n45 ratings\n•\n8 reviews\n\nIn this MOOC, we will focus on learning how network systems are secured using firewalls and IDS.  This will include understanding the basic components of network security, constructing a dual-firewall DMZ, and defining security policies to implement and enforce these rules.  Building upon these lessons we will go in-depth on the popular Linux firewall.  Finally we will learn about Network IDS and Host IDS, including a deep dive into Snort.\n\nSHOW ALL ABOUT SECURE NETWORKED SYSTEM WITH FIREWALL AND IDS\nSHOW ALL"
    },
    "/specializations/active-optical-devices",
    {
       "Url":"/learn/leds-semiconductor-lasers?specialization=active-optical-devices",
       "name":"Light Emitting Diodes and Semiconductor Lasers",
       "Rating":"Light Emitting Diodes and Semiconductor Lasers\n4.0\nstars\n35 ratings\n•\n10 reviews\n\nThis course can also be taken for academic credit as ECEA 5605, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nLEDs and Semiconductor Lasers Course Introduction\nYou will learn about semiconductor light emitting diodes (LEDs) and lasers, and the important rules for their analysis, planning, design, and implementation. You will also apply your knowledge through challenging homework problem sets to cement your understanding of the material and prepare you to apply in your career. \n\nCourse Learning Outcomes\nAt the end of this course you will be able to…\n  (1) Design a semiconductor light emitting diode and analyze efficiency\n  (2) Design a semiconductor laser\n  (3) Choose suitable semiconductor materials for light emitting devices\n\nSHOW ALL ABOUT LIGHT EMITTING DIODES AND SEMICONDUCTOR LASERS\nSHOW ALL"
    },
    {
       "Url":"/learn/nanophotonics-detectors?specialization=active-optical-devices",
       "name":"Nanophotonics and Detectors",
       "Rating":"Nanophotonics and Detectors\n4.1\nstars\n16 ratings\n•\n2 reviews\n\nThis course can also be taken for academic credit as ECEA 5606, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nNanophotonics and Detectors Introduction\nThis course dives into nanophotonic light emitting devices and optical detectors, including metal semiconductors, metal semiconductor insulators, and pn junctions. We will also cover photoconductors, avalanche photodiodes, and photomultiplier tubes. Weekly homework problem sets will challenge you to apply the principles of analysis and design we cover in preparation for real-world problems.\n\nCourse Learning Outcomes\nAt the end of this course you will be able to…\n  (1) Use nanophotonic effects (low dimensional structures) to engineer lasers\n  (2) Apply  low dimensional structures to photonic device design\n  (3) Select and design optical detector for given system and application\n\nSHOW ALL ABOUT NANOPHOTONICS AND DETECTORS\nSHOW ALL"
    },
    {
       "Url":"/learn/displays?specialization=active-optical-devices",
       "name":"Displays",
       "Rating":"Displays\n4.3\nstars\n39 ratings\n•\n6 reviews\n\nThis course can also be taken for academic credit as ECEA 5607, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nDisplays Course Introduction\nThe course will dive deep into electronic display devices, including liquid crystals, electroluminescent, plasma, organic light emitting diodes, and electrowetting based displays. You'll learn about various design principles, affordances and liabilities, and also a variety of applications in the real world of professional optics.\n\nCourse Learning Outcomes\n At the end of this course you will be able to…\n (1) Select a display technology for a given application (LIDAR, imaging, microscopy etc.)\n (2) Design a system around the limitations of a given display technology (ie. addressing)\n (3) Design a system that maximizes contract\n\nSHOW ALL ABOUT DISPLAYS\nSHOW ALL"
    },
    "/specializations/data-mining-foundations-practice",
    {
       "Url":"/learn/data-mining-pipeline?specialization=data-mining-foundations-practice",
       "name":"Data Mining Pipeline",
       "Rating":"Data Mining Pipeline\n\nThis course introduces the key steps involved in the data mining pipeline, including data understanding, data preprocessing, data warehousing, data modeling, interpretation and evaluation, and real-world applications.\n\nData Mining Pipeline can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nCourse logo image courtesy of Francesco Ungaro, available here on Unsplash: https://unsplash.com/photos/C89G61oKDDA\n\nSHOW ALL ABOUT DATA MINING PIPELINE\nSHOW ALL"
    },
    {
       "Url":"/learn/data-mining-methods?specialization=data-mining-foundations-practice",
       "name":"Data Mining Methods",
       "Rating":"Data Mining Methods\n\nThis course covers the core techniques used in data mining, including frequent pattern analysis, classification, clustering, outlier analysis, as well as mining complex data and research frontiers in the data mining field. \n\nData Mining Methods can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nCourse logo image courtesy of Lachlan Cormie, available here on Unsplash: https://unsplash.com/photos/jbJp18srifE\n\nSHOW ALL ABOUT DATA MINING METHODS\nSHOW ALL"
    },
    {
       "Url":"/learn/data-mining-theory-practice-project?specialization=data-mining-foundations-practice",
       "name":"Data Mining Project",
       "Rating":"Data Mining Project\n\nThis course offers step-by-step guidance and hands-on experience of designing and implementing a real-world data mining project, including problem formulation, literature survey, proposed work, evaluation, discussion and future work. \n\nData Mining Project can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nCourse logo image courtesy of Mariana Proença, available here on Unsplash: https://unsplash.com/photos/_WgnXndHmQ4\n\nSHOW ALL ABOUT DATA MINING PROJECT\nSHOW ALL"
    },
    "/specializations/semiconductor-devices",
    {
       "Url":"/learn/semiconductor-physics?specialization=semiconductor-devices",
       "name":"Semiconductor Physics",
       "Rating":"Semiconductor Physics\n4.4\nstars\n212 ratings\n•\n54 reviews\n\nThis course can also be taken for academic credit as ECEA 5630, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis course introduces basic concepts of quantum theory of solids and presents the theory describing the carrier behaviors in semiconductors. The course balances fundamental physics with application to semiconductors and other electronic devices. \n\nAt the end of this course learners will be able to:\n1. Understand the energy band structures and their significance in electric properties of solids\n2. Analyze the carrier statistics in semiconductors\n3. Analyze the carrier dynamics and the resulting conduction properties of semiconductors\n\nSHOW ALL ABOUT SEMICONDUCTOR PHYSICS\nSHOW ALL"
    },
    {
       "Url":"/learn/diode-pn-junction-metal-semiconductor-contact?specialization=semiconductor-devices",
       "name":"Diode - pn Junction and Metal Semiconductor Contact",
       "Rating":"Diode - pn Junction and Metal Semiconductor Contact\n4.4\nstars\n186 ratings\n•\n32 reviews\n\nThis course can also be taken for academic credit as ECEA 5631, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis course presents in-depth discussion and analysis of pn junction and metal-semiconductor contacts including equilibrium behavior, current and capacitance responses under bias, breakdown, non-rectifying behavior, and surface effect. You'll work through sophisticated analysis and application to electronic devices.\n\nAt the end of this course learners will be able to:\n1. Analyze pn junction at equilibrium and under bias, capacitance and current characteristics, and breakdown behavior\n2. Analyze metal-semiconductor contact at equilibrium and under bias, capacitance and current characteristics, non-rectifying contact and surface effects\n\nSHOW ALL ABOUT DIODE - PN JUNCTION AND METAL SEMICONDUCTOR CONTACT\nSHOW ALL"
    },
    {
       "Url":"/learn/transistor-field-effect-transistor-bipolar-junction-transistor?specialization=semiconductor-devices",
       "name":"Transistor - Field Effect Transistor and Bipolar Junction Transistor",
       "Rating":"Transistor - Field Effect Transistor and Bipolar Junction Transistor\n3.8\nstars\n46 ratings\n•\n10 reviews\n\nThis course can also be taken for academic credit as ECEA 5632, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nThis course presents in-depth discussion and analysis of metal-oxide-semiconductor field effect transistors (MOSFETs) and bipolar junction transistors (BJTs) including the equilibrium characteristics, modes of operation, switching and current amplifying behaviors.\n\nAt the end of this course learners will be able to:\n1. Understand and analyze metal-oxide-semiconductor (MOS) device\n2. Understand and analyze MOS field effect transistor (MOSFET)\n3. Understand and analyze bipolar junction transistor (BJT)\n\nSHOW ALL ABOUT TRANSISTOR - FIELD EFFECT TRANSISTOR AND BIPOLAR JUNCTION TRANSISTOR\nSHOW ALL"
    },
    "/specializations/corporate-entrepreneurship",
    {
       "Url":"/learn/corporate-entrepreneurs-opportunity?specialization=corporate-entrepreneurship",
       "name":"Developing the Opportunity for Corporate Entrepreneurs",
       "Rating":"Developing the Opportunity for Corporate Entrepreneurs\n4.4\nstars\n79 ratings\n•\n16 reviews\n\nFor an increasing number of established companies, creating new businesses and programs within the company is an imperative for success. Maturing technologies and aging product portfolios are requiring established companies to create, develop, and sustain innovative new initiatives. \n\nIn this course, learners will develop knowledge on how to navigate the barriers to creating, developing, and sustain innovative new businesses and programs within established companies or organizations with an emphasis on:\n\n• Introducing the skills for identifying and analyzing entrepreneurial ideas within a corporate environment;\n• Examining entrepreneurial thinking within yourself and your colleagues with an awareness of entrepreneurial mindset, entrepreneurial motivations, and entrepreneurial behaviors;\n• Cultivating seeing entrepreneurially within yourself and your colleagues with attention to industry conditions, industry status, macroeconomic change, and competition; and\n• Championing acting entrepreneurially within the corporate environment with an understanding of value innovation and opportunity identification.\n\nTry this course for FREE at https://www.coursera.org/learn/corporate-entrepreneurs-opportunity\n\nSHOW ALL ABOUT DEVELOPING THE OPPORTUNITY FOR CORPORATE ENTREPRENEURS\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-entrepreneurs-business-model?specialization=corporate-entrepreneurship",
       "name":"Building the Business Model for Corporate Entrepreneurs",
       "Rating":"Building the Business Model for Corporate Entrepreneurs\n4.7\nstars\n65 ratings\n•\n14 reviews\n\nLed by Dan Gordon, a University of Maryland faculty member who teaches business modeling in the National Science Foundation's I-Corps Program, this course enables you to develop and apply the Business Model Canvas tool to scope a corporate challenge or opportunity. You will learn how to identify and communicate the nine elements of a business model: Customer Segments, Value Propositions, Channels, Customer Relationships, Revenue Streams, Key Resources, Key Activities, Key Partners, and Cost Structure.\n\nYour completed project will be a customer-validated Business Model Canvas that outlines the business case for a new product or service to address your selected challenge or opportunity in a corporate context. This project is derived from four areas of focus in the course:\n\n• Identifying how to create and deliver value for existing and future customers of the company;\n• Learning how to extract value for the corporate venture in a sustainable fashion; \n• Conducting in-depth interviews to guide the customer discovery process for your corporate venture; and\n• Developing business models that encompass the product or service, customers, and economic engine that deliver on the corporate venture objectives.\n\nTry this course for FREE at https://www.coursera.org/learn/corporate-entrepreneurs-business-model\n\nSHOW ALL ABOUT BUILDING THE BUSINESS MODEL FOR CORPORATE ENTREPRENEURS\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-entrepreneurs-innovation-strategy?specialization=corporate-entrepreneurship",
       "name":"Crafting Strategies for Innovation Initiatives for Corporate Entrepreneurs",
       "Rating":"Crafting Strategies for Innovation Initiatives for Corporate Entrepreneurs\n4.1\nstars\n26 ratings\n•\n4 reviews\n\nThis course focuses on enhancing your understanding of (1) how an internal venture is organized and (2) how to overcome resistance to your new venture ideas within the company.  The course is specifically valuable for:\n\n• Employees who have creative ideas important to their company;\n• Managers seeking to assemble creative people and resources; \n• Technical specialists desiring to become part of an internal venture; and\n• Consultants who advise companies on ways to launch and grow internal ventures.\n\nYou will learn strategies to help you launch a corporate venture with coursework focused on four key areas:\n\n• Examining how to audit a company's internal environment to establish a framework for its innovation capabilities;\n• Creating a plan for an organizational structure and operational format that incorporates key roles and players for internal ventures within the company;\n• Analyzing corporate culture to identify creative capabilities that leverage the company's best practices for innovation;\n• Evaluating innovation portfolios and compose innovation strategies that are best aligned with the implementation potential within the company.\n\nTry this course for FREE at https://www.coursera.org/learn/corporate-entrepreneurs-innovation-strategy\n\nSHOW ALL ABOUT CRAFTING STRATEGIES FOR INNOVATION INITIATIVES FOR CORPORATE ENTREPRENEURS\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-entrepreneurs-financing?specialization=corporate-entrepreneurship",
       "name":"Financing and Profiting from Innovation for Corporate Entrepreneurs",
       "Rating":"Financing and Profiting from Innovation for Corporate Entrepreneurs\n4.7\nstars\n39 ratings\n•\n4 reviews\n\nThis course is for aspiring or active corporate entrepreneurs who wants to understand how to secure and manage funding for their corporate venture. We will demystify key accounting and financing concepts to give corporate entrepreneurs a guide to developing the business case for their ideas, and securing funding to translate ideas into reality. \n\nThis course focuses on four key areas:\n\n• Learning the fundamentals and how to create financial statements for new ventures within the corporate environment;\n• Examining valuation techniques for understanding how to assess and grow the value of the corporate venture;\n• Exploring the different sources of internal and external financing for the corporate venture; and\n• Applying lessons learned in the course to structure a funding deal and pitch the corporate venture.\n\nTry this course for FREE at https://www.coursera.org/learn/corporate-entrepreneurs-financing\n\nSHOW ALL ABOUT FINANCING AND PROFITING FROM INNOVATION FOR CORPORATE ENTREPRENEURS\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-entrepreneurship-project?specialization=corporate-entrepreneurship",
       "name":"Master Class for Corporate Entrepreneurs",
       "Rating":"Master Class for Corporate Entrepreneurs\n4.4\nstars\n24 ratings\n•\n3 reviews\n\nThe Master Class experience is designed to serve as the final project experience for the Corporate Entrepreneurship Specialization. Alternatively, professionals with experience in opportunity analysis, business modeling, and corporate finance are invited to complete the Master Class experience without the preliminary courses. \n\nWith maturing technologies and aging product portfolios requiring established companies to create, develop, and sustain innovative new businesses, graduates of the Master Class will develop an understanding of how to create new businesses and initiatives within the corporate environment. In collaboration with our award-winning faculty, and a vibrant peer group, learners will explore and apply the skills, tools, and best practices for:\n\n• Identifying and developing the entrepreneurial opportunities;\n• Building business models;\n• Creating strategies for leading innovation; and \n• Financing and profiting from innovation. \n\nThe Master Class experience is differentiated from typical Coursera courses and MOOCs in that our faculty and staff are actively engaged with learners by providing individual feedback on assignments. Our faculty and staff will review and offer feedback on the major assignment submissions, if you wish, in an effort to assist you in developing and launching your corporate ventures.\n\nTry this course for FREE at https://www.coursera.org/learn/corporate-entrepreneurship-project\n\nSHOW ALL ABOUT MASTER CLASS FOR CORPORATE ENTREPRENEURS\nSHOW ALL"
    },
    "/specializations/ell-teaching",
    {
       "Url":"/learn/ell-lesson?specialization=ell-teaching",
       "name":"Lesson Planning with the ELL in Mind",
       "Rating":"Lesson Planning with the ELL in Mind\n4.7\nstars\n171 ratings\n•\n51 reviews\n\nIn this course you will learn how to design lesson plans around the needs of your ELL students and their language level through the analysis of content language and cognitive demands. You will learn how to align language objectives to the adopted standards of your school and content area.  You will learn how to modify existing course materials as well as develop graphic organizers and languages frames to support ELLs’ access to content.  Analysis of second language acquisition theories will be applied to lesson planning.\n\nUpon completing this course, you will be able to:\n     * Conceptualize theories of second language acquisition as they apply to the planning of lessons through annotation\n     * Assess the linguistic needs of your students using BICS and CALP\n     * Identify content specific vocabulary, grammatical structures, and language functions necessary for a student to succeed in your     \n       classroom \n     * Write language learning outcomes that align to your student’s linguistic and cognitive ability and your school’s adopted   \n       standards \n     * Adapt a lesson plan that accomplishes the learning outcomes outlined in the lesson objectives\n    * Modify materials to support ELLs’ access to content\n    * Use a wide variety of graphic organizer templates and language frames to support ELLs’ access to content\n    * Develop activity types appropriate to the cognitive and linguistic abilities of ELLs\n    * Incorporate community and culture into lesson planning\n\nSHOW ALL ABOUT LESSON PLANNING WITH THE ELL IN MIND\nSHOW ALL"
    },
    {
       "Url":"/learn/ell-assessment?specialization=ell-teaching",
       "name":"Assessing Achievement with the ELL in Mind",
       "Rating":"Assessing Achievement with the ELL in Mind\n4.5\nstars\n81 ratings\n•\n28 reviews\n\nIn this course, you will learn how to design assessments around the needs of your ELL students and their language level.  You will learn how to incorporate language and content requirements for both formative and summative assessment types. You will learn to assess your ELL students through the use of project and task-based assignments.  You will learn to use and modify rubrics to align to and measure student achievement of your language and content learning objectives.  The course will also briefly cover strategies for supporting ELL students during standardized testing. \n\nUpon completing this course, you will be able to:\n    * Conceptualize theories of authentic assessment as they apply to second language learners\n    * Design formative assessment types incorporating language and content objectives\n    * Design summative assessment types incorporating language and content objectives\n    * Incorporate project and task-based assignments as assessment tools for ELLs\n    * Design rubrics that align to language and content objectives for your ELL(s)\n    * Apply the use of rubrics, both language and content, to the work of your ELL(s). \n    * Support your ELL(s)  as they participate in standardized testing\n\nSHOW ALL ABOUT ASSESSING ACHIEVEMENT WITH THE ELL IN MIND\nSHOW ALL"
    },
    {
       "Url":"/learn/ell-families?specialization=ell-teaching",
       "name":"Engaging ELLs and Their Families in the School and Community",
       "Rating":"Engaging ELLs and Their Families in the School and Community\n4.6\nstars\n58 ratings\n•\n18 reviews\n\nIn this course, you will learn how to better and more successfully engage your ELL(s) and their families in the school and community. You will learn how to engage your ELL student in the classroom setting as well as in various aspects of the school including extracurricular activities and the inner workings of the school and education system.  You will also be introduced to strategies for engaging the families of your ELL students in the school community and the wider community of your city and state.  You will interact with a variety of case studies that highlight teachers, schools, and communities in different cities throughout the United States and the ways in which they successfully engage ELLs and their families.  From sharing their experience, you will have the tools necessary to implement strategies and procedures for engaging your ELLs and their families. \n\nUpon completing this course, you will be able to:\n       * Define the culture of ELLs in K-12 classrooms across the U.S.\n       * Recognize cultural impact on learning and formal education \n       * Assess your school’s engagement of ELLs and their families\n       * Incorporate culturally sensitive techniques to engage ELLs in the classroom and school \n       * Implement strategies for engaging ELLs’ families in the school and larger community  \n       * Design a plan for engagement of ELLs and their families in your school  \n       * Create a checklist for school and community resources for engaging ELLs and \n          their families\n\nSHOW ALL ABOUT ENGAGING ELLS AND THEIR FAMILIES IN THE SCHOOL AND COMMUNITY\nSHOW ALL"
    },
    {
       "Url":"/learn/ell-project?specialization=ell-teaching",
       "name":"ELL Success in the Content Classroom: Capstone Project",
       "Rating":"ELL Success in the Content Classroom: Capstone Project\n\nAs teachers, it is so important to have a plethora of resources to draw upon for modification for specific students and classroom contexts.  In this capstone project, you are tasked with applying the concepts learned throughout the specialization, to create your own toolbox designed with the ELL in Mind. \n\nIn this two-part capstone, you will first create an annotated lesson plan comprising both formative and summative assessments.  The lesson plan will include any modified materials for ELLs such as graphic organizers or writing frames pertinent to the lesson's activities. The annotation will include a rationale for lesson elements based on information presented in Lesson Planning with the ELL in Mind and Assessing Achievement with the ELL in Mind. \n\nSecond, you will use your checklist of resources, personalized to your school and community, to create an engagement plan of action.  This should include specific milestones for creating a more engaging environment for your students and their families. You will also include a rationale for elements of engagement based on information presented in Engaging the ELL and Their Families in the School and Community.\n\nIn this capstone, you will create a personalized toolbox for ELL success in the content classroom.  \n\nThis toolbox will include:\n   * Annotated Lesson Plan\n       - Modified Materials\n       - Formative and Summative Assessment\n       - Lesson Plan and Materials Rationale\n   * Engagement Action Plan and Rationale\n\nThe materials created in this project should be immediately useful in your classroom.  Your capstone project should be tailored to your teaching context, content area, and students. \n\nBy the end of this course, you will be able to:\n     * Design a lesson plan with attention to the needs of your ELLs\n     * Create appropriate modified materials to support your ELLs\n     * Create formative and summative assessments to measure both content mastery and language development as specified by \n       your lesson plan's learning and language objectives\n     * Rationalize your application of selected methodologies\n     * Create and implement an engagement action plan specified for your teaching context\n\nSHOW ALL ABOUT ELL SUCCESS IN THE CONTENT CLASSROOM: CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/european-business-law",
    {
       "Url":"/learn/european-law-fundamentals?specialization=european-business-law",
       "name":"European Business Law: Understanding the Fundamentals",
       "Rating":"European Business Law: Understanding the Fundamentals\n4.8\nstars\n1,086 ratings\n•\n173 reviews\n\nThe European Union is one of the world’s largest and most important economies. This six week course is the first in a series of three that will provide students with an insight into European Business Law. The series ranges from considering the basic structures and principles of the European Union to focusing on various specialized areas of law. Each course will give the students an understanding of the laws and policies that regulate the internal market of European Union, as well as relevant case law and useful inputs from leading practitioners in the field. \n\nAt the end of this course series, you will have a basic understanding of how to:\n\n•\tNavigate EU legal sources\n\n•\tUnderstand relevant laws and regulations governing the internal European Union market\n\n•\tApply the fundamental principles of EU law within the EU legal framework\n\n•\tUtilize the rules of freedom of movement and their impacts on trade in the EU\n\n•\tRelate EU law with national laws\n\n•\tUnderstand how individuals and companies are able to enforce their EU rights on national level\n\n•\tUnderstand how an individual can challenge an inadequate EU legislation\n\n•\tUnderstand EU policies and their influence on foreign trade and investment\n\n\nAbout the Series\n\nIn the first course, Understanding the Fundamentals, we will examine the core structures and principles of the European Union as well as the main sources of law. In the second course, Doing business in Europe, we will focus on the main laws that regulate various aspects of establishing and running a business within the European Union. In the final course, Competing in Europe, we will go into more depth about how to compete on the internal market and protect your brand, product or invention. \n\nTo keep up to speed on the course series, visit our Facebook page at:\n\nhttps://www.facebook.com/eblmooc/\n\n\nSyllabus and Format\n\nEach course consists of a number of modules where one module represents about one week of work. A module includes a number of lectures and readings, and finishes with a voluntary assessment – a quiz, a small peer graded assignment or a case law review. The assessments are intended to encourage learning and ensure that you understand the material of the course. Participating in forum discussions is voluntary. \n\nCourse I - Understanding the Fundamentals\n\nModule 1.\tIntroduction to EU law\nModule 2.\tLegal Method and Sources \nModule 3.\tConstitutional Freedoms and Fundamental principles \nModule 4.\tEnforcement of EU Law and Judicial Review \nModule 5.\tFreedom of Movement \nModule 6.\tThe External Dimension \n\nCourse II - Doing Business in Europe \n\nModule 1. \tMaking Business Transactions\nModule 2. \tEstablishing a Company\nModule 3. \tEmploying and Working in Europe\nModule 4. \tPaying Taxes and Complying with Environmental Standards \nModule 5. \tResolving Cross-border Disputes \nModule 6. \tCase Clinic\n\nCourse III - Competing in Europe\n\nModule 1. \tTrademarks as Essential Assets\nModule 2. \tDefending Patents \nModule 3. \tCompetition: Illegal Agreements \nModule 4. \tCompetition: Abuse of Dominance and Mergers \nModule 5. \tSelling to the State and State Aid \nModule 6. \tAdvocacy and Legal Writing \n\n\nLund University\n\nLund University was founded in 1666 and has for a number of years been ranked among the world’s top 100 universities. The University has 47 700 students and 7 500 staff based in Lund, Sweden. Lund University unites tradition with a modern, dynamic, and highly international profile. With eight different faculties and numerous research centers and specialized institutes, Lund is the strongest research university in Sweden and one of Scandinavia's largest institutions for education and research. The university annually attracts a large number of international students and offers a wide range of courses and programmes taught in English. \n\nThe Faculty of Law is one of Lund University’s four original faculties, dating back to 1666. It is a modern faculty with an international profile, welcoming both international and Swedish students. Education, research and interaction with the surrounding community are the main focus of the Faculty’s work. The connection between the three is particularly apparent in the programmes and courses offered by the university, including the university’s MOOC course in European Business Law. The students get the chance to engross themselves in traditional legal studies, while interacting with both researchers and professionally active lawyers with qualifications and experience from various areas of law.\nThe faculty offers three international Masters: two 2-year Master’s programmes in International Human Rights Law and European Business Law, and a 1-year Master’s in European and International Tax Law. Students from around 40 countries take part in the programmes which offer a unique subject specialization within each field, with highly qualified researchers and professional legal practitioners engaged in the teaching. \n\nThe Master’s programme in European Business Law provides an in-depth understanding of both the practical and the theoretical aspects of business law within the European Union. The programme provides both general and specific knowledge of the European Union legal framework, which is necessary for students intending to work as legal advisors or business decision-makers. The programme is delivered in English and is open to students with at least a three year degree in Law (Bachelor, LL.B, or equivalent) who want to specialise in European economic and business law.\n\nThe MOOC course in European Business Law is a great course to start with for students intending to apply for the Master’s programme in European Business Law. Even though the MOOC course does not grant credits previous knowledge of the subject is considered upon admission to the master’s programme. For more information about the Master’s programme in European Business Law see https://www.law.lu.se/#!meb\n\nSHOW ALL ABOUT EUROPEAN BUSINESS LAW: UNDERSTANDING THE FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/eu-law-doing-business?specialization=european-business-law",
       "name":"European Business Law: Doing Business in Europe",
       "Rating":"European Business Law: Doing Business in Europe\n4.8\nstars\n461 ratings\n•\n76 reviews\n\nThis six-week course titled Doing Business in Europe is the second in a series of three exploring some of the main business aspects of European Union law. Besides providing learners with a sound knowledge base of European laws and regulations relevant to establishing and managing a company within the European Union, the course also explores business considerations within a broader perspective by including inputs from leading law practitioners in the field. More specifically, the course discusses strategic and financial considerations within Company law, as well as Labour law issues such as restructuring enterprises, working conditions and handling crises situations. The course also examines other legal areas such as Tax law, Environmental law and Private International law, and how they tie in to doing business in Europe.\n\nAt the end of this course, you will have a basic understanding of how to:\n\n· Understand the relevant regulations governing the internal European Union market\n\n· Establish and run a company within the European Union\n\n· Employ staff and recognize workers’ rights and obligations\n\n· Comply with tax regulations and environmental standards\n\n· Set up agreements and resolve cross-border disputes\n\n· Successfully analyse EU case law and draft case reports\n\n\nAbout the Series\n\nThe Lund series in European Business Law ranges from considering the basic structures and principles of the European Union to focusing on specialized areas of European Union law. The first course, Understanding the Fundamentals, examines the core structures and principles of the European Union. The third and final course, Competing in Europe, goes into depth concerning how to compete on the internal market and protect your brand, product or invention. All three courses can be taken independently or in sequence depending on your needs and preferences.\n\nTo keep up to speed on the course series, visit our Facebook page at:\n\nhttps://www.facebook.com/eblmooc/\n\n\nSyllabus and Format\n\nEach course consists of a number of modules where one module represents about one week of work. A module includes a number of lectures and readings, and finishes with an assessment – a quiz or a peer graded assignment. The assessments are intended to encourage learning and ensure that you understand the material of the course. Participating in forum discussions is voluntary. \n\nCourse I - Understanding the Fundamentals\n\nModule 1.\tIntroduction \nModule 2.\tLegal Method and Sources \nModule 3.\tConstitutional Freedoms and Fundamental principles \nModule 4.\tEnforcement of EU Law and Judicial Review\nModule 4.\tFreedom of Movement \nModule 5.\tThe External Dimension \n\nCourse II - Doing Business in Europe \n\nModule 1. \tMaking Business Transactions\nModule 2. \tEstablishing a Company\nModule 3. \tEmploying and Working in Europe\nModule 4. \tPaying Taxes and Complying with Environmental Standards \nModule 5. \tResolving Cross-border Disputes \nModule 6. \tCase Clinic\n\n\nCourse III - Competing in Europe\n\nModule 1. \tTrademarks as essential Assets\nModule 2. \tDefending Patents \nModule 3. \tCompetition: Illegal Agreements \nModule 4. \tCompetition: Abuse of Dominance and Mergers \nModule 5. \tSelling to the State and State Aid \nModule 6. \tLegal Writing and Argumentation\n\n\n\nLund University\n\nLund University was founded in 1666 and has for a number of years been ranked among the world’s top 100 universities. The University has 47 700 students and 7 500 staff based in Lund, Sweden. Lund University unites tradition with a modern, dynamic, and highly international profile. With eight different faculties and numerous research centers and specialized institutes, Lund is the strongest research university in Sweden and one of Scandinavia's largest institutions for education and research. The university annually attracts a large number of international students and offers a wide range of courses and programmes taught in English. \n\nThe Faculty of Law is one of Lund University’s four original faculties, dating back to 1666. It is a modern faculty with an international profile, welcoming both international and Swedish students. Education, research and interaction with the surrounding community are the main focus of the Faculty’s work. The connection between the three is particularly apparent in the programmes and courses offered by the university, including the university’s MOOC course in European Business Law. The students get the chance to engross themselves in traditional legal studies, while interacting with both researchers and professionally active lawyers with qualifications and experience from various areas of law.\nThe faculty offers three international Masters: two 2-year Master’s programmes in International Human Rights Law and European Business Law, and a 1-year Master’s in European and International Tax Law. Students from around 40 countries take part in the programmes which offer a unique subject specialization within each field, with highly qualified researchers and professional legal practitioners engaged in the teaching. \n\nThe Master’s programme in European Business Law provides an in-depth understanding of both the practical and the theoretical aspects of business law within the European Union. The programme provides both general and specific knowledge of the European Union legal framework, which is necessary for students intending to work as legal advisors or business decision-makers. The programme is delivered in English and is open to students with at least a three year degree in Law (Bachelor, LL.B, or equivalent) who want to specialise in European economic and business law.\n\nThe MOOC course in European Business Law is a great course to start with for students intending to apply for the Master’s programme in European Business Law. Even though the MOOC course does not grant credits previous knowledge of the subject is considered upon admission to the master’s programme. For more information about the Master’s programme in European Business Law see https://www.law.lu.se/#!meb\n\nSHOW ALL ABOUT EUROPEAN BUSINESS LAW: DOING BUSINESS IN EUROPE\nSHOW ALL"
    },
    {
       "Url":"/learn/eu-competition-law?specialization=european-business-law",
       "name":"European Business Law: Competing in Europe",
       "Rating":"European Business Law: Competing in Europe\n4.7\nstars\n243 ratings\n•\n35 reviews\n\nAbout this Course\n\nThis six-week course titled Competing in Europe is the third in a series of three exploring some of the main business aspects of European Union law. Besides providing learners with a sound knowledge base of European laws and regulations, the series explores business considerations within a broader perspective by including inputs from leading law practitioners in the field. More specifically, the third course discusses how to compete on the internal market and protect your brand, product or invention. It includes legal disciplines such as Intellectual Property law (IP law), Competition law and specific branches within Public law, such as public procurement and state aid. \n\nAt the end of this course, you will have a basic understanding of how to:\n\n•\tFind and understand relevant laws and regulations governing the internal European Union market\n\n•\tProtect and defend a company’s products, brands and inventions by obtaining and licensing trademarks and patents\n\n•\tCreate a competitive edge for a company and apply the basic principles of EU competition law\n\n•\tConstruct and present a persuasive legal argument\n\n\nAbout the Series\n\nThe Lund series in European Business Law ranges from considering the basic structures and principles of the European Union to focusing on specialized areas of European Union law. The first course, Understanding the Fundamentals, examines the core structures and principles of the European Union. The second course, Doing Business in Europe, examines legal areas such as Company law, Labour law, Tax law, Environmental law and Private International law, and how they tie in to doing business in Europe. All three courses can be taken independently or in sequence depending on your needs and preferences.\n\nTo keep up to speed on the course series, visit our Facebook page at:\n\nhttps://www.facebook.com/eblmooc/\n\n\nSyllabus and Format\n\nEach course consists of a number of modules where one module represents about one week of work. A module includes a number of lectures and readings, and finishes with an assessment – a quiz or a peer graded assignment. The assessments are intended to encourage learning and ensure that you understand the material of the course. Participating in forum discussions is voluntary. \n\nCourse I - Understanding the Fundamentals\n\nModule 1.\tIntroduction \nModule 2.\tLegal Method and Sources \nModule 3.\tConstitutional Freedoms and Fundamental principles \nModule 4.\tEnforcement of EU Law and Judicial Review \nModule 5.\tFreedom of Movement \nModule 6.\tThe External Dimension \n\nCourse II - Doing Business in Europe \n\nModule 1. \tMaking Business Transactions\nModule 2. \tEstablishing a Company\nModule 3. \tEmploying and Working in Europe\nModule 4. \tPaying Taxes and Complying with Environmental Standards \nModule 5. \tResolving Cross-border Disputes \nModule 6. \tCase Clinic\n\n\nCourse III - Competing in Europe\n\nModule 1. \tObtaining Trademarks\nModule 2. \tDefending Patents \nModule 3. \tCompetition: Illegal Agreements \nModule 4. \tCompetition: Abuse of Dominance and Mergers \nModule 5. \tSelling to the State and State Aid\nModule 6. \tAdvocacy and Legal Writing \n\n\n\nLund University\n\nLund University was founded in 1666 and has for a number of years been ranked among the world’s top 100 universities. The University has 47 700 students and 7 500 staff based in Lund, Sweden. Lund University unites tradition with a modern, dynamic, and highly international profile. With eight different faculties and numerous research centers and specialized institutes, Lund is the strongest research university in Sweden and one of Scandinavia's largest institutions for education and research. The university annually attracts a large number of international students and offers a wide range of courses and programmes taught in English. \n\nThe Faculty of Law is one of Lund University’s four original faculties, dating back to 1666. It is a modern faculty with an international profile, welcoming both international and Swedish students. Education, research and interaction with the surrounding community are the main focus of the Faculty’s work. The connection between the three is particularly apparent in the programmes and courses offered by the university, including the university’s MOOC course in European Business Law. The students get the chance to engross themselves in traditional legal studies, while interacting with both researchers and professionally active lawyers with qualifications and experience from various areas of law.\n\nThe faculty offers three international Masters: two 2-year Master’s programmes in International Human Rights Law and European Business Law, and a 1-year Master’s in European and International Tax Law. Students from around 40 countries take part in the programmes which offer a unique subject specialization within each field, with highly qualified researchers and professional legal practitioners engaged in the teaching. \n\nThe Master’s programme in European Business Law provides an in-depth understanding of both the practical and the theoretical aspects of business law within the European Union. The programme provides both general and specific knowledge of the European Union legal framework, which is necessary for students intending to work as legal advisors or business decision-makers. The programme is delivered in English and is open to students with at least a three year degree in Law (Bachelor, LL.B, or equivalent) who want to specialise in European economic and business law.\n\nThe MOOC course in European Business Law is a great course to start with for students intending to apply for the Master’s programme in European Business Law. Even though the MOOC course does not grant credits previous knowledge of the subject is considered upon admission to the master’s programme. For more information about the Master’s programme in European Business Law see https://www.law.lu.se/#!meb\n\nSHOW ALL ABOUT EUROPEAN BUSINESS LAW: COMPETING IN EUROPE\nSHOW ALL"
    },
    "/specializations/differential-calculus-data-modeling",
    {
       "Url":"/learn/calculus-through-data-and-modelling-precalculus-review?specialization=differential-calculus-data-modeling",
       "name":"Calculus through Data & Modeling: Precalculus Review",
       "Rating":"Calculus through Data & Modeling: Precalculus Review\n4.9\nstars\n29 ratings\n•\n11 reviews\n\nThis course is an applications-oriented, investigative approach to the study of the mathematical topics needed for further coursework in single and multivariable calculus. The unifying theme is the study of functions, including polynomial, rational, exponential, logarithmic, and trigonometric functions. An emphasis is placed on using these functions to model and analyze data. Graphing calculators and/or the computer will be used as an integral part of the course.\n\nSHOW ALL ABOUT CALCULUS THROUGH DATA & MODELING: PRECALCULUS REVIEW\nSHOW ALL"
    },
    {
       "Url":"/learn/calculus-through-data-and-modelling-imits-derivatives?specialization=differential-calculus-data-modeling",
       "name":"Calculus through Data & Modeling: Limits & Derivatives",
       "Rating":"Calculus through Data & Modeling: Limits & Derivatives\n4.8\nstars\n18 ratings\n•\n5 reviews\n\nThis first course on concepts of single variable calculus will introduce the notions of limits of a function to define the derivative of a function. In mathematics, the derivative measures the sensitivity to change of the function. For example, the derivative of the position of a moving object with respect to time is the object's velocity: this measures how quickly the position of the object changes when time advances. This fundamental notion will be applied through the modelling and analysis of data.\n\nSHOW ALL ABOUT CALCULUS THROUGH DATA & MODELING: LIMITS & DERIVATIVES\nSHOW ALL"
    },
    {
       "Url":"/learn/calculus-through-data-and-modelling-differentiation-rules?specialization=differential-calculus-data-modeling",
       "name":"Calculus through Data & Modeling: Differentiation Rules",
       "Rating":"Calculus through Data & Modeling: Differentiation Rules\n4.7\nstars\n11 ratings\n•\n1 reviews\n\nCalculus through Data & Modeling: Differentiation Rules continues the study of differentiable calculus by developing  new rules for finding derivatives without having to use the limit definition directly.  These differentiation rules will enable the calculation of rates of change with relative ease the derivatives of polynomials, rational functions, algebraic functions, exponential and logarithmic functions, and trigonometric and inverse trigonometric functions.  Once these rules are developed, they are then applied to solve problems involving rates of change and the approximation of functions.\n\nSHOW ALL ABOUT CALCULUS THROUGH DATA & MODELING: DIFFERENTIATION RULES\nSHOW ALL"
    },
    {
       "Url":"/learn/calculus-through-data-and-modelling-applying-differentiation?specialization=differential-calculus-data-modeling",
       "name":"Calculus through Data & Modeling: Applying Differentiation",
       "Rating":"Calculus through Data & Modeling: Applying Differentiation\n\nAs rates of change, derivatives give us information about the shape of a graph. In this course, we will apply the derivative to find linear approximations for single-variable and multi-variable functions. This gives us a straightforward way to estimate functions that may be complicated or difficult to evaluate. We will also use the derivative to locate the maximum and minimum values of a function. These optimization techniques are important for all fields, including the natural sciences and data analysis. The topics in this course lend themselves to many real-world applications, such as machine learning, minimizing costs or maximizing profits.\n\nSHOW ALL ABOUT CALCULUS THROUGH DATA & MODELING: APPLYING DIFFERENTIATION\nSHOW ALL"
    },
    "/specializations/biology-everywhere",
    {
       "Url":"/learn/biology-everywhere-foundations?specialization=biology-everywhere",
       "name":"Biology Everywhere Foundations",
       "Rating":"Biology Everywhere Foundations\n4.6\nstars\n89 ratings\n•\n21 reviews\n\nIn this course, we will explore the nature of science and biology. We will discuss what the “biology everywhere” philosophy means and the history of the “biology everywhere” project. We will also discuss what science (and biology) are as a discipline of inquiry and how chemistry is foundational to understanding biology."
    },
    {
       "Url":"/learn/the-little-stuff-energy-cells-and-genetics?specialization=biology-everywhere",
       "name":"The Little Stuff: Energy, Cells, and Genetics",
       "Rating":"The Little Stuff: Energy, Cells, and Genetics\n4.5\nstars\n33 ratings\n•\n10 reviews\n\nIn this course, we will explore the smaller side of biology: molecular biology. We’ll cover basic topics including cell biology and how cells can go “rogue” and turn into cancer, how energy from the sun is transferred to fuel our bodies, basics of genetics and inheritance, and genetic technologies. At the end of this course, we will discuss ethical and moral implications of several exciting and new genetic technologies.\n\nSHOW ALL ABOUT THE LITTLE STUFF: ENERGY, CELLS, AND GENETICS\nSHOW ALL"
    },
    {
       "Url":"/learn/the-big-stuff-evolution-and-ecology?specialization=biology-everywhere",
       "name":"The Big Stuff: Evolution and Ecology",
       "Rating":"The Big Stuff: Evolution and Ecology\n4.7\nstars\n15 ratings\n•\n1 reviews\n\nIn this course, we will explore how evolution works to generate new species, the wide variety of life on earth. We will also touch on the importance of biodiversity for the overall health of our planet, and for our well being as humans. Then we will discuss ecology and the interconnectedness of life and touch on one big ecological issue in today’s society, conservation.\n\nSHOW ALL ABOUT THE BIG STUFF: EVOLUTION AND ECOLOGY\nSHOW ALL"
    },
    {
       "Url":"/learn/specialty-topics-biology-across-disciplines?specialization=biology-everywhere",
       "name":"Specialty Topics: Biology Across Disciplines",
       "Rating":"Specialty Topics: Biology Across Disciplines\n\nIn this course, we will explore the applicability and relationship of biology to the arts, business, and psychology. First, we’ll discuss art as a foundational practice to biology and how biology as a science can explain how we interact with the arts, in particular, our experiences making and listening to music. Next, we will discuss the business of biology and how research is funded and the process of clinical trials and human subjects research. Then we will examine two topics at the interface of psychology and biology: (1) human development from conception to adulthood, and (2) how cognition influences how we make decisions about biological issues and best practices for evaluating biological evidence in light of what we know about how we use evidence to make decisions. We will close with a discussion of education and why evidence-based education is important for promoting overall science literacy.\n\nSHOW ALL ABOUT SPECIALTY TOPICS: BIOLOGY ACROSS DISCIPLINES\nSHOW ALL"
    },
    "/specializations/introduction-to-electricity-magnetism",
    {
       "Url":"/learn/physics-102-electric-charges-fields?specialization=introduction-to-electricity-magnetism",
       "name":"Physics 102 - Electric Charges and Fields",
       "Rating":"Physics 102 - Electric Charges and Fields\n\nThis course serves as an introduction to the physics of electricity and magnetism.  Upon completion, learners will have an understanding of how the forces between electric charges are described by fields, and how these fields are related to electrical circuits. They will gain experience in solving physics problems with tools such as graphical analysis, algebra, vector analysis, and calculus.  The course follows the typical progression of topics of a first-semester university physics course:  charges, electric forces, electric fields potential, magnetic fields, currents, magnetic moments, electromagnetic induction, and circuits.  Each module contains reading links to a free textbook, complete video lectures, conceptual quizzes, and a set of homework problems.  Once the modules are completed, the course ends with an exam.  This comprehensive course series is similar in detail and rigor to what is taught on-campus.  It will thoroughly prepare learners for their upcoming introductory physics courses, or more advanced courses in physics.\n\nSHOW ALL ABOUT PHYSICS 102 - ELECTRIC CHARGES AND FIELDS\nSHOW ALL"
    },
    {
       "Url":"/learn/physics-102-electric-potential-and-dc-circuits?specialization=introduction-to-electricity-magnetism",
       "name":"Physics 102 - Electric Potential and DC Circuits",
       "Rating":"Physics 102 - Electric Potential and DC Circuits\n\nThis course serves as an introduction to the physics of electricity and magnetism.  Upon completion, learners will have an understanding of how the forces between electric charges are described by fields, and how these fields are related to electrical circuits. They will gain experience in solving physics problems with tools such as graphical analysis, algebra, vector analysis, and calculus.  The course follows the typical progression of topics of a first-semester university physics course:  charges, electric forces, electric fields potential, magnetic fields, currents, magnetic moments, electromagnetic induction, and circuits.  Each module contains reading links to a free textbook, complete video lectures, conceptual quizzes, and a set of homework problems.  Once the modules are completed, the course ends with an exam.  This comprehensive course series is similar in detail and rigor to what is taught on-campus.  It will thoroughly prepare learners for their upcoming introductory physics courses, or more advanced courses in physics.\n\nSHOW ALL ABOUT PHYSICS 102 - ELECTRIC POTENTIAL AND DC CIRCUITS\nSHOW ALL"
    },
    {
       "Url":"/learn/physics-102-magnetic-fields-faradays-law?specialization=introduction-to-electricity-magnetism",
       "name":"Physics 102 - Magnetic Fields and Faraday's Law",
       "Rating":"Physics 102 - Magnetic Fields and Faraday's Law\n\nThis course serves as an introduction to the physics of electricity and magnetism.  Upon completion, learners will have an understanding of how the forces between electric charges are described by fields, and how these fields are related to electrical circuits. They will gain experience in solving physics problems with tools such as graphical analysis, algebra, vector analysis, and calculus.  The course follows the typical progression of topics of a first-semester university physics course:  charges, electric forces, electric fields potential, magnetic fields, currents, magnetic moments, electromagnetic induction, and circuits.  Each module contains reading links to a free textbook, complete video lectures, conceptual quizzes, and a set of homework problems.  Once the modules are completed, the course ends with an exam.  This comprehensive course series is similar in detail and rigor to what is taught on-campus.  It will thoroughly prepare learners for their upcoming introductory physics courses, or more advanced courses in physics.\n\nSHOW ALL ABOUT  PHYSICS 102  - MAGNETIC FIELDS AND FARADAY'S LAW\nSHOW ALL"
    },
    {
       "Url":"/learn/physics-102-ac-circuits-maxwell-equations?specialization=introduction-to-electricity-magnetism",
       "name":"Physics 102 - AC Circuits and Maxwell's Equations",
       "Rating":"Physics 102 - AC Circuits and Maxwell's Equations\n\nThis course serves as an introduction to the physics of electricity and magnetism.  Upon completion, learners will have an understanding of how the forces between electric charges are described by fields, and how these fields are related to electrical circuits. They will gain experience in solving physics problems with tools such as graphical analysis, algebra, vector analysis, and calculus.  The course follows the typical progression of topics of a first-semester university physics course:  charges, electric forces, electric fields potential, magnetic fields, currents, magnetic moments, electromagnetic induction, and circuits.  Each module contains reading links to a free textbook, complete video lectures, conceptual quizzes, and a set of homework problems.  Once the modules are completed, the course ends with an exam.  This comprehensive course series is similar in detail and rigor to what is taught on-campus.  It will thoroughly prepare learners for their upcoming introductory physics courses, or more advanced courses in physics.\n\nSHOW ALL ABOUT PHYSICS 102 - AC CIRCUITS AND MAXWELL'S EQUATIONS\nSHOW ALL"
    },
    "/specializations/introduction-applied-cryptography",
    {
       "Url":"/learn/classical-cryptosystems?specialization=introduction-applied-cryptography",
       "name":"Classical Cryptosystems and Core Concepts",
       "Rating":"Classical Cryptosystems and Core Concepts\n4.6\nstars\n347 ratings\n•\n78 reviews\n\nWelcome to Introduction to Applied Cryptography.  Cryptography is an essential component of cybersecurity. The need to protect sensitive information and ensure the integrity of industrial control processes has placed a premium on cybersecurity skills in today’s information technology market.  Demand for cybersecurity jobs is expected to rise 6 million globally by 2019, with a projected shortfall of 1.5 million, according to Symantec, the world’s largest security software vendor. According to Forbes, the cybersecurity market is expected to grow from $75 billion in 2015 to $170 billion by 2020. In this specialization, you will learn basic security issues in computer communications, classical cryptographic algorithms, symmetric-key cryptography, public-key cryptography, authentication, and digital signatures. These topics should prove especially useful to you if you are new to cybersecurity Course 1, Classical Cryptosystems, introduces you to basic concepts and terminology related to cryptography and cryptanalysis. It is recommended that you have a basic knowledge of computer science and basic math skills such as algebra and probability.\n\nSHOW ALL ABOUT CLASSICAL CRYPTOSYSTEMS AND CORE CONCEPTS\nSHOW ALL"
    },
    {
       "Url":"/learn/mathematical-foundations-cryptography?specialization=introduction-applied-cryptography",
       "name":"Mathematical Foundations for Cryptography",
       "Rating":"Mathematical Foundations for Cryptography\n4.6\nstars\n260 ratings\n•\n52 reviews\n\nWelcome to Course 2 of Introduction to Applied Cryptography. In this course, you will be introduced to basic mathematical principles and functions that form the foundation for cryptographic and cryptanalysis methods. These principles and functions will be helpful in understanding symmetric and asymmetric cryptographic methods examined in Course 3 and Course 4. These topics should prove especially useful to you if you are new to cybersecurity. It is recommended that you have a basic knowledge of computer science and basic math skills such as algebra and probability.\n\nSHOW ALL ABOUT MATHEMATICAL FOUNDATIONS FOR CRYPTOGRAPHY\nSHOW ALL"
    },
    {
       "Url":"/learn/symmetric-crypto?specialization=introduction-applied-cryptography",
       "name":"Symmetric Cryptography",
       "Rating":"Symmetric Cryptography\n4.6\nstars\n203 ratings\n•\n39 reviews\n\nWelcome to Symmetric Cryptography! \n\nSymmetric cryptography relies on shared secret key to ensure message confidentiality, so that the unauthorized attackers cannot retrieve the message. The course describes substitution and transposition techniques, which were the bases for classical cryptography when the message is encoded in natural language such as English. Then, we build on product ciphers (using both substitution and transposition/permutation) to describe modern block ciphers and review the widely used cipher algorithms in DES, 3-DES, and AES. Lastly, we enable the use of block ciphers to support variable data length by introducing different modes of block cipher operations in ECB, CBC, CFB, OFB, and CTR modes.\n\nThis course is cross-listed and is a part of the two specializations, the Applied Cryptography specialization and the Introduction to Applied Cryptography specialization.\n\nSHOW ALL ABOUT SYMMETRIC CRYPTOGRAPHY\nSHOW ALL"
    },
    {
       "Url":"/learn/asymmetric-crypto?specialization=introduction-applied-cryptography",
       "name":"Asymmetric Cryptography and Key Management",
       "Rating":"Asymmetric Cryptography and Key Management\n4.7\nstars\n210 ratings\n•\n28 reviews\n\nWelcome to Asymmetric Cryptography and Key Management! \n\nIn asymmetric cryptography or public-key cryptography, the sender and the receiver use a pair of public-private keys, as opposed to the same symmetric key, and therefore their cryptographic operations are asymmetric. This course will first review the principles of asymmetric cryptography and describe how the use of the pair of keys can provide different security properties. Then, we will study the popular asymmetric schemes in the RSA cipher algorithm and the Diffie-Hellman Key Exchange protocol and learn how and why they work to secure communications/access. Lastly, we will discuss the key distribution and management for both symmetric keys and public keys and describe the important concepts in public-key distribution such as public-key authority, digital certificate, and public-key infrastructure. This course also describes some mathematical concepts, e.g., prime factorization and discrete logarithm, which become the bases for the security of asymmetric primitives, and working knowledge of discrete mathematics will be helpful for taking this course; the Symmetric Cryptography course (recommended to be taken before this course) also discusses modulo arithmetic.\n\nThis course is cross-listed and is a part of the two specializations, the Applied Cryptography specialization and the Introduction to Applied Cryptography specialization.\n\nSHOW ALL ABOUT ASYMMETRIC CRYPTOGRAPHY AND KEY MANAGEMENT\nSHOW ALL"
    },
    "/specializations/animals-society",
    {
       "Url":"/learn/animals-self-society?specialization=animals-society",
       "name":"Animals, Self, and Society",
       "Rating":"Animals, Self, and Society\n4.8\nstars\n65 ratings\n•\n18 reviews\n\nThis course explores how animals and people are situated within the web of structures and connections known as “society.” Module 1 considers some of the key symbolic roles that animals play in society by investigating the practice of “thinking with animals.” We investigate how people construct different meanings of animals and the implications these meanings have for both animals and humans. You will gain first-hand experience of this by analyzing how animals are represented in the media. Modules 2 and 3 investigate human-animal relationships, including those that involve suffering as well as those that are beneficial. Although many people describe their pets as friends or family members, Module 2 takes a deeper dive into what constitutes friendship and family membership where other species are concerned. Module 3 examines the dark side of these relationships, focusing on animal abuse and its relationship to domestic violence. Module 4 focuses on people’s encounters with those animals outside the boundaries of the home and the farm. The way people understand and regard the species commonly considered “wild” shapes the treatment and moral status of these animals.\n\nSHOW ALL ABOUT ANIMALS, SELF, AND SOCIETY\nSHOW ALL"
    },
    {
       "Url":"/learn/animals-institutions?specialization=animals-society",
       "name":"Animals and Institutions",
       "Rating":"Animals and Institutions\n4.9\nstars\n25 ratings\n•\n6 reviews\n\nThis course explores animals within the context of the functional relationships that sociologists call “institutions.” We first examine the use of animals in laboratory science. We then examine the controversial transformation of animals into “livestock” and \"meat.\" We also explore the perspectives of people committed to rejecting the construction and use of animals as food. Next, we focus on some of the roles of animals in human entertainment with particular attention to dog fighting and zoos. Finally, we investigate animal health and welfare through the lens of dilemmas in veterinary medicine and decisions in animal shelters.\n\nSHOW ALL ABOUT ANIMALS AND INSTITUTIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/perception-of-animals?specialization=animals-society",
       "name":"The Changing Status and Perception of Animals",
       "Rating":"The Changing Status and Perception of Animals\n4.9\nstars\n34 ratings\n•\n7 reviews\n\nIn this course,  we explore how mainstream understandings of animals and human-animal relationships have changed in recent years. Module 1 focuses on the roles of animals in human physical health and psychological well being. Module 2 explores animal selfhood, particularly in light of their inability to use spoken language. Finally, Module 3 examines some of the collective efforts undertaken when the treatment or use of animals comes to be seen as inhumane, immoral, and worthy of ameliorative social action.\n\nSHOW ALL ABOUT THE CHANGING STATUS AND PERCEPTION OF ANIMALS\nSHOW ALL"
    },
    "/specializations/our-responses-climate-change",
    {
       "Url":"/learn/what-is-climate-change?specialization=our-responses-climate-change",
       "name":"What is Climate Change?",
       "Rating":"What is Climate Change?\n4.9\nstars\n21 ratings\n•\n5 reviews\n\nIn this course, learners will become familiar with the scientific evidence that demonstrates human-caused climate change. We will explore how greenhouse gases cause the Earth to warm, and why our recent warming is attributed to human activities. We will also discuss where our climate is headed, including anticipated future temperature, precipitation, and sea level. Learners will engage with the consequences of these changes on our ecosystems, infrastructure, and communities. We will also identify how political beliefs influence our attitudes about climate change, and apply that knowledge to become better climate communicators.\n\nSHOW ALL ABOUT WHAT IS CLIMATE CHANGE?\nSHOW ALL"
    },
    {
       "Url":"/learn/how-do-we-manage-climate-change?specialization=our-responses-climate-change",
       "name":"How Do We Manage Climate Change?",
       "Rating":"How Do We Manage Climate Change?\n4.9\nstars\n14 ratings\n•\n2 reviews\n\nIn this course, learners will identify the types of actions that we can pursue to address climate change. These actions fall into two broad categories: 1) mitigation, which refers to efforts to reduce greenhouse gas emissions or enhance carbon sinks, and 2) adaptation, which refers to our preparations for climate impacts. We will explore the technologies, programs, and policies related to both mitigation and adaptation. Learners should leave the course with an improved ability to identify and evaluate climate actions undertaken by communities, governments, and businesses.\n\nSHOW ALL ABOUT HOW DO WE MANAGE CLIMATE CHANGE?\nSHOW ALL"
    },
    {
       "Url":"/learn/planning-with-climate-change-in-mind?specialization=our-responses-climate-change",
       "name":"Planning with Climate Change in Mind",
       "Rating":"Planning with Climate Change in Mind\n\nThis course focuses on the climate impacts occurring and expected to occur across the United States. Our approach will be regional and sectoral, with consideration of impacts on water resources, transportation, energy, agriculture, forests, health, and coastal/marine resources. We will also look at how you can apply information about climate risks to motivate climate action in your household, in your community, or in your workplace.\n\nSHOW ALL ABOUT PLANNING WITH CLIMATE CHANGE IN MIND\nSHOW ALL"
    },
    "/specializations/international-marketing",
    {
       "Url":"/learn/intro-international-marketing?specialization=international-marketing",
       "name":"Intro to International Marketing",
       "Rating":"Intro to International Marketing\n4.7\nstars\n824 ratings\n•\n203 reviews\n\nAbout this Course\n\nThis course brings together two key subjects, International Marketing and Cross Industry Innovation. It will provide the basic foundations of international marketing and then explain how companies can grow by going abroad or sourcing ideas/expanding into other countries or industries. This is summarized as CCCI: Cross-Country and Cross-Industry Innovation, a term and analytical platform used throughout not only this course but others in the specialization. As an introductory course, we keep the concepts short and simple in order to ease learners into the wonderful world of international marketing. More specific operational aspects such as managing the product, price, place and promotion as well as targeting and positioning will be provided in the second course of the specialization. \n\nAfter you successfully complete this course learners will obtain the following outcomes:\n\n(1) an understanding of the core meaning of marketing and international marketing. \n(2) learn that international marketing is about striking the right balance between maximizing the similarities across cultures (Etic approach) and customizing marketing (Emic approach) to important local differences.\n(3) learn about how to source or expand into other industries at home or abroad via cross industry innovation.\n(4) obtain a solid foundation for subsequent courses such as course 2 (International Marketing Entry and Execution) and the industry-specific courses in the specialization.\n\nSHOW ALL ABOUT INTRO TO INTERNATIONAL MARKETING\nSHOW ALL"
    },
    {
       "Url":"/learn/international-marketing-entry-execution?specialization=international-marketing",
       "name":"International Marketing Entry and Execution",
       "Rating":"International Marketing Entry and Execution\n4.7\nstars\n254 ratings\n•\n41 reviews\n\nThis will be part 2 of a two-series foundation courses for the Specialization: International Marketing & Cross Industry Growth. This course will dive in more deeply into consumer science investigation, B2C marketing, International Marketing Entry, Targeting, Positioning, International Product, International Promotion, International Place and International Price. The last set of classes will discuss seven new ways to innovate in International Marketing that all start with the letter \"S\" and hence will be called the 7S International Marketing Innovation. There will be a heavy emphasis on how companies can incorporate CCCI Innovation, i.e. Cross Country and Cross Industry Innovation in marketing.\n\nAfter you successfully complete this course learners will obtain the following outcomes:\n\n(1) from a business to consumer standpoint (B2C), learn how to approach consumers as science investigators.\n(2) an understanding of how to enter international markets, select targets and position their brands.\n(3) achieve deeper insights into the core meaning of international marketing elements, i.e. product, promotion, place, and price in the international marketing context, and their inter-element relationships with each other.\n(4) acquire new thinking about innovating in marketing with the 7S approach: social, small, simple, skip, sports, screen, and set marketing with cross-country and cross-industry innovation implications.\n\nSHOW ALL ABOUT INTERNATIONAL MARKETING ENTRY AND EXECUTION\nSHOW ALL"
    },
    {
       "Url":"/learn/b2b-marketing?specialization=international-marketing",
       "name":"International B2B (Business to Business) Marketing",
       "Rating":"International B2B (Business to Business) Marketing\n4.6\nstars\n442 ratings\n•\n92 reviews\n\nThis course offers a unique perspective into the differentiating aspects of business to business (B2B) marketing that can be contrasted to traditional business to consumer (B2C) marketing that is the subject of most other marketing curricula. Moreover, as one of the courses in the Specialization: International Marketing & Cross Industry Growth, here too there is an emphasis on how companies can expand by cross-country and cross-industry innovation.  \n\nBy taking this course learners will obtain the following outcomes:\n\n(1) understand the differences between B2C and B2B marketing.\n(2) approach marketing problems from an inter-organizational perspective, in particular, learn about decision making at buying centers.\n(3) innovate B2B marketing via a CCCI, i.e. Cross Country & Cross Industry Innovation approach.\n(4) gain insights about CCCI Innovation and best practices via interviews with top B2B industry experts.\n\nSHOW ALL ABOUT INTERNATIONAL B2B (BUSINESS TO BUSINESS) MARKETING\nSHOW ALL"
    },
    {
       "Url":"/learn/healthcare-marketing-hospitality-management?specialization=international-marketing",
       "name":"International Hospitality & Healthcare Services Marketing",
       "Rating":"International Hospitality & Healthcare Services Marketing\n4.7\nstars\n401 ratings\n•\n111 reviews\n\nAs the fastest-growing sectors of the current global economy, both hospitality and healthcare services sector offer tremendous growth opportunities for incumbents and entrepreneurial opportunities for new entrants. To flourish on these opportunities, one must first understand each industry's unique characteristics. This course is designed to help those who are interested in career advancement opportunities in these industries or who want to be inspired by these industries to better equip themselves with enlightened and creative management capabilities. \n\nPeople who have successfully completed this course will be able to:\n\n(1)\tIdentify the unique characteristics of service businesses and create successful management strategies to better manage the role of customers to gain desirable business outcomes, better market products than are intangible, and better manage customer expectations and perceptions.\n(2)\tIdentify the unique characteristics of the hospitality industry, explain the process of balancing supply and demand in the hospitality industry, and implement optimal marketing and management strategies for this unique market.\n(3)   Identify the unique characteristics of the healthcare industry, explain how this industry is evolving into the experience business, and better manage human interactions and facility to enhance the quality of customer experience.\n(4)   Gain insights from the innovative approaches in the service industry overall, in hospitality and health industry in particular, and better develop innovative strategies in your industry.\n\nSHOW ALL ABOUT INTERNATIONAL HOSPITALITY & HEALTHCARE SERVICES MARKETING\nSHOW ALL"
    },
    {
       "Url":"/learn/international-entertainment-sports-marketing?specialization=international-marketing",
       "name":"International Entertainment and Sports Marketing",
       "Rating":"International Entertainment and Sports Marketing\n4.7\nstars\n383 ratings\n•\n92 reviews\n\nThis course will provide learners with a fundamental understanding of the characteristics and marketing strategies related to two key global industries, sports and entertainment. The growth in both industries have been fueled by their ability to innovate via CCCI, i.e. cross-country and cross-industry expansion. There will be a graded quiz that will consists of 10 questions during the first two weeks (together worth 50% of the grade)  and a final quiz that contains 20 questions (worth 50% of the grade) in the third week. \n\nPeople who successfully complete this course will obtain the following outcomes:\n\n(1) You will learn the key characteristics of sports marketing.\n(2) You will learn the key characteristics of entertainment marketing.\n(3) You will be able to apply cross country growth strategies to your business in the sports and entertainment industry. \n(4) You will be able to apply cross industry growth strategies to your business in the sports and entertainment industry”. \n(5) You will be able to reference CCCI, i.e. cross-country and cross-industry Innovation best practices via interviews with key experts in the sports and entertainment industry such as from adidas, Audi, and YG Entertainment (home to Psy and Gangnam Style).\n\nSHOW ALL ABOUT INTERNATIONAL ENTERTAINMENT AND SPORTS MARKETING\nSHOW ALL"
    },
    {
       "Url":"/learn/international-vertical-marketing-capstone-project?specialization=international-marketing",
       "name":"International Marketing & Cross Industry Growth Capstone Project",
       "Rating":"International Marketing & Cross Industry Growth Capstone Project\n4.7\nstars\n39 ratings\n•\n8 reviews\n\nThis course will act as the culmination of the Specialization: International Marketing & Cross Industry Growth. The aim is to help you apply what you have learned during the 16 weeks of the 5 courses and conduct an \"action learning\" project that will consist of the following:\n\n1. Situation Analysis for their chosen company or brand.\n2. Marketing Mix Analysis for their chosen company or brand.\n3. Cross Country Innovation Plan when expanding abroad.\n4. Cross Industry Innovation Plan when sourcing ideas or expanding into another industry.\n\nAll of these analyses will have templates that will be explained in the video lectures using an exemplar case, \"Yuhan Kimberly.\" You will be required to choose a company on which these analyses will be performed. As such, the intent will be to provide you an integrated set of insights and application to a chosen managerial situation and problems at hand in the context of a specific region or country. You will be required to also choose another industry (from the ones covered in the Specialization: B2C, B2B, Healthcare, Hospitality, Entertainment, Sports) when developing your Cross Industry Innovation Plan. For example, if you work for a company in the Healthcare industry and have analyzed that company, you should then conduct a Cross Industry Innovation project using concepts from a different industry such as Entertainment.\n\nSHOW ALL ABOUT INTERNATIONAL MARKETING & CROSS INDUSTRY GROWTH CAPSTONE PROJECT  \nSHOW ALL"
    },
    "/specializations/beginning-application-developer",
    {
       "Url":"/learn/application-programming-fundamentals?specialization=beginning-application-developer",
       "name":"Application Programming Fundamentals",
       "Rating":"Application Programming Fundamentals\n\nIn Object-Oriented Concepts, we will introduce the core concepts behind modern, object-oriented, programming.  We will discuss objects, classes, messaging, inheritance, polymorphism, and more.  As with Fundamentals of Programming, we will illustrate the concepts using the Python language, but they will be portable to other object-oriented programming languages.\n\nThis course includes hands-on labs where you will learn to write and execute programs.\n\nSHOW ALL ABOUT APPLICATION PROGRAMMING FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/concepts-of-object-oriented-programming?specialization=beginning-application-developer",
       "name":"Object-Oriented Programming Concepts",
       "Rating":"Object-Oriented Programming Concepts\n\nIn Object-Oriented Concepts, we will introduce the core concepts behind modern, object-oriented, programming.  We will discuss objects, classes, messaging, inheritance, polymorphism, and more.  As with Fundamentals of Programming, we will illustrate the concepts using the Python language, but they will be portable to other object-oriented programming languages.\n\nSHOW ALL ABOUT OBJECT-ORIENTED PROGRAMMING CONCEPTS\nSHOW ALL"
    },
    {
       "Url":"/learn/essential-programming-tools?specialization=beginning-application-developer",
       "name":"Essential Tools For Application Development",
       "Rating":"Essential Tools For Application Development\n\nIn Essential Tools, we will look at two important classes of tools for developers: Version Control Systems and Built Automation Tools.  We will look why we use such tools, discuss common concepts for those categories of tools, and then look at a specific and common example of each: Apache® Subversion® for version control, and Apache® Maven™ for build automation.\n\nSHOW ALL ABOUT ESSENTIAL TOOLS FOR APPLICATION DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/development-methodologies-overview?specialization=beginning-application-developer",
       "name":"Development Methodologies Overview",
       "Rating":"Development Methodologies Overview\n\nThis course provides an introduction to a few of the main development methodologies used by application programmers today. These methodologies provide a framework and structure for the process of development to ensure teams can work together and all critical steps are followed. We'll discuss the Software Development Lifecycle (SDLC), Agile concepts, Continuous Integration/Continuous Delivery and 12 Factor for cloud development.\n\nNo previous development experience is necessary to complete this course, and there are no specific hardware or software requirements outside of the Coursera environment.\n\nSHOW ALL ABOUT DEVELOPMENT METHODOLOGIES OVERVIEW\nSHOW ALL"
    },
    "/specializations/anaplan-connected-planning-business-transformation",
    {
       "Url":"/learn/ocp?specialization=anaplan-connected-planning-business-transformation",
       "name":"Overview of Connected Planning",
       "Rating":"Overview of Connected Planning\n\nConnected Planning is a technology-enabled approach to business planning that transforms the way organizations use their data, people, and plans. Decision makers, and ultimately the entire organization, plan and pivot with confidence when faced with changes, whether in an organization, the marketplace, or even the global economy. \n\nFrom this Introduction to Connected Planning, you’ll understand its history in business modeling and scenario planning, the trends that make it essential to business success today, and the measurable impact that Connected Planning has had on organizations.\n\nBy the end of this course, you’ll be able to:\n•\tDescribe the key characteristics of Connected Planning\n•\tUnderstand the history of Connected Planning and its roots in business modeling and scenario planning\n•\tExplain why current events and trends are leading many organizations to adopt Connected Planning \n•\tArticulate the benefits of Connected Planning\n\nThis course is presented by Anaplan, provider of a leading technology platform that is purpose-built for Connected Planning.\n\nSHOW ALL ABOUT OVERVIEW OF CONNECTED PLANNING\nSHOW ALL"
    },
    {
       "Url":"/learn/cpia?specialization=anaplan-connected-planning-business-transformation",
       "name":"Connected Planning in Action",
       "Rating":"Connected Planning in Action\n\nEffective planning isn’t just an annual top-down strategic planning and budgeting exercise. To adapt in the turbulent global economy, successful organizations plan in real-time, across the organization, at all times. By leveraging a Connected Planning approach and technology, organizations around the world are finding ways to not only survive, but thrive.\n\nIn this course, you’ll explore examples of how Connected Planning transforms the way organizations do business. Using real-life case studies from the Finance, Sales, Supply Chain, and Human Resources functions, you’ll see a wide range of Connected Planning examples and benefits. Most significantly, Connected Planning is cross-functional, which generates even greater impact for an organization.\n\nBy the end of this course, you’ll be able to:\n•\tExplain how Connected Planning provides the link between strategic planning and operational execution\n•\tDescribe a range of ways that organizations apply Connected Planning within and across functions\n•\tArticulate the benefits of Connected Planning\n\n\nThis course is presented by Anaplan, provider of a leading technology platform that is purpose-built for Connected Planning.\n\nSHOW ALL ABOUT CONNECTED PLANNING IN ACTION\nSHOW ALL"
    },
    {
       "Url":"/learn/icp?specialization=anaplan-connected-planning-business-transformation",
       "name":"Implementing Connected Planning",
       "Rating":"Implementing Connected Planning\n\nFrom this course, you’ll understand how to make Connected Planning a reality in an organization. Organizations need a vision supported by a focused effort to move from traditional planning and static business modeling to a Connected Planning approach--where data, people, and plans are linked throughout the organization.\n\nCreating a digital ecosystem using a Connected Planning technology platform is a big part of the process, but it’s not the only thing needed. In this course, we’ll explore the role of corporate culture and sponsorship, process redesign, master data management, and change management to successfully implement Connected Planning.\n\nYou’ll be challenged to examine your own organization’s readiness to undertake the Connected Planning journey. If you’re not ready yet, you’ll identify areas where you need to focus your efforts. If you are ready, you’ll have the framework you need to get started on the path to make Connected Planning a reality in your organization.\n\nBy the end of this course, you’ll be able to:\n•\tIdentify challenges to a Connected Planning implementation stemming from issues with people, data, and planning processes\n•\tArticulate the benefits of Connected Planning over traditional planning and static business modeling\n•\tExplain why corporate culture, data management, and change management are critical to successful Connected Planning execution\n•\tDrive or constructively participate in the implementation of Connected Planning in your organization\n\nThis course is presented by Anaplan, provider of a leading technology platform that is purpose-built for Connected Planning.\n\nSHOW ALL ABOUT IMPLEMENTING CONNECTED PLANNING\nSHOW ALL"
    },
    {
       "Url":"/learn/capstone-connected-planning-for-business-transformation?specialization=anaplan-connected-planning-business-transformation",
       "name":"Capstone: Connected Planning for Business Transformation",
       "Rating":"Capstone: Connected Planning for Business Transformation\n\nThis course is the capstone project for learners completing the Connected Planning for Business Transformation specialization. In this project, you will develop a rationale and roadmap for Connected Planning implementation in your own organization. \n\nBy examining the current state of planning in the organization, identifying specific areas where Connected Planning will deliver significant benefits, and addressing organizational obstacles, you will prepare yourself to advocate for Connected Planning, drive its adoption in your organization, and help transform your business.\n\nThis course is presented by Anaplan, provider of a leading technology platform that is purpose-built for Connected Planning.\n\nSHOW ALL ABOUT CAPSTONE: CONNECTED PLANNING FOR BUSINESS TRANSFORMATION\nSHOW ALL"
    },
    "/specializations/healthcare-trends-business-professionals",
    {
       "Url":"/learn/healthcareconsumerism?specialization=healthcare-trends-business-professionals",
       "name":"Healthcare Consumerism and Implication for Care Delivery",
       "Rating":"Healthcare Consumerism and Implication for Care Delivery\n4.5\nstars\n53 ratings\n•\n11 reviews\n\nIn this course we will examine the changing role of the consumer in healthcare. Consumers are asking for more accountability in how healthcare is delivered and paid for. Healthcare professionals must make sure that they are delivering high quality, personalized care. \n\nSome of the topics we'll cover are: the healthcare ecosystem, new technologies in healthcare, the development of new payment models, change management in healthcare, data analytics.\n\nBy the end of this course, you will be able to:\n1. Explain the new role of consumers in healthcare delivery in order to respond to the demands in this changing industry\n2. Identify the key players in the healthcare ecosystem\n3. Describe how the healthcare system operates and its impact on consumer-driven healthcare.\n4. Articulate the challenges facing consumers and providers in order to find potential solutions for these challenges.\n\nSHOW ALL ABOUT HEALTHCARE CONSUMERISM AND IMPLICATION FOR CARE DELIVERY \nSHOW ALL"
    },
    {
       "Url":"/learn/healthcare-payment-models?specialization=healthcare-trends-business-professionals",
       "name":"Future Healthcare Payment Models",
       "Rating":"Future Healthcare Payment Models\n4.5\nstars\n25 ratings\n•\n9 reviews\n\nThis course will review the drivers of healthcare cost and solutions that have been proposed to address cost, quality and value of health care. Many point blame for high costs on payment models that pay healthcare providers for every service they provide to patients, essentially paying more for volume and service intensity. This is called a Fee for Service (FFS) payment model. Some solutions, arguably the more sustainable solutions, are the combined strategies of new payment models, care management, insurance plan designs, consumer engagement tools, and technology. \n\nUsing that information we will explore various situations, showcasing coordinated care and payment strategies that can be implemented to improve patient health and the cost of delivery of healthcare services.\n\nBy the end of this course, the learner should be able to: \n\n1. Identify the drivers and trends of healthcare spending from the perspective of various stakeholders, including medical providers, insurers, government and private purchasers and payments\n2. Critically assess the impact of strategic and financial approaches that have been put in place by the ACA and the various modifications. \n3. Evaluate how healthcare payment models currently work and the new direction that value-based payment is taking.\n4.Identify how financial and non-financial metrics can be appropriately combined to improve a healthcare stakeholders’ value proposition.\n\nSHOW ALL ABOUT  FUTURE HEALTHCARE PAYMENT MODELS\nSHOW ALL"
    },
    {
       "Url":"/learn/quality-of-healthcare?specialization=healthcare-trends-business-professionals",
       "name":"Evaluating the Quality of Healthcare Delivery",
       "Rating":"Evaluating the Quality of Healthcare Delivery\n4.6\nstars\n13 ratings\n•\n1 reviews\n\nIn this course, you will have the opportunity to learn about the great progress that has been made in measuring and evaluating quality of care.  We will discuss key concepts and methods.  You will also learn about how to use websites for comparing the quality of healthcare providers.  The course content is intended for a wide range of participants – for example, people who have a general interest in quality of care, consumers seeking information about how to choose a provider for themselves or family members, or leaders of business organizations who are responsible for employee health insurance benefits and network of providers.\n\nBy the end of this course, the learner should be able to: \n\n1. Explain key developments regarding how quality of care is measured and evaluated in the US.\n2. Articulate basic framework for evaluating quality of outcomes of care including types of and criteria for selecting quality measures for evaluating and comparing providers. \n3. Discuss scientific issues and challenges for evaluating quality of care and methods for addressing these challenges.   \n4. Identify and apply resources and tools for comparing the quality of care of providers.\n\nSHOW ALL ABOUT EVALUATING THE QUALITY OF HEALTHCARE DELIVERY\nSHOW ALL"
    },
    {
       "Url":"/learn/artificialintelligence-in-healthcare?specialization=healthcare-trends-business-professionals",
       "name":"Business Application of Machine Learning and Artificial Intelligence in Healthcare",
       "Rating":"Business Application of Machine Learning and Artificial Intelligence in Healthcare\n4.2\nstars\n50 ratings\n•\n9 reviews\n\nThe future of healthcare is becoming dependent on our ability to integrate Machine Learning and Artificial Intelligence into our organizations. But it is not enough to recognize the opportunities of AI; we as leaders in the healthcare industry have to first determine the best use for these applications ensuring that we focus our investment on solving problems that impact the bottom line. \n\nThroughout these four modules we will examine the use of decision support, journey mapping, predictive analytics, and embedding Machine Learning and Artificial Intelligence into the healthcare industry. By the end of this course you will be able to:\n\n1. Determine the factors involved in decision support that can improve business performance across the provider/payer ecosystem.\n\n2. Identify opportunities for business applications in healthcare by applying journey mapping and pain point analysis in a real world context.\n\n3. Identify differences in methods and techniques in order to appropriately apply to pain points using case studies.\n\n4. Critically assess the opportunities to leverage decision support in adapting to trends in the industry.\n\nSHOW ALL ABOUT BUSINESS APPLICATION OF MACHINE LEARNING AND ARTIFICIAL INTELLIGENCE IN HEALTHCARE\nSHOW ALL"
    },
    "/specializations/ios-development",
    {
       "Url":"/learn/objective-c?specialization=ios-development",
       "name":"Foundations of Objective-C App Development",
       "Rating":"Foundations of Objective-C App Development\n4.6\nstars\n543 ratings\n•\n177 reviews\n\nAn introduction to the Objective-C programming language.  This will prepare you for more extensive iOS app development and build a foundation for advanced iOS development topics.\n\nObjective-C programming requires a Mac laptop or desktop computer.  An iOS device is optional if the learner is willing to working exclusively with the simulator.  Some learners have been able to work with an OS X virtual machine on Windows, but explaining how to do that is beyond the scope of this course.\n\nUpon completing this course, you will be able to:\n1.       Read and write Objective-C\n2.       Have a strong grasp of Objective-C objects\n3.       Organize their code professionally using objects and blocks\n4.       Prototype several entry-level apps\n\nSHOW ALL ABOUT FOUNDATIONS OF OBJECTIVE-C APP DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/security?specialization=ios-development",
       "name":"Networking and Security in iOS Applications",
       "Rating":"Networking and Security in iOS Applications\n4.5\nstars\n250 ratings\n•\n70 reviews\n\nYou will learn to extend your knowledge of making iOS apps so that they can securely interact with web services and receive push notifications. You'll learn how to store data securely on a device using Core Data.  You’ll also learn to securely deploy apps to the App Store and beta users over-the-air.\n\nThe format of the course is through a series of code tutorials.  We will walk you through the creation of several apps that you can keep as a personal app toolbox.  When you make your own apps after this course, you can bring in these capabilities as needed.  When necessary we pop out of the code tutorials to talk about concepts at a higher level so that what you are programming makes sense.\n\nUpon completing this course, you will be able to:\n1.       Post Facebook, Twitter, Sina Weibo, Tencent Weibo messages to social media using single sign-on on behalf of a user.\n2.       Use OAuth 2.0 to securely authenticate to Instagram and retrieve photos on behalf of a user\n3.       JSON\n4.       Describe JSON’s syntax\n5.       Write well-formed JSON\n6.       Work with JSON data objects in Objective-C\n7.       Appropriately set the security settings for App Transport Security in iOS 9.0\n8.       Use http, https and https with perfect forward secrecy to fetch web resources\n9.       Obtain permissions to receive local push notifications\n11.       Write an app that can send and receive local push notifications\n12.       Obtain permissions to receive remote push notifications\n13.       Write an app that can receive remote push notifications\n14.       Authenticate using Apple’s cryptographic services such that the developer can use 3rd party infrastructure to send remote push notifications to their app.\n15.       Securely store data on the user’s device.\n16.       Authenticate using Apple’s cryptographic services such that they can deploy an app to the app store\n\nSHOW ALL ABOUT NETWORKING AND SECURITY IN IOS APPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/ui?specialization=ios-development",
       "name":"Best Practices for iOS User Interface Design",
       "Rating":"Best Practices for iOS User Interface Design\n4.6\nstars\n184 ratings\n•\n45 reviews\n\nYou will learn to develop sophisticated user interfaces for iOS, with a focus on user interface design best practices, UI animations, and responsive design. You will learn about the key UI widgets, mapping interfaces and view restoration."
    },
    {
       "Url":"/learn/games?specialization=ios-development",
       "name":"Games, Sensors and Media",
       "Rating":"Games, Sensors and Media\n4.5\nstars\n55 ratings\n•\n9 reviews\n\nYou will learn to make fluid digital interactive experiences that are suitable for gaming and use the advanced sensor hardware built into the iPhone and iPad. This includes drawing 2D graphics, playing sounds and music, integrating with Game Center, the iOS physics engine and detecting device orientation and location.\n\nUpon completing this course, you will be able to:\n1.       Use the reverse geocode service to convert latitude and longitude to location names\n2.       Implement GeoFences to make an app efficiently monitor an iOS device’s location\n3.       Leverage the power of accelerometers, magnetometers and gyroscopes to orient a device in physical space\n4.       Create an app that responds to ambient light levels by using screen brightness as a proxy\n5.       Play sound effects and other media as audio\n6.       Make a game like Pong\n7.       Make a game like Breakout\n8.       Manipulate graphics in a game environment\n9.       Use the physics engine to create realistic game worlds\n10.     React to multi-touch events for complex interaction design\n11.     Detect and respond to collisions and contacts efficiently\n12.     Chain complex sequences of actions, animations and sounds with precision\n13.     Animate multi-frame sprites\n14.     Create particle systems to simulate fire, smoke and magic (and more!)\n15.     Interface with Game Center to create leaderboards and achievements that can be shared through social networks\n\nSHOW ALL ABOUT GAMES, SENSORS AND MEDIA\nSHOW ALL"
    },
    {
       "Url":"/learn/iosswift?specialization=ios-development",
       "name":"Toward the Future of iOS Development with Swift",
       "Rating":"Toward the Future of iOS Development with Swift\n3.8\nstars\n79 ratings\n•\n26 reviews\n\nAn introduction to the Swift programming language.  This will prepare you for more extensive iOS app development and build a foundation for advanced iOS development topics.\n\nUpon completing this course, you will be able to:\n1.       Associate the relationship of Swift and Objective-C and their use in iOS and Mac (OS X) programming\n2.       Develop the ability to read and write Swift code\n3.       Distinguish how both programming languages can be used together in applications\n4.       Demonstrate how to write applications entirely in Swift with the help from several iOS programming samples\n5.       Determine how Swift can be used for development on new platforms such as Apple Watch and Apple TV\n6.       Create a working client-server iPhone application with location services that you can add to your portfolio.\n\nSHOW ALL ABOUT TOWARD THE FUTURE OF IOS DEVELOPMENT WITH SWIFT\nSHOW ALL"
    },
    {
       "Url":"/learn/transreality-gaming?specialization=ios-development",
       "name":"iOS Project: Transreality Game",
       "Rating":"iOS Project: Transreality Game\n4.9\nstars\n10 ratings\n•\n2 reviews\n\nStudents will produce a networked game that will leverage sensors on the phone to create a unique gaming experience.  The focus of the game will be to make it physical through real-world gestures, motion and knowledge of other players real-world location.  To do this students will need to integrate knowledge of graphics, networking, sensors, and user interface design alongside a skill set of tool usage.  The final project will involve milestones with opportunities to get ungraded peer review feedback from fellow learners so that they can iterate and improve their game program.  The final networked game that the students produce would be something they could showcase in job application materials, in an interview, or offer in the iTunes store.\n\nSHOW ALL ABOUT IOS PROJECT: TRANSREALITY GAME\nSHOW ALL"
    },
    "/specializations/academic-skills",
    {
       "Url":"/learn/digital-literacy?specialization=academic-skills",
       "name":"Information & Digital Literacy for University Success",
       "Rating":"Information & Digital Literacy for University Success\n4.9\nstars\n1,872 ratings\n•\n481 reviews\n\nThis Specialization is aimed at preparing students for undergraduate study in an English-speaking university. The course equips you for full participation and engagement with your studies by building awareness and understanding of the core values and expectations of academic culture, and providing you with practical strategies to apply to your studies. In this course, you will learn how to develop your Information & Digital Literacy Skills to help you achieve success in your university studies.  After completing this course, you will be able to:\n\n1.\tAccess and search for information efficiently and effectively using a variety of digital tools. \n\n2.\tCritically evaluate the reliability of sources for an academic context.\n\n3.\tFilter, manage and organize information from a wide variety of sources for use in academic study.\n\n4.\tDemonstrate awareness of ethical issues related to academic integrity surrounding the access and use of information.\n\n5.\tUnderstand how to use digital tools for referencing and attribution in order to avoid plagiarism.\n\n6.\tUnderstand how to disseminate and communicate information in a professional way, including managing digital identity and building networks for learning and research.\n\nSHOW ALL ABOUT INFORMATION & DIGITAL LITERACY FOR UNIVERSITY SUCCESS\nSHOW ALL"
    },
    {
       "Url":"/learn/problem-solving-skills?specialization=academic-skills",
       "name":"Problem-Solving Skills for University Success",
       "Rating":"Problem-Solving Skills for University Success\n4.9\nstars\n910 ratings\n•\n201 reviews\n\nIn this course, you will learn how to develop your Problem Solving and Creativity Skills to help you achieve success in your university studies. After completing this course, you will be able to:\n\n1. Recognise the importance and function of problem solving and creative thought within academic study and the role of critical thought in creative ideation.\n\n2. Develop a toolkit to be able to identify real problems and goals within ill-defined problems\n\n3. Recognize and apply analytical problem solving techniques\n\n4. Recognise and apply creative problem solving techniques\n\n5. Identify the use of creativity within and types of problems most common to your field \n\n6. Apply learnt problem solving and creative ideation skills to a real-life context and reflect on personal learning processes\n\nSHOW ALL ABOUT PROBLEM-SOLVING SKILLS FOR UNIVERSITY SUCCESS\nSHOW ALL"
    },
    {
       "Url":"/learn/critical-thinking-skills?specialization=academic-skills",
       "name":"Critical Thinking Skills for University Success",
       "Rating":"Critical Thinking Skills for University Success\n4.8\nstars\n703 ratings\n•\n128 reviews\n\nIn this course, you will learn how to develop your Critical Thinking Skills to help you achieve success in your university studies. After completing this course, you will be able to:\n\n1. Use critical thinking and argumentation in university contexts to improve academic results \n\n2.  Understand the importance and function of critical thinking in academic culture  \n\n3. Use a variety of thinking tools to improve critical thinking  \n\n4. Identify types of argument, and bias within arguments, in order to better evaluate the strength of arguments \n\n5. Use evidence to support claims in arguments  \n\n6. Apply critical thinking and argumentation to real world problems and issues\n\nSHOW ALL ABOUT CRITICAL THINKING SKILLS FOR UNIVERSITY SUCCESS\nSHOW ALL"
    },
    {
       "Url":"/learn/communication-skills?specialization=academic-skills",
       "name":"Communication Skills for University Success",
       "Rating":"Communication Skills for University Success\n4.8\nstars\n571 ratings\n•\n103 reviews\n\nThis Specialization is aimed at preparing students for undergraduate study in an English-speaking university. The course equips you for full participation and engagement with your studies by building awareness and understanding of the core values and expectations of academic culture, and providing you with practical strategies to apply to your studies. In this course, you will learn how to develop your Communication Skills to help you achieve success in your university studies. After completing this course, you will be able to:\n\n1.\tRecognise the importance of communication in communities of practice at university\n2.\tUnderstand contexts of communication at university and associated expectations\n3.\tCommunicate clearly across a variety of different contexts and to a wide range of audiences by adapting communicative styles appropriately\n4.\tDemonstrate, negotiate, and further understanding through spoken, written, visual, and conversational modes\n5.\tEffectively formulate arguments and communicate research findings through the process of researching, composing, and editing\n6.\tConfidently engage in constructive and critical dialogue with respect and professionalism\n\nSHOW ALL ABOUT COMMUNICATION SKILLS FOR UNIVERSITY SUCCESS\nSHOW ALL"
    },
    {
       "Url":"/learn/academic-skills-project?specialization=academic-skills",
       "name":"Academic Skills for University Success: Capstone",
       "Rating":"Academic Skills for University Success: Capstone\n4.9\nstars\n673 ratings\n•\n142 reviews\n\nThis Specialization is aimed at preparing students for undergraduate study in an English-speaking university. The course equips you for full participation and engagement with your studies by building awareness and understanding of the core values and expectations of academic culture, and providing you with practical strategies to apply to your studies. \n\nIn the Capstone Project, you will apply the academic knowledge and skills you have learnt throughout courses 1-4 to research, write and present a project proposal that addresses a complex, real-world problem related to your field of interest and/or future study. After completing this course, you will be able to:\n\n1.\tApply a range of idea generation techniques \n2.\tApply research strategies to search, collect, select, process, and cite information\n3.\tUse the research process to develop and critically analyse ideas \n4.\tApply critical thinking skills to evaluate and analyse ideas and evidence\n5.\tUse problem-solving skills to identify gaps in knowledge and define issues \n6.\tDevelop creative and innovative solutions to real-world problems\n7.\tUse appropriate academic genres for written texts and multi-media presentations\n8.\tUse written and oral skills to communicate ideas effectively for academic contexts\n\nSHOW ALL ABOUT ACADEMIC SKILLS FOR UNIVERSITY SUCCESS: CAPSTONE\nSHOW ALL"
    },
    "/specializations/data-structures-algorithms-tsinghua",
    {
       "Url":"/learn/data-structures-algorithms-1?specialization=data-structures-algorithms-tsinghua",
       "name":"Data Structures and Algorithms (I)",
       "Rating":"Data Structures and Algorithms (I)\n\nBy learning this course, you will get a comprehensive  grasp of vector and list and the ability to use them in solving real problems. By the end of this course, you will be able to evaluate data structures and algorithms in terms of asymptotic complexity, analyze storage/time complexity of iterative/recursive algorithms, implement \n\nvector and list, understand/implement  basic sorting algorithms such as Bubblesort, Insertionsort, and Selectionsort, understand/implement search algorithms such as Binary Search, Fibonacci Search, and Interpolation Search, use vector and list in problem-solving.\n\n通过学习本课程，你将得到向量和列表的全面理解以及使用向量和列表解决实际问题的能力。 在本课程结束时，你将能够根据渐进复杂度评估数据结构和算法，分析迭代/递归算法的空间/时间复杂度，实现向量和列表， 了解/实现基本排序算法（例如冒泡排序、插入排序和选择排序），理解/实现搜索算法（例如二分搜索、斐波那契搜索和插值搜索）， 使用向量和列表解决问题。\n\nSHOW ALL ABOUT DATA STRUCTURES AND ALGORITHMS (I)\nSHOW ALL"
    },
    {
       "Url":"/learn/data-structures-algorithms-2?specialization=data-structures-algorithms-tsinghua",
       "name":"Data Structures and Algorithms (II)",
       "Rating":"Data Structures and Algorithms (II)\n\nBy learning this course, you will get a comprehensive  grasp of stack, queue, binary tree, graph and BST structures and algorithms, as well as their applications. By the end of this course, you will be able to understand and implement stack, queue and binary tree, use binary trees to solve problems such Huffman encoding, understand and implement the graph structure as well as related algorithms such BFS, DFS and PFS, understand and implement  AVL tree.\n\n通过学习本课程，你将全面了解栈、队列、二叉树、图和二叉搜索树结构、算法及其应用。 在本课程结束时，你将能够理解和实现栈、队列和二叉树，使用二叉树解决霍夫曼编码等问题，理解并实现图结构以及相关算法（例如BFS，DFS和PFS），理解并实现AVL树。\n\nSHOW ALL ABOUT DATA STRUCTURES AND ALGORITHMS (II)\nSHOW ALL"
    },
    {
       "Url":"/learn/data-structures-algorithms-3?specialization=data-structures-algorithms-tsinghua",
       "name":"Data Structures and Algorithms (III)",
       "Rating":"Data Structures and Algorithms (III)\n\nBy learning this course, you will get a comprehensive grasp of hashing  and typical balanced binary search trees, as well as their applications. By the end of this course, you will be able to understand the principle of Hashing, design and implement Hashtables for real problems, understand and implement typical balanced binary search trees such as Splay tree, Red-Black tree as well as B-tree, use BBST to solve various problems such as range query.\n\n通过学习本课程，你将全面了解散列和典型的平衡二叉搜索树技术及其应用。 在本课程结束时，你将能够了解散列的原理，设计和实现用于实际问题的哈希表，了解并实现典型的平衡二叉搜索树，例如Splay树，红黑树以及B树，并使用BBST解决各种问题，例如范围查询。\n\nSHOW ALL ABOUT DATA STRUCTURES AND ALGORITHMS (III)\nSHOW ALL"
    },
    {
       "Url":"/learn/data-structures-algorithms-4?specialization=data-structures-algorithms-tsinghua",
       "name":"Data Structures and Algorithms (IV)",
       "Rating":"Data Structures and Algorithms (IV)\n\nBy learning this course, you will get a comprehensive grasp of Priority Queues and string match techniques, as well as their applications. By the end of this course, you will be able to understand/implement Bucketsort, Counting-sort, and Radixsort, understand the principle/implementation/application of different Priority Queues such as complete binary heap and leftist heap, understand and implement Heapsort, understand and implement typical string matching algorithms such as KMP, BM, and Karp-Rabin, implement and analyze advanced selection/sorting algorithms such as Quicksort, QuickSelect, LinearSelect, and Shellsort.\n\n通过学习本课程，你将全面了解优先级队列和字符串匹配技术及其应用。 在本课程结束时，你将能够了解/实现桶排序，计数排序和基数排序，了解不同优先级队列的原理/实现/应用，例如完全二叉堆和左倾堆，了解并实现堆排序，了解并实现典型的字符串匹配算法（例如KMP，BM和Karp-Rabin），实现并分析高级选择/排序算法，例如快速排序、快速选择、线性选择和希尔排序。\n\nSHOW ALL ABOUT DATA STRUCTURES AND ALGORITHMS (IV)\nSHOW ALL"
    },
    "/specializations/embedded-interface-design",
    {
       "Url":"/learn/ux-interface-design-embedded-systems?specialization=embedded-interface-design",
       "name":"UX and Interface Design for Embedded Systems",
       "Rating":"UX and Interface Design for Embedded Systems\n\nThis course can also be taken for academic credit as ECEA 5346, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nUX and Interface Design for Embedded Systems is the first of three classes in the Embedded Interface Design (EID) specialization, an online version of the on-campus EID class taught in graduate embedded systems design.  This first course is focused on user experience (UX) and the related methods, practices, and principles that will help ensure your embedded interface designs for devices and systems are what your users both need and want.  The class includes an introduction to UX, and then a four phase breakdown of a typical UX design process, including planning, user research, design methods, and testing for verification and validation.  Much of the content provides generally applicable UX techniques, but particular focus is included for considerations in developing embedded devices.  The class includes practical projects that let you try some of the key methods in a thorough interface design process.\n\nSHOW ALL ABOUT UX AND INTERFACE DESIGN FOR EMBEDDED SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/rapid-prototyping-embedded-interface?specialization=embedded-interface-design",
       "name":"Rapid Prototyping of Embedded Interface Designs",
       "Rating":"Rapid Prototyping of Embedded Interface Designs\n\nThis course can also be taken for academic credit as ECEA 5347, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nRapid Prototyping is the second of three classes in the Embedded Interface Design (EID) specialization, an online version of the on-campus EID class taught in graduate embedded systems design.  This course is focused on rapid prototyping of devices and systems and the related methods, practices, and principles that will help ensure your embedded interface designs are what your users both need and want.  The class includes an introduction to rapid prototyping, prototyping device and system user interfaces, prototyping devices, and design considerations and perspectives for devices.  The content ranges from general design best practices to specifics for embedded devices of different types and specific flavors of user interfaces, but all are presented to support developing embedded devices.  The class includes practical projects that let you try some of standard methods in software development of prototype graphical user interfaces for devices using Qt and HTML.  This course can be taken for academic credit as ECEA 5347, part of CU Boulder's Master of Science in Electrical Engineering degree.\n\nSHOW ALL ABOUT RAPID PROTOTYPING OF EMBEDDED INTERFACE DESIGNS\nSHOW ALL"
    },
    {
       "Url":"/learn/m2m-iot-interface-design-embedded-systems?specialization=embedded-interface-design",
       "name":"M2M & IoT Interface Design & Protocols for Embedded Systems",
       "Rating":"M2M & IoT Interface Design & Protocols for Embedded Systems\n\nThis course can also be taken for academic credit as ECEA 5348, part of CU Boulder’s Master of Science in Electrical Engineering degree.\n\nM2M and IoT Interface Design and Protocols is the third of three classes in the Embedded Interface Design (EID) specialization, an online version of the on-campus EID class taught in graduate embedded systems design.  This course is focused on connecting devices to each other and to the cloud to create prototypes and actual systems that flow data from devices to consumers.  The class includes an introduction to M2M (Machine-to-Machine) and IoT (Internet of Things) concepts, using the cloud to develop IoT systems (specifically AWS (Amazon Web Services) and its IoT framework), a review of common communications protocols at every level of connected devices, and other IoT design concerns such as security, message queuing approaches, and the use and design of APIs and microservices .  The content ranges from general design best practices to specifics for select tools and methods, but all are presented to support developing embedded devices in IoT applications.  The class includes practical projects that let you try some of standard methods in software development of prototype graphical user interfaces for devices using AWS, Python, and optionally Node.JS.  This course can be taken for academic credit as ECEA 5348, part of CU Boulder's Master of Science in Electrical Engineering degree.\n\nSHOW ALL ABOUT M2M & IOT INTERFACE DESIGN & PROTOCOLS FOR EMBEDDED SYSTEMS\nSHOW ALL"
    },
    "/specializations/autodesk-generative-design-manufacturing",
    {
       "Url":"/learn/generative-design-additive-manufacturing?specialization=autodesk-generative-design-manufacturing",
       "name":"Generative Design for Additive Manufacturing",
       "Rating":"Generative Design for Additive Manufacturing\n4.8\nstars\n206 ratings\n•\n46 reviews\n\nThis course introduces you to one of the more common applications of generative design: Additive Manufacturing or 3D printing as it’s also known. In this course, we explore the basics of geometry creation and the mindset shift needed to build a generative design—a deeper understanding of generative design, its parameters, and how to work with the results specifically aimed at making a 3D printed metal part. We develop insightful understanding of the generative workflow by exploring Autodesk® Fusion 360™ tools and combining them with the creative process of taking an idea to a 3D model. We'll learn how to focus on where a design is and isn’t and apply the generative design thinking process to define a study as we take a deeper dive into Fusion 360.\n\nYou’ll need a paid subscription to Fusion 360 to complete the assignments in this course. Be sure to review your access or payment options before enrolling: https://www.autodesk.com/products/fusion-360\n\nWant to take your learning to the next level? Complete the Autodesk Generative Design for Manufacturing Specialization, and you’ll unlock an additional Autodesk Credential as further recognition of your success! The Autodesk Credential comes with a digital badge and certificate, which you can add to your resume and share on social media platforms like LinkedIn, Facebook, and Twitter. Sharing your Autodesk Credential can signal to hiring managers that you’ve got the right skills for the job and you’re up on the latest industry trends like generative design. \n\nEnroll in the Specialization here: https://www.coursera.org/specializations/autodesk-generative-design-manufacturing\n\nSHOW ALL ABOUT GENERATIVE DESIGN FOR ADDITIVE MANUFACTURING\nSHOW ALL"
    },
    {
       "Url":"/learn/generative-design-performance-weight-reduction?specialization=autodesk-generative-design-manufacturing",
       "name":"Generative Design for Performance and Weight Reduction",
       "Rating":"Generative Design for Performance and Weight Reduction\n4.8\nstars\n81 ratings\n•\n19 reviews\n\nThere are many considerations and factors that play a part in designing a new product. Cost is usually a big one, but sometimes there are other factors that are the main contributors to a product's direction. With vehicles, specifically motorcycles, we see advanced engineering practices performed on seemingly minor parts. In some instances, making a part as light as possible can have a big effect on performance. In other cases, the strength or stiffness of a part, such as a motor mount, is more critical than its mass. Generative design allows us the ability to solve for both problems at the same time and make informed design decisions without the sacrifice. In this course, we’ll explore how generative design can be applied to motorcycle parts to help reduce mass while also increasing performance.\n\nYou’ll need a paid subscription to Fusion 360 to complete the assignments in this course. Be sure to review your access or payment options before enrolling: https://www.autodesk.com/products/fusion-360\n\nWant to take your learning to the next level? Complete the Autodesk Generative Design for Manufacturing Specialization, and you’ll unlock an additional Autodesk Credential as further recognition of your success! The Autodesk Credential comes with a digital badge and certificate, which you can add to your resume and share on social media platforms like LinkedIn, Facebook, and Twitter. Sharing your Autodesk Credential can signal to hiring managers that you’ve got the right skills for the job and you’re up on the latest industry trends like generative design. \n\nEnroll in the Specialization here: https://www.coursera.org/specializations/autodesk-generative-design-manufacturing\n\nSHOW ALL ABOUT GENERATIVE DESIGN FOR PERFORMANCE AND WEIGHT REDUCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/generative-design-industrial-applications?specialization=autodesk-generative-design-manufacturing",
       "name":"Generative Design for Industrial Applications",
       "Rating":"Generative Design for Industrial Applications\n4.8\nstars\n74 ratings\n•\n19 reviews\n\nThe foundation of engineering design is exploration and iteration. Design is rarely a perfectly linear and straightforward process. In this course, we explore a design for a traditional manufacturing method and use generative design to create the perfect iteration of it. From that point, we'll reverse engineer the generative design and recreate it for a traditional manufacturing method and explore the option of fabricating the generative version to weigh the pros and cons of each.\n\nYou’ll need a paid subscription to Fusion 360 to complete the assignments in this course. Be sure to review your access or payment options before enrolling: https://www.autodesk.com/products/fusion-360\n\nWant to take your learning to the next level? Complete the Autodesk Generative Design for Manufacturing Specialization, and you’ll unlock an additional Autodesk Credential as further recognition of your success! The Autodesk Credential comes with a digital badge and certificate, which you can add to your resume and share on social media platforms like LinkedIn, Facebook, and Twitter. Sharing your Autodesk Credential can signal to hiring managers that you’ve got the right skills for the job and you’re up on the latest industry trends like generative design. \n\nEnroll in the Specialization here: https://www.coursera.org/specializations/autodesk-generative-design-manufacturing\n\nSHOW ALL ABOUT GENERATIVE DESIGN FOR INDUSTRIAL APPLICATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/generative-design-part-consolidation?specialization=autodesk-generative-design-manufacturing",
       "name":"Generative Design for Part Consolidation",
       "Rating":"Generative Design for Part Consolidation\n4.9\nstars\n59 ratings\n•\n13 reviews\n\nDesigning a product is only part of the process. Now, can that product be manufactured? In many cases the end product is made up of an assembly of different pieces to simplify manufacturing. With generative design and additive manufacturing, we can now take a different approach to the process of designing and producing complex products by ultimately reducing the number of parts and steps in an assembly while optimizing a design for strength and weight reduction.\n\nYou’ll need a paid subscription to Fusion 360 to complete the assignments in this course. Be sure to review your access or payment options before enrolling: https://www.autodesk.com/products/fusion-360\n\nWant to take your learning to the next level? Complete the Autodesk Generative Design for Manufacturing Specialization, and you’ll unlock an additional Autodesk Credential as further recognition of your success! The Autodesk Credential comes with a digital badge and certificate, which you can add to your resume and share on social media platforms like LinkedIn, Facebook, and Twitter. Sharing your Autodesk Credential can signal to hiring managers that you’ve got the right skills for the job and you’re up on the latest industry trends like generative design. \n\nEnroll in the Specialization here: https://www.coursera.org/specializations/autodesk-generative-design-manufacturing\n\nSHOW ALL ABOUT GENERATIVE DESIGN FOR PART CONSOLIDATION\nSHOW ALL"
    },
    "/specializations/social-entrepreneurship-cbs",
    {
       "Url":"/learn/social-entrepreneurship-opportunities?specialization=social-entrepreneurship-cbs",
       "name":"Identifying Social Entrepreneurship Opportunities",
       "Rating":"Identifying Social Entrepreneurship Opportunities\n4.7\nstars\n255 ratings\n•\n79 reviews\n\nThis Course will clarify the definition and meaning of Social Entrepreneurship and will focus on the need to learn about the source and root of a social problem. You will be introduced to different perspectives about Social Entrepreneurship and you will learn about complementary and opportunistic assets which will help you to detect an opportunity and develop an idea of how to create a business for social change. \n\nFrom a practical perspective you will be asked to initiate a team formation process and start to think about a problem topic that you want to address with your social venture in the future. You will work in a team to research this topic and will gradually start to think about a particular opportunity and identify a purpose for your social venture project.\n\nSHOW ALL ABOUT IDENTIFYING SOCIAL ENTREPRENEURSHIP OPPORTUNITIES\nSHOW ALL"
    },
    {
       "Url":"/learn/social-business-model?specialization=social-entrepreneurship-cbs",
       "name":"Social Business Model and Planning for Social Innovation",
       "Rating":"Social Business Model and Planning for Social Innovation\n4.7\nstars\n103 ratings\n•\n26 reviews\n\nIn this course we will take the social business opportunity that you have identified in the first course to a higher level. Specifically, you will develop a business model using the Business Model Canvas. Gradually you will also start writing your business plan. Moreover, you will be able to assess different organizational forms and select the one that is appropriate for your developed business model. By the end of the course you will be able to compare different social impact investment methods and choose the right funding strategy for your social venture.\n\nNote: It is highly recommended to have completed Course 1: 'Identifying Social Entrepreneurship Opportunities' before you start with this Course!\n\nSHOW ALL ABOUT SOCIAL BUSINESS MODEL AND PLANNING FOR SOCIAL INNOVATION\nSHOW ALL"
    },
    {
       "Url":"/learn/social-impact-growth?specialization=social-entrepreneurship-cbs",
       "name":"Unleashing the Impact of your Social Enterprise",
       "Rating":"Unleashing the Impact of your Social Enterprise\n4.7\nstars\n64 ratings\n•\n23 reviews\n\nIn Course 3 of this Specialization you will first of all learn about  Social Impact Assessment. Hence you will be able to develop a method to evaluate the social mission that you achieve while implementing your business plan. Next you will outline an appropriate communication strategy for your social enterprise and will demonstrate how to market your products and services to beneficiaries and other customers. Here you will employ an adaptable communication strategy as you move from early adopters to a broader market share. \n\nFurthermore you will determine growth strategies and how you can scale or replicate your business plan internationally in order to reach a larger number of beneficiaries. In particular you will discuss organic growth, social franchising, and an open source approach. Finally, you will evaluate exit strategies. Thus you will review options social enterprises have when they need to finance their growth but the original funders can not or do not want to finance the expansion. \n\nCourse 3 will be completed by your Capstone project, which will ask you to submit the final business plan of your social venture.\n\nNote: It is highly recommended to have completed Course 1 & 2 of the Social Entrepreneurship Specialization before starting this Course!\n\nSHOW ALL ABOUT UNLEASHING THE IMPACT OF YOUR SOCIAL ENTERPRISE\nSHOW ALL"
    },
    "/specializations/exploring-piano-literature",
    {
       "Url":"/learn/piano-sonata-origins-to-mozart?specialization=exploring-piano-literature",
       "name":"The Piano Sonata: Origins to Mozart",
       "Rating":"The Piano Sonata: Origins to Mozart\n\nIn this course, you’ll be introduced to sonata form; how it works, where it came from, and how sonatas are put together as multi-movement compositions. We will analyze the early history of the piano sonata and discover the important early masters of this style (Scarlatti, CPE Bach, Haydn, and Mozart). You’ll then investigate the relationship between the keyboard instruments of the time and the musical style, and be able to differentiate between Baroque, Galant, and Classical styles. \n\nThis course was filmed at the University of Michigan School of Music, Theatre & Dance, among other locations, to showcase the depth of the sonata repertoire and the instruments that contributed to its history.\n\nSHOW ALL ABOUT THE PIANO SONATA: ORIGINS TO MOZART\nSHOW ALL"
    },
    {
       "Url":"/learn/piano-sonata-beethoven-to-romantics?specialization=exploring-piano-literature",
       "name":"The Piano Sonata: Beethoven and the Romantics",
       "Rating":"The Piano Sonata: Beethoven and the Romantics\n\nIn this course, learners will review sonata form and learn how the piano sonata was taken to new heights by Ludwig van Beethoven. We’ll discover together how the generation that followed interpreted Beethoven’s achievements and put them into practice in their own unique ways. From there, we will explore the “War of the Romantics”: the variety of formal structures for Romantic sonatas (both traditional and progressive) and the major repertoire of this era. You’ll hear some of the important pianos of the time, and understand the differences between Viennese and English/French traditions of piano music. \n\nThis course was filmed at the University of Michigan School of Music, Theatre & Dance, among other locations, to showcase the depth of the sonata repertoire and the instruments that contributed to its history.\n\nSHOW ALL ABOUT THE PIANO SONATA: BEETHOVEN AND THE ROMANTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/piano-sonata-russian-20-21-century-composers?specialization=exploring-piano-literature",
       "name":"The Piano Sonata: Russian and 20th-21st Century Composers",
       "Rating":"The Piano Sonata: Russian and 20th-21st Century Composers\n\nIn this course, you’ll review sonata form and learn how the piano sonata was revitalized in the 20th century, with a particular attention to composers from Russia, where the sonata was an especially popular and successful genre. You’ll study some of the most influential piano sonatas of the 20th century, in both Neo-Classical and avant-garde styles. This course will also expose you to a variety of lesser-known and more recent compositions, showing how the piano sonata genre continues to expand and to thrive.\n\nThis course was filmed at the University of Michigan School of Music, Theatre & Dance, among other locations, to showcase the depth of the sonata repertoire and the instruments that contributed to its history.\n\nSHOW ALL ABOUT THE PIANO SONATA: RUSSIAN AND 20TH-21ST CENTURY COMPOSERS\nSHOW ALL"
    },
    "/specializations/data-science-con-python-e-r",
    {
       "Url":"/learn/python-istruzioni-per-uso?specialization=data-science-con-python-e-r",
       "name":"Python: Istruzioni per l’uso",
       "Rating":"Python: Istruzioni per l’uso\n4.0\nstars\n10 ratings\n•\n3 reviews\n\nIl Corso fornisce i principi di programmazione, le tecniche e gli strumenti di Python, linguaggio interpretato orientato agli oggetti molto utilizzato in molteplici contesti scientifici ed aziendali.\n\nPython è un linguaggio di programmazione di alto livello, supporta diversi paradigmi di programmazione, come il paradigma object-oriented (con supporto all'ereditarietà multipla), imperativo e funzionale. Ha ottenuto un enorme successo nelle comunità dei programmatori grazie al connubio unico tra la semplicità di apprendimento e la potenza offerta dalle sue librerie.\n\n\nQuesto corso fa parte della Specialization in Data Science con Python e R, cui sarà possibile iscriversi non appena il corso sarà partito.\n\nSHOW ALL ABOUT PYTHON: ISTRUZIONI PER L’USO\nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-data-mining-con-r?specialization=data-science-con-python-e-r",
       "name":"Machine Learning e Data Mining in R",
       "Rating":"Machine Learning e Data Mining in R\n\nIl corso Machine Learning e Data Mining in R è rivolto a chiunque voglia avere una pratica panoramica delle tecniche di apprendimento automatico, dalle più interpretabili - come l’analisi di regressione, delle componenti principali e dei gruppi - a quelle più flessibili come le reti neurali artificiali, sia shallow che deep - e le più ricorrenti problematiche di analisi e modellazione di dati e problemi reali - come collinearità, overfitting, regolarizzazione e knowledge transfer.\n\nLa modalità di erogazione del corso è di tipo learning by doing, mediante una continua implementazione in R dei concetti esposti. Le diverse unità ti verranno prima illustrate a voce, per permetterti di ricordare e capire, e poi rese disponibili sotto forma di reading, per permetterti di analizzarne criticamente il contenuto. Alla fine di ogni unità, verrai messo alla prova attraverso open Lab in ambiente di sviluppo RStudio, che ti permetteranno di applicare i metodi trattati nel corso ai tanti data set reali che ti saranno forniti. Ti verrà infine richiesto di valutare i tuoi progressi mediante graded quiz contenenti domande a risposta multipla. Non rimandare: Machine Learning e Data Mining in R sono ora a portata di mano!\n\nSHOW ALL ABOUT MACHINE LEARNING E DATA MINING IN R\nSHOW ALL"
    },
    {
       "Url":"/learn/python-per-la-data-science?specialization=data-science-con-python-e-r",
       "name":"Python per la Data Science",
       "Rating":"Python per la Data Science\n\nPython per la Data Science è un corso cruciale per qualsiasi professionista che voglia analizzare grandi quantità di dati attraverso le più recenti tecniche di machine Learning e Deep learning. \n\nIl core del corso è rappresentato dall’utilizzo dei notebook: una nuova forma di fruizione dei contenuti didattici in cui testo e teoria sono affiancati a numerosi codici eseguibili e modificabili.  Il formato è visivamente simile ad un  file PDF a cui si aggiunge l’interattività tipica dei prodotti software. Il risultato? Un corso fortemente interattivo a vocazione pratica in cui, codice dopo codice, si manipolano dati fino a giungere ad esempi avanzati di image processing.\nNon ti resta altro da fare che iscriverti al Corso e metterti alla prova con “Python per la Data Science”: ti aspetto!\n\n\nQuesto corso fa parte della Specialization in Data Science con Python e R, cui sarà possibile iscriversi non appena il corso sarà partito.\n\nSHOW ALL ABOUT PYTHON PER LA DATA SCIENCE\nSHOW ALL"
    },
    "/specializations/analytics-for-decision-making",
    {
       "Url":"/learn/introduction-to-predictive-modeling?specialization=analytics-for-decision-making",
       "name":"Introduction to Predictive Modeling",
       "Rating":"Introduction to Predictive Modeling\n5.0\nstars\n19 ratings\n•\n6 reviews\n\nWelcome to Introduction to Predictive Modeling, the first course in the University of Minnesota’s Analytics for Decision Making specialization.\n\nThis course will introduce to you the concepts, processes, and applications of predictive modeling, with a focus on linear regression and time series forecasting models and their practical use in Microsoft Excel. By the end of the course, you will be able to:\n\n-          Understand the concepts, processes, and applications of predictive modeling.\n-          Understand the structure of and intuition behind linear regression models.\n-          Be able to fit simple and multiple linear regression models to data, interpret the results, evaluate the goodness of fit, and use fitted models to make predictions.\n-          Understand the problem of overfitting and underfitting and be able to conduct simple model selection.\n-          Understand the concepts, processes, and applications of time series forecasting as a special type of predictive modeling.\n-          Be able to fit several time-series-forecasting models (e.g., exponential smoothing and Holt-Winter’s method) in Excel, evaluate the goodness of fit, and use fitted models to make forecasts.\n-          Understand different types of data and how they may be used in predictive models.\n-          Use Excel to prepare data for predictive modeling, including exploring data patterns, transforming data, and dealing with missing values.\n\nThis is an introductory course to predictive modeling. The course provides a combination of conceptual and hands-on learning. During the course, we will provide you opportunities to practice predictive modeling techniques on real-world datasets using Excel.\n\nTo succeed in this course, you should know basic math (the concept of functions, variables, and basic math notations such as summation and indices) and basic statistics (correlation, sample mean, standard deviation, and variance). This course does not require a background in programming, but you should be familiar with basic Excel operations (e.g., basic formulas and charting). For the best experience, you should have a recent version of Microsoft Excel installed on your computer (e.g., Excel 2013, 2016, 2019, or Office 365).\n\nSHOW ALL ABOUT INTRODUCTION TO PREDICTIVE MODELING\nSHOW ALL"
    },
    {
       "Url":"/learn/optimization-for-decision-making?specialization=analytics-for-decision-making",
       "name":"Optimization for Decision Making",
       "Rating":"Optimization for Decision Making\n\nIn this data-driven world, companies are often interested in knowing what is the \"best\" course of action, given the data. For example, manufacturers need to decide how many units of a product to produce given the estimated demand and raw material availability? Should they make all the products in-house or buy some from a third-party to meet the demand? Prescriptive Analytics is the branch of analytics that can provide answers to these questions. It is used for prescribing data-based decisions. The most important method in the prescriptive analytics toolbox is optimization. This course will introduce students to the basic principles of linear optimization for decision-making. Using practical examples, this course teaches how to convert a problem scenario into a mathematical model that can be solved to get the best business outcome. We will learn to identify decision variables, objective function, and constraints of a problem, and use them to formulate and solve an optimization problem using Excel solver and spreadsheet.\n\nSHOW ALL ABOUT OPTIMIZATION FOR DECISION MAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-models-for-decision-making?specialization=analytics-for-decision-making",
       "name":"Advanced Models for Decision Making",
       "Rating":"Advanced Models for Decision Making\n\nBusiness analysts need to be able to prescribe optimal solution to problems. But analytics courses are often focused on training students in data analysis and visualization, not so much in helping them figure out how to take the available data and pair that with the right mathematical model to formulate a solution. This course is designed to connect data and models to real world decision-making scenarios in manufacturing, supply chain, finance, human resource management, etc. In particular, we understand how linear optimization - a prescriptive analytics method - can be used to formulate decision problems and provide data-based optimal solutions. Throughout this course we will work on applied problems in different industries, such as:\n\n(a) Finance Decisions: How should an investment manager create an optimal portfolio that maximizes net returns while not taking too much risks across various investments?\n\n(b) Production Decisions: Given projected demand, supply of raw materials, and transportation costs, what would be the optimal volume of products to manufacture at different plant locations?\n\n(c) HR Decisions: How many workers need to be hired or terminated over a planning horizon to minimize cost while meeting operational needs of a company?\n\n(c) Manufacturing: What would be the profit maximizing product mix that should be produced, given the raw material availability and customer demand?\n\nWe will learn how to formulate these problems as mathematical models and solve them using Excel spreadsheet.\n\nSHOW ALL ABOUT ADVANCED MODELS FOR DECISION MAKING\nSHOW ALL"
    },
    {
       "Url":"/learn/simulation-models-for-decision-making?specialization=analytics-for-decision-making",
       "name":"Simulation Models for Decision Making",
       "Rating":"Simulation Models for Decision Making\n\nThis course is primarily aimed at third- and fourth-year undergraduate students or graduate students interested in learning simulation techniques to solve business problems.  \n\nThe course will introduce you to take everyday and complex business problems that have no one correct answer due to uncertainties that exist in business environments.  Simulation modeling allows us to explore various outcomes and protect personal or business interests against unwanted outcomes.  We can model uncertainties by using the concepts of probability and stepwise thinking.  Stepwise thinking allows us to break down the problem in smaller components, explore dependencies between related events and allows us to focus on aspects of problem that are prone to changes due to future uncertainties.\n\nThe course will introduce you to advanced Excel techniques to model and execute simulation models.  Many of the Excel techniques learned in the course will be useful beyond simulation modeling.  We will learn both Monte Carlo simulation techniques where overall outcome is of primary interest and discrete event simulation where intermediate dependencies between related events might be of interest.  The course will introduce you to several practical issues in simulation modeling that are normally not covered in textbooks.  The course uses a few running examples throughout the course to demonstrate concepts and provide concrete modeling examples.  \n\nAfter taking the course a student will be able to develop fairly advanced simulation models to explore fairly broad range of business environments and outcomes.\n\nSHOW ALL ABOUT SIMULATION MODELS FOR DECISION MAKING\nSHOW ALL"
    },
    "/specializations/cyber-security-business",
    {
       "Url":"/learn/intro-cyber-security-business?specialization=cyber-security-business",
       "name":"Introduction to Cybersecurity for Business",
       "Rating":"Introduction to Cybersecurity for Business\n4.7\nstars\n878 ratings\n•\n223 reviews\n\nThe world runs computers.  From small to large businesses, from the CEO down to level 1 support staff, everyone uses computers.  This course is designed to give you a practical perspective on computer security.  This course approaches computer security in a way that anyone can understand.  Ever wonder how your bank website is secure when you connect to it?  Wonder how other business owners secure their network?  Wonder how large data breaches happen?  This is practical computer security.  It will help you answer the question – what should I focus on?\n\nSHOW ALL ABOUT INTRODUCTION TO CYBERSECURITY FOR BUSINESS\nSHOW ALL"
    },
    {
       "Url":"/learn/cyber-threats-attack-vectors?specialization=cyber-security-business",
       "name":"Cyber Threats and Attack Vectors",
       "Rating":"Cyber Threats and Attack Vectors\n4.7\nstars\n608 ratings\n•\n153 reviews\n\nData breaches occur nearly every day.  From very large retailers, down to your fantasy football website, and anywhere in between, they have been compromised in some way.  How did the attackers get in?  What did they do with the data they compromised?  What should I be concerned with in my own business or my systems?  This course is the second course in the Practical Computer Security.  It will discuss types of threats and attack vectors commonly seen in today’s environment.  I hate to be the bearer of bad news, but threats are all over the place!  This course isn’t designed to insight fear that there is no hope for keeping systems and business secure, but rather educate you on how attacks are carried out so that you have a better sense of what to look out for in your business or with your systems.\n\nSHOW ALL ABOUT CYBER THREATS AND ATTACK VECTORS\nSHOW ALL"
    },
    {
       "Url":"/learn/detecting-cyber-attacks?specialization=cyber-security-business",
       "name":"Detecting and Mitigating Cyber Threats and Attacks",
       "Rating":"Detecting and Mitigating Cyber Threats and Attacks\n4.7\nstars\n389 ratings\n•\n83 reviews\n\nComputer attacks and data breaches are inevitable.  It seems like every day a data breach occurs and the victims of the data breach suffer.  Their information is stolen or posted online.  The company’s or businesses who had the breach go on, learn a little from the attack, and just give credit monitoring out as if nothing happened.  What if you could help prevent a data breach in your organization?  This is the third course in the Practical Computer Security specialization.  This course looks at detection and mitigation of threats and attack vectors and discusses how to use tools and principles to protect information.  By the end of the course you should be able to make suggestions on what type of detection and mitigation strategy is right for your systems or business given the known threats and attack vectors.  You should be able to discuss what features you want in a firewall, or how cash registers or sensitive data systems should be secured.  The project at the end of the course will allow you to apply what you have learned to argue what type of detection and mitigation strategies should have been employed by companies and businesses that have suffered a data breach.\n\nSHOW ALL ABOUT DETECTING AND MITIGATING CYBER THREATS AND ATTACKS\nSHOW ALL"
    },
    {
       "Url":"/learn/proactive-computer-security?specialization=cyber-security-business",
       "name":"Proactive Computer Security",
       "Rating":"Proactive Computer Security\n4.7\nstars\n226 ratings\n•\n61 reviews\n\nI’ve heard this before – “I’m not sure my computer security practices are working”.  I reply “Have you tested them?”  This course is the fourth and final course in the Practical Computer Security specialization.  In this course, you’ll learn how to proactively test what you have put in place to protect your data.  In the first week you’ll be able to discuss the basics of deterrents and how to “trick” attackers into believing they’ve hit a goldmine of data away from your real systems.  In week 2, you’ll be able to understand and discuss the steps of penetration testing methodology.  In week 3, you will be able to understand and apply what you have learned on your own systems to test whether your systems are secure or not.  In week 4, we’ll discuss planning for your own methodology that you can apply to your own systems.  And finally in week 5, we’ll finish up with a project that will allow you to test your skills in a safe environment.\n\nSHOW ALL ABOUT PROACTIVE COMPUTER SECURITY\nSHOW ALL"
    },
    "/specializations/data-analysis",
    {
       "Url":"/learn/data-visualization?specialization=data-analysis",
       "name":"Data Management and Visualization",
       "Rating":"Data Management and Visualization\n4.4\nstars\n882 ratings\n•\n252 reviews\n\nWhether being used to customize advertising to millions of website visitors or streamline inventory ordering at a small restaurant, data is becoming more integral to success. Too often, we’re not sure how use data to find answers to the questions that will make us more successful in what we do. In this course, you will discover what data is and think about what questions you have that can be answered by the data – even if you’ve never thought about data before. Based on existing data, you will learn to develop a research question, describe the variables and their relationships, calculate basic statistics, and present your results clearly. By the end of the course, you will be able to use powerful data analysis tools – either SAS or Python – to manage and visualize your data, including how to deal with missing data, variable groups, and graphs. Throughout the course, you will share your progress with others to gain valuable feedback, while also learning how your peers use data to answer their own questions.\n\nSHOW ALL ABOUT DATA MANAGEMENT AND VISUALIZATION\nSHOW ALL"
    },
    {
       "Url":"/learn/data-analysis-tools?specialization=data-analysis",
       "name":"Data Analysis Tools",
       "Rating":"Data Analysis Tools\n4.5\nstars\n397 ratings\n•\n93 reviews\n\nIn this course, you will develop and test hypotheses about your data. You will learn a variety of statistical tests, as well as strategies to know how to apply the appropriate one to your specific data and question. Using your choice of two powerful statistical software packages (SAS or Python), you will explore ANOVA, Chi-Square, and Pearson correlation analysis. This course will guide you through basic statistical principles to give you the tools to answer questions you have developed. Throughout the course, you will share your progress with others to gain valuable feedback and provide insight to other learners about their work.\n\nSHOW ALL ABOUT DATA ANALYSIS TOOLS\nSHOW ALL"
    },
    {
       "Url":"/learn/regression-modeling-practice?specialization=data-analysis",
       "name":"Regression Modeling in Practice",
       "Rating":"Regression Modeling in Practice\n4.4\nstars\n269 ratings\n•\n51 reviews\n\nThis course focuses on one of the most important tools in your data analysis arsenal: regression analysis. Using either SAS or Python, you will begin with linear regression and then learn how to adapt when two variables do not present a clear linear relationship. You will examine multiple predictors of your outcome and be able to identify confounding variables, which can tell a more compelling story about your results. You will learn the assumptions underlying regression analysis, how to interpret regression coefficients, and how to use regression diagnostic plots and other tools to evaluate the quality of your regression model. Throughout the course, you will share with others the regression models you have developed and the stories they tell you.\n\nSHOW ALL ABOUT REGRESSION MODELING IN PRACTICE\nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-data-analysis?specialization=data-analysis",
       "name":"Machine Learning for Data Analysis",
       "Rating":"Machine Learning for Data Analysis\n4.2\nstars\n305 ratings\n•\n66 reviews\n\nAre you interested in predicting future outcomes using your data? This course helps you do just that! Machine learning is the process of developing, testing, and applying predictive algorithms to achieve this goal. Make sure to familiarize yourself with course 3 of this specialization before diving into these machine learning concepts. Building on Course 3, which introduces students to integral supervised machine learning concepts, this course will provide an overview of many additional concepts, techniques, and algorithms in machine learning, from basic classification to decision trees and clustering. By completing this course, you will learn how to apply, test, and interpret machine learning algorithms as alternative methods for addressing your research questions.\n\nSHOW ALL ABOUT MACHINE LEARNING FOR DATA ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/data-analysis-capstone?specialization=data-analysis",
       "name":"Data Analysis and Interpretation Capstone",
       "Rating":"Data Analysis and Interpretation Capstone\n4.7\nstars\n40 ratings\n•\n9 reviews\n\nThe Capstone project will allow you to continue to apply and refine the data analytic techniques learned from the previous courses in the Specialization to address an important issue in society. You will use real world data to complete a project with our industry and academic partners. For example, you can work with our industry partner, DRIVENDATA, to help them solve some of the world's biggest social challenges! DRIVENDATA at www.drivendata.org, is committed to bringing cutting-edge practices in data science and crowdsourcing to some of the world's biggest social challenges and the organizations taking them on. \n\nOr, you can work with our other industry partner, The Connection (www.theconnectioninc.org) to help them better understand recidivism risk for people on parole seeking substance use treatment. For more than 40 years, The Connection has been one of Connecticut’s leading private, nonprofit human service and community development agencies. Each month, thousands of people are assisted by The Connection’s diverse behavioral health, family support and community justice programs. The Connection’s Institute for Innovative Practice was created in 2010 to bridge the gap between researchers and practitioners in the behavioral health and criminal justice fields with the goal of developing maximally effective, evidence-based treatment programs. \n\nA major component of the Capstone project is for you to be able to choose the information from your analyses that best conveys results and implications, and to tell a compelling story with this information. By the end of the course, you will have a professional quality report of your findings that can be shown to colleagues and potential employers to demonstrate the skills you learned by completing the Specialization.\n\nSHOW ALL ABOUT DATA ANALYSIS AND INTERPRETATION CAPSTONE\nSHOW ALL"
    },
    "/specializations/effective-communication",
    {
       "Url":"/learn/effective-intercultural-communication?specialization=effective-communication",
       "name":"Establishing a Professional ‘Self’ through Effective Intercultural Communication",
       "Rating":"Establishing a Professional ‘Self’ through Effective Intercultural Communication\n4.5\nstars\n192 ratings\n•\n52 reviews\n\nIn the course ‘Establishing a professional ‘self’ through effective intercultural communication’, you will learn how to communicate effectively to establish relationships with colleagues in a culturally and linguistically diverse community and workplace.\n\nAs language reflects cultures, we begin the course by highlighting the need to take into considerations cultural values when we communicate in a multicultural community and workplace. We then move on to discuss some effective communication skills required to build relationships with colleagues in a globalised workplace. \n\nYou will learn to adopt appropriate intrapersonal and interpersonal, verbal and nonverbal, communicative strategies to present information based on the 7 communication principles.\n \nFinally, you will learn to build your personal profile and appropriately align yourself in a globalised workplace.\n\nSHOW ALL ABOUT ESTABLISHING A PROFESSIONAL ‘SELF’ THROUGH EFFECTIVE INTERCULTURAL COMMUNICATION\nSHOW ALL"
    },
    {
       "Url":"/learn/strengthening-your-widening-network?specialization=effective-communication",
       "name":"Strengthening Your Widening Network",
       "Rating":"Strengthening Your Widening Network\n4.6\nstars\n77 ratings\n•\n22 reviews\n\nIn this course, you will learn strategies not only on how to communicate effectively but also how to strengthen your relationships with co-workers and other stakeholders from diverse cultural backgrounds, both inside and beyond the organisation. In particular, \"Strengthening your widening network\" aims to equip you with a workplace discourse that facilitates familiarity with practices in the working environment and to help you appreciate the complexities inherent in the organisational structure and hierarchy. \n\nYou will learn to write effective emails demonstrating a keen awareness of your audience and the 7 communication principles. In addition, you will learn to voice your views and assert your position at various communication contexts such as formal meetings and work-related discussions.  \n \nBy the end of the course, you should demonstrate a greater communicative and linguistic competence, with a better grasp of interpersonal and intercultural communication in a globalised workplace.\n\nSHOW ALL ABOUT STRENGTHENING YOUR WIDENING NETWORK \nSHOW ALL"
    },
    {
       "Url":"/learn/persuasive-communication?specialization=effective-communication",
       "name":"Engaging in Persuasive and Credible Communication",
       "Rating":"Engaging in Persuasive and Credible Communication\n4.6\nstars\n220 ratings\n•\n72 reviews\n\nIn \"Engaging in Persuasive and Credible Communication\", you will learn the key skill of persuasion, in the context of professional communication in a globalised world. \n\nPersuasive communication is essential to any professional workplace. From a simple email request for your colleague to help you, to developing a presentation for the board of directors, these are acts of communication that require a good degree of persuasion. Even the process of entering the workforce requires effective persuasive communication, for in the act of writing your resume, cover-letter, or in the interview process, you are essentially persuading the potential employer to hire you.\n\nBy the end of this course, you will be able to structure and express your ideas in a convincing and persuasive manner in writing, apply basic principles of persuasive writing to convince different sets of audiences at the globalised workplace, and learn to engage in persuasive and credible communication across different cultures in a complex globalised environment.\n\nSHOW ALL ABOUT ENGAGING IN PERSUASIVE AND CREDIBLE COMMUNICATION\nSHOW ALL"
    },
    {
       "Url":"/learn/intercultural-communications?specialization=effective-communication",
       "name":"Becoming Part of the Globalised Workplace",
       "Rating":"Becoming Part of the Globalised Workplace\n4.3\nstars\n46 ratings\n•\n13 reviews\n\nThe final course aims to build learners’ confidence and adaptability when communicating in cross-cultural environments as they assume leadership responsibility to communicate influence in persuasive workplace contexts. The course focuses on enhancing learners’ professional persona for skilful engagement and intercultural communication with stakeholders within and beyond the organization, including cross-departmental work teams, clients and external partners. \n\nLearners will also discover and apply good practices in organising information, using visual aids and body language for presentations while demonstrating a heightened sense of cultural sensitivity in a given context. In all, learners will acquire skills to demonstrate persuasive verbal and intercultural communication in workplace contexts which may include dialogues and presentations to critical stakeholders and effective task delegation to team members.\n\nAt the end of this course, learners will be able to:\n-\tAnalyse factors of motivation among workplace counterparts.\n-\tRecognise the impact of culture on factors of motivation.\n-\tCritique and craft persuasive verbal communication products (i.e. script of dialogue) for exchanges with work teams and critical stakeholders.\n-\tApply principles of effective PowerPoint slide design with consideration for cultural sensitivity.\n-\tIdentify and adopt strategies on the use of voice and body language for engaging presentations.\n\nSHOW ALL ABOUT BECOMING PART OF THE GLOBALISED WORKPLACE\nSHOW ALL"
    },
    {
       "Url":"/learn/effective-communication-in-the-globalised-workplace?specialization=effective-communication",
       "name":"Effective Communication in the Globalised Workplace - The Capstone",
       "Rating":"Effective Communication in the Globalised Workplace - The Capstone\n4.6\nstars\n14 ratings\n•\n4 reviews\n\nThe Capstone Project for this Specialisation requires you to demonstrate your understanding of the courses and integrate the knowledge and skills learned in real workplace scenarios. In particular, you will be given a choice of a few projects based on scenarios and case studies drawn from different workplaces.  \n\nThe project outcome is a handbook or a practical guide, which could be a blend of text and multi-media.  In completing the project, you will be required to use and/or collect relevant primary data from people in the workplace through emails, face-to-face chats, Skype discussions and incorporate the data into the handbook/guide as support.  \n\nIn addition, there will be a component on critical reflection on your learning journey. \n\nThe Capstone Project is to be completed within six weeks.  \nEvaluation will be done via a combination of peer and tutor assessment.\n\nSHOW ALL ABOUT EFFECTIVE COMMUNICATION IN THE GLOBALISED WORKPLACE - THE CAPSTONE\nSHOW ALL"
    },
    "/specializations/leadership-communication-engineers",
    {
       "Url":"/learn/oral-communication?specialization=leadership-communication-engineers",
       "name":"Oral Communication for Engineering Leaders",
       "Rating":"Oral Communication for Engineering Leaders\n4.6\nstars\n175 ratings\n•\n49 reviews\n\nTaught by Rice University communication faculty from the Rice Center for Engineering Leadership (RCEL). This course covers core topics in oral communication: Communication strategy, content, data visualization, and delivery. You’ll learn key principles in\n\n•\tCreating a communication strategy\n•\tDeveloping a clear message and organizing persuasive content\n•\tCreating strong visual support\n•\tPresenting data effectively\n•\tPresenting professionally and confidently\n•\tHandling formal presentations, giving pitches, speaking extemporaneously, managing online presentations, and lowering \n        public speaking anxiety\n\nSelected materials courtesy of Communication Faculty at Rice University - all rights reserved.\n\nSHOW ALL ABOUT ORAL COMMUNICATION FOR ENGINEERING LEADERS\nSHOW ALL"
    },
    {
       "Url":"/learn/interpersonal-communication?specialization=leadership-communication-engineers",
       "name":"Interpersonal Communication for Engineering Leaders",
       "Rating":"Interpersonal Communication for Engineering Leaders\n4.8\nstars\n133 ratings\n•\n32 reviews\n\nThis course covers communication skills that engineering leaders use every day to motivate, inspire, and support the people in their organizations. \n\nSpeaking and writing are basic leadership communication skills. (We covered these topics in the Specialization course 1 and 3.)  However, leaders also need to be skillful interpersonal communicators. Modern business requires communication skills that are effective across cultures, generations, and genders. Communication is also a key skill in building your personal brand. Leaders need to look, act, and speak like leaders. Another important leadership skill is the ability to handle difficult, emotional communications with employees, supervisors, and colleagues. Finally, engineers are often at the center of crisis communication.\n\nIn this course, you will learn\n1. How to communicate in a global environment, \n2. How to communicate across cultures, generations, and genders\n3. How to use communication to build your personal brand, communicate your values, and your leadership promise\n4. How to handle high-stakes, emotionally charged, difficult conversations with employees, supervisors and your colleagues\n5. How to handle crisis communication\n\n\nRequired Material Disclaimer- The purchase of a case study is necessary to complete this course, as it is tied to an assessment. This case is an excellent illustration of the typical business situations requiring skillful handling of difficult conversations. Currently, the cost associated with this case study is $8.95 USD and is subject to change.\n\nSelected materials courtesy of Communiation Faculty at Rice University - all rights reserved.\n\nSHOW ALL ABOUT INTERPERSONAL COMMUNICATION FOR ENGINEERING LEADERS\nSHOW ALL"
    },
    {
       "Url":"/learn/engineering-writing?specialization=leadership-communication-engineers",
       "name":"Writing Skills for Engineering Leaders",
       "Rating":"Writing Skills for Engineering Leaders\n4.7\nstars\n332 ratings\n•\n78 reviews\n\nEngineering leaders must write extensively for their jobs, and their writing needs to be professional, reader-focused, and error-free. What leaders write in particular can affect productivity and the bottom line, so the written communication that leaders create must be clear and concise. In this course, you’ll learn essential writing skills that you can apply in your daily activities on the job as an engineering leader. You’ll learn key principles in\n\n•\tApproaching various engineering genres\n•\tUsing the writing process to create quality documents\n•\tMaking your writing structured\n•\tMaking your writing clear and concise\n•\tHandling style, tone, and voice\n\nSelected materials courtesy of Communication Faculty at Rice University - all rights reserved.\n\nSHOW ALL ABOUT WRITING SKILLS FOR ENGINEERING LEADERS\nSHOW ALL"
    },
    "/specializations/journey-of-the-universe",
    {
       "Url":"/learn/journey-of-the-universe?specialization=journey-of-the-universe",
       "name":"Journey of the Universe: The Unfolding of Life",
       "Rating":"Journey of the Universe: The Unfolding of Life\n4.7\nstars\n386 ratings\n•\n105 reviews\n\nJourney of the Universe weaves together the discoveries of the evolutionary sciences together with humanities such as history, philosophy, art, and religion.  The course draws on the Emmy-award winning film, Journey of the Universe, and the book from Yale University Press. \n\nJourney explores cosmic evolution as a creative process based on connection, interdependence, and emergence.  It examines a range of dynamic interactions in the unfolding of galaxies, Earth, life, and human communities. It investigates ways in which we understand evolutionary processes and the implications for humans and our ecological future.  \n\nThe Journey course, thus, is based on a new integration that is emerging from the dialogue of the sciences and humanities. Journey tells the story of evolution as an epic narrative, rather than as a series of facts separated by scientific disciplines. This changes our perception so that we begin to see ourselves as an integral part of this narrative. By situating ourselves within this story we can better appreciate the complexity and beauty of processes such as self-organizing dynamics, natural selection, emergence, symbiosis, and co-evolution. As we discover these intricate processes of evolution, we awaken to the beauty and complexity of our natural environment at this critical juncture in our planetary history.\n\nSHOW ALL ABOUT JOURNEY OF THE UNIVERSE: THE UNFOLDING OF LIFE\nSHOW ALL"
    },
    {
       "Url":"/learn/journey-knowledge-action?specialization=journey-of-the-universe",
       "name":"Journey Conversations: Weaving Knowledge and Action",
       "Rating":"Journey Conversations: Weaving Knowledge and Action\n4.8\nstars\n145 ratings\n•\n31 reviews\n\nJourney of the Universe weaves together the discoveries of the evolutionary sciences together with humanities such as history, philosophy, art, and religion.  This course draws on the Journey of the Universe Conversations, a series of 20 interviews with scientists and environmentalists. The first 10 interviews are with scientists and historians who deepen our understanding of the evolutionary process of universe, Earth, and humans. The second 10 interviews are with environmentalists, teachers, and artists who explore the connections between the universe story and the practices for a flourishing Earth community.\n\nSHOW ALL ABOUT JOURNEY CONVERSATIONS: WEAVING KNOWLEDGE AND ACTION\nSHOW ALL"
    },
    {
       "Url":"/learn/thomas-berry?specialization=journey-of-the-universe",
       "name":"The Worldview of Thomas Berry: The Flourishing of the Earth Community",
       "Rating":"The Worldview of Thomas Berry: The Flourishing of the Earth Community\n4.7\nstars\n120 ratings\n•\n32 reviews\n\nThomas Berry (1914-2009) was a historian of world religions and an early voice awakening moral sensibilities to the environmental crisis.  He is known for articulating a “new story” of the universe that explores the implications of the evolutionary sciences and cultural traditions for creating a flourishing future.  \n\nThis course investigates Berry’s life and thought in relation to the Journey of the Universe project.  It draws on his books, articles, and recorded lectures to examine such ideas as: the New Story, the Great Work, and the emerging Ecozoic era.  The course explores Berry’s insights into cosmology as a context for locating the human in a dynamic unfolding universe and thus participating in the creative work of our times. In particular, we will examine Berry’s reflections on renewal and reform in the areas of ecology, economics, education, spirituality, and the arts.\n\n\t\nCourse Rationale:\n\n\tThomas Berry was an original, creative, and comprehensive thinker, especially regarding the critical nature of our global environmental crisis.  His intellectual importance resides in his response to the ecological crisis by bringing together the humanities and science in an evolutionary narrative.  In addition, he articulated the need for the moral participation of the world religions in addressing environmental issues.  He came to this realization largely through his study of cosmologies embedded within religious traditions.  Sensing the significance of these stories as “functional cosmologies” he explored the widespread influence that these stories transmitted through a tradition, for example, in rituals, ethics, and subsistence practices.\n\nSHOW ALL ABOUT THE WORLDVIEW OF THOMAS BERRY:  THE FLOURISHING OF THE EARTH COMMUNITY\nSHOW ALL"
    },
    "/specializations/leadership-public-health-crises",
    {
       "Url":"/learn/communication-leadership-public-health-crisis?specialization=leadership-public-health-crises",
       "name":"Communication and Leadership during a Public Health Crisis",
       "Rating":"Communication and Leadership during a Public Health Crisis\n\nAs the world changes dramatically around us, leadership skills are necessary to help keep the population safe and healthy.\n\nThis course emphasizes why it is important to build leadership skills in public health positions and work with diverse teams while immersed in a crisis. The course is designed to help develop effective communication skills necessary to lead a team through conflict and crisis, and build strategies to reach a common goal.\n\nSHOW ALL ABOUT COMMUNICATION AND LEADERSHIP DURING A PUBLIC HEALTH CRISIS\nSHOW ALL"
    },
    {
       "Url":"/learn/disaster-crisis-emergency-preparedness-communication?specialization=leadership-public-health-crises",
       "name":"Disaster, Crisis, and Emergency Preparedness Communication",
       "Rating":"Disaster, Crisis, and Emergency Preparedness Communication\n4.8\nstars\n39 ratings\n•\n9 reviews\n\nThis course will introduce you to basic concepts of emergency management, planning, and crisis risk communication. You will understand the definitions of and operational challenges associated with disasters and public health emergencies. You will identify important components of risk communication, and you will identify and evaluate the ways social characteristics shape vulnerabilities to crises and health outcomes.  In completing this course, you will begin to learn about the nature of different kinds of extreme events and the disruptions they can cause for communities affected by them. You will learn about how to approach the planning process. You will also explore the ways extreme events can be felt differently by different members within our communities. Finally, you will go over important considerations in crafting messages about risks. As you go through the course, you will apply your knowledge of these principles in assignments which ask you to consider how you would approach the crisis risk communication planning process for your organization or community.\n\nSHOW ALL ABOUT DISASTER, CRISIS, AND EMERGENCY PREPAREDNESS COMMUNICATION\nSHOW ALL"
    },
    {
       "Url":"/learn/diverse-audiences-public-health-crisis?specialization=leadership-public-health-crises",
       "name":"Connect with Diverse Audiences during a Public Health Crisis",
       "Rating":"Connect with Diverse Audiences during a Public Health Crisis\n\nPublic health communicators have a duty to communicate health information with integrity, accuracy, and clarity. For messaging to be most effective, public health communicators must help their audiences draw meaningful connections with the information being shared, and connect with them in ways that foster trust and credibility.\n\nThis course emphasizes how public health communicators can segment their audiences into smaller groups, thereby allowing them to tailor messages to each group's unique needs. You will explore how public health communicators recognize and overcome underlying biases, assumptions, and stereotypes to create messaging that is rooted in empathy, as well as leverage persuasive communication strategies to frame and deliver messages in ways that appeal to audiences’ core values. You will learn to approach media interviews with confidence, adjust your communication strategy in the moment, and center your focus on your audiences and their needs.\n\nSHOW ALL ABOUT CONNECT WITH DIVERSE AUDIENCES DURING A PUBLIC HEALTH CRISIS\nSHOW ALL"
    }
 ]