[
    "/specializations/analysing-numeric-digital-literacies",
    {
       "Url":"/learn/management-accounting?specialization=analysing-numeric-digital-literacies",
       "name":"Management and financial accounting: Know your numbers 1",
       "Rating":"Management and financial accounting: Know your numbers 1\n4.7\nstars\n224 ratings\n•\n54 reviews\n\nFinancial literacy is a fundamental capability for any business leader, whether you are running your own small business/start-up or working at a large organisation. This course will provide you with a sound foundational understanding of financial and management accounting, and how to use accounting to facilitate and align decisions made by owners, managers and employees. Via structured learning activities (video lectures, quizzes, discussion prompts and written assessments) you will develop the ability to seek out financial opportunities and avoid financial misadventure. You’ll learn how to organise, create, interpret and communicate important financial information effectively, which will help you improve your organisation’s internal procedures and processes.\n\nSHOW ALL ABOUT MANAGEMENT AND FINANCIAL ACCOUNTING: KNOW YOUR NUMBERS 1\nSHOW ALL"
    },
    {
       "Url":"/learn/corporate-finance-know-your-numbers-2?specialization=analysing-numeric-digital-literacies",
       "name":"Corporate finance: Know your numbers 2",
       "Rating":"Corporate finance: Know your numbers 2\n3.6\nstars\n21 ratings\n•\n11 reviews\n\nEvery manager must have a foundational understanding of financial management. This course will prepare you for responsible and sustainable leadership from a financial management perspective. Via structured learning activities (video lectures, quizzes, discussion prompts and written assessments) you’ll learn the key aspects of effective financial management by focusing on: the assessment of an organisation’s financial health; planning future financial performance; financing of operations; and evaluating business and investment opportunities for the organisation. This course will emphasise how crucial sound financial management is for you and your organisation to be successful in the real-world.\n\nSHOW ALL ABOUT CORPORATE FINANCE: KNOW YOUR NUMBERS 2\nSHOW ALL"
    },
    {
       "Url":"/learn/business-intelligence-data-analytics?specialization=analysing-numeric-digital-literacies",
       "name":"Business intelligence and data analytics: Generate insights",
       "Rating":"Business intelligence and data analytics: Generate insights\n4.6\nstars\n316 ratings\n•\n101 reviews\n\n‘Megatrends’ heavily influence today’s organisations, industries and societies, and your ability to generate insights in this area is crucial to your organisation’s success into the future. This course will introduce you to analytical tools and skills you can use to understand, analyse and evaluate the challenges and opportunities ‘megatrends’ will inevitably bring to your organisation. Via structured learning activities you will explore how these trends can be addressed through sustainability-oriented innovation. You will be introduced to key data analytics concepts such as systems thinking, multi-level perspectives and multidisciplinary methods for envisioning futures, and apply them to specific real-world challenges you and your organisation may face. And there’ll be a focus on future-proofing skills such as teamwork, collaboration with diverse stakeholders and accounting for judgements made within ethical decision-making frameworks.\n\nSHOW ALL ABOUT BUSINESS INTELLIGENCE AND DATA ANALYTICS: GENERATE INSIGHTS\nSHOW ALL"
    },
    {
       "Url":"/learn/marketing-analytics-customers?specialization=analysing-numeric-digital-literacies",
       "name":"Marketing analytics: Know your customers",
       "Rating":"Marketing analytics: Know your customers\n4.7\nstars\n252 ratings\n•\n66 reviews\n\nAre your customers at the centre of your organisation’s strategy? An understanding of marketing analytics, the core component of this course, is crucial to serving your customers well. Through structured learning activities (video lectures, quizzes, discussion prompts, industry interviews and written assessments) this course will teach you what to measure – and how – in order to maximise customer value. Rapid advancements in technology mean more powerful data and analytics can inform marketing decisions. However, multiple touchpoints across the customer journey make it increasingly difficult to measure effectiveness. You will develop an understanding of traditional and digital marketing metrics and what questions they answer, as well as how to achieve a single integrated view of the customer. You’ll experiment with behaviour and predictive analytics to develop marketing that delivers customers the right product via the right channel at the right time.\n\nSHOW ALL ABOUT MARKETING ANALYTICS: KNOW YOUR CUSTOMERS\nSHOW ALL"
    },
    "/specializations/key-technologies-data-analytics",
    {
       "Url":"/learn/fundamentals-of-data-analysis?specialization=key-technologies-data-analytics",
       "name":"Fundamentals of Data Analysis",
       "Rating":"Fundamentals of Data Analysis\n\nThis course is the first of a series that aims to prepare you for a role working in data analytics. In this course, you’ll be introduced to many of the primary types of data analytics and core concepts. You’ll learn about the tools and skills required to conduct data analysis. We’ll go through some of the foundational math and statistics used in data analysis and workflows for conducting efficient and effective data analytics. This course covers a wide variety of topics that are critical for working in data analytics and are designed to give you an introduction and overview as you begin to build relevant knowledge and skills.\n\nSHOW ALL ABOUT FUNDAMENTALS OF DATA ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/fundamentals-of-cloud-computing?specialization=key-technologies-data-analytics",
       "name":"Fundamentals of Cloud Computing",
       "Rating":"Fundamentals of Cloud Computing\n\nThis course is the second of a series that aims to prepare you for a role working in data analytics. In this course, you will be introduced to many of the core concepts of cloud computing. You will learn about the primary deployment models. We’ll go through the common cloud computing service models. The hands on material offers the opportunity to review and configure a cloud account. This course covers a wide variety of topics that are critical for understanding cloud computing and are designed to give you an introduction and overview as you begin to build relevant knowledge and skills.\n\nSHOW ALL ABOUT FUNDAMENTALS OF CLOUD COMPUTING\nSHOW ALL"
    },
    {
       "Url":"/learn/fundamentals-of-data-warehousing?specialization=key-technologies-data-analytics",
       "name":"Fundamentals of Data Warehousing",
       "Rating":"Fundamentals of Data Warehousing\n\nWelcome to Fundamentals of Data Warehousing, the third course of the Key Technologies of Data Analytics specialization. By enrolling in this course, you are taking the next step in your career in data analytics. This course is the third of a series that aims to prepare you for a role working in data analytics. In this course, you will be introduced to many of the core concepts of data warehousing. You will learn about the primary components of data warehousing. We’ll go through the common data warehousing architectures. The hands-on material offers to add storage to your cloud environment and configure a database. This course covers a wide variety of topics that are critical for understanding data warehousing and are designed to give you an introduction and overview as you begin to build relevant knowledge and skills.\n\nSHOW ALL ABOUT FUNDAMENTALS OF DATA WAREHOUSING\nSHOW ALL"
    },
    {
       "Url":"/learn/fundamentals-of-big-data?specialization=key-technologies-data-analytics",
       "name":"Fundamentals of Big Data",
       "Rating":"Fundamentals of Big Data\n\nWelcome to Fundamentals of Big Data, the fourth course of the Key Technologies of Data Analytics specialization. By enrolling in this course, you are taking the next step in your career in data analytics. This course is the fourth of a series that aims to prepare you for a role working in data analytics. In this course, you will be introduced to many of the core concepts of big data. You will learn about the primary systems used in big data. We’ll go through phases of a common big data life cycle. This course covers a wide variety of topics that are critical for understanding big data and are designed to give you an introduction and overview as you begin to build relevant knowledge and skills.\n\nSHOW ALL ABOUT FUNDAMENTALS OF BIG DATA\nSHOW ALL"
    },
    "/specializations/michiganux",
    {
       "Url":"/learn/introtoux-principles-and-processes?specialization=michiganux",
       "name":"Introduction to User Experience Principles and Processes",
       "Rating":"Introduction to User Experience Principles and Processes\n4.8\nstars\n1,108 ratings\n•\n275 reviews\n\nThis UX course provides an introduction to the fields of UX research and design. Learners will gain an understanding of what is involved in UX research, including conducting interviews, evaluating systems, and analyzing systems using principles of good design. Learners will also learn about the work involved in UX Design, including the generation of promising design solutions and the creation of prototypes at multiple levels of fidelity. By interleaving successive phases of UX Research and Design, learners will see how to learn from inevitable mistakes and improve towards a product with a great UX.\n\nWhat you'll learn:\n\n- The skills needed for UX research and design\n- How UX researchers discover and assess user needs and assess possible designs\n- How to conduct a micro-usability test\n- How UX designers use sketching and prototyping to develop design concepts\n- How to incorporate a user-centered focus into the design process\n- Key features of human behavior and describe their impact on the design of interactive systems\n- Techniques for critiquing and designing interactive systems based on human capabilities and behavior\n\nSHOW ALL ABOUT INTRODUCTION TO USER EXPERIENCE PRINCIPLES AND PROCESSES\nSHOW ALL"
    },
    {
       "Url":"/learn/understanding-user-needs?specialization=michiganux",
       "name":"Understanding User Needs",
       "Rating":"Understanding User Needs\n4.7\nstars\n382 ratings\n•\n81 reviews\n\nDesigning effective interactive systems requires understanding the needs and capabilities of the people who will be using them. In this UX course we will focus on how to interact with users (or potential users) to understand what they need, what they currently do, what they love and hate, and examine human capabilities and behavior as they relate to UX design.\n\nLearners will be introduced to numerous techniques to gather data from and about users.\n\nThis course is part of the User Experience (UX) Research and Design specialization offered on Coursera.\n\nWhat you'll learn:\n\n     Find out what user needs assessments are, what qualitative research is, and how the two are related.\n     Learn an end-to-end methodology for qualitative research that is suited for understanding user needs. The methodology \n     includes knowledge of semi-structured interviews, in-situ observation, and affinity walls.\n     Be exposed to good practices for conducting semi-structured interviews, in-situ observation, and affinity walls.\n     Gain some experience with semi-structured interviews, in-situ observations, and affinity walls.\n\nSHOW ALL ABOUT UNDERSTANDING USER NEEDS\nSHOW ALL"
    },
    {
       "Url":"/learn/evaluating-designs-with-users?specialization=michiganux",
       "name":"Evaluating Designs with Users",
       "Rating":"Evaluating Designs with Users\n4.8\nstars\n220 ratings\n•\n42 reviews\n\nWhen designing systems that work for users, there is no substitute for watching them try to use the system to see what works and what doesn’t.\n\nIn this UX course, you will learn how to design and conduct tests with users that will tell you how effective your design is for helping users do what they need to do, and how they feel about using your system.\n\nThis course is part of the User Experience (UX) Research and Design specialization offered on Coursera.\n\nWhat you'll learn:\n\n    Identify different approaches to user testing and their appropriate use\n    Understand how to design an effective user test\n    Understand how to run an effective user test to get the most information possible out of each encounter\n    Analyze and report on user testing\n\nSHOW ALL ABOUT EVALUATING DESIGNS WITH USERS\nSHOW ALL"
    },
    {
       "Url":"/learn/ux-design-concept-wireframe?specialization=michiganux",
       "name":"UX Design: From Concept to Prototype",
       "Rating":"UX Design: From Concept to Prototype\n4.8\nstars\n218 ratings\n•\n51 reviews\n\nGreat design doesn’t come out of nowhere; it is born, nurtured, and grown--all through a systematic, learnable process. In this UX course, you will explore the process of taking a basic concept, grounded in user needs, and developing it into a design that will address those needs. In the course, you will gain hands-on experience with techniques such as sketching, scenario development, storyboarding, and wireframing that will help you transform your understanding of what your users need into a compelling user experience. You will then learn how to turn wireframes and interaction architecture into interactive prototypes that can be tested with prospective users and iteratively refined into a high quality design that that is ready for a hand-off to the development team for implementation.\n\nWhat You’ll Learn:\n    Define and scope the design problem you will try to address\n    Create user stories and storyboards to transform information about user needs into design concepts\n    Produce sketches and conduct brainstorming sessions to generate many design ideas from which you can construct a high-quality design solution\n    Develop interface wireframes to concretize the design and enable early user testing\n    Conduct user tests with paper prototypes to get preliminary user feedback on the design concept and interactions\n    Develop high-fidelity mockups that specify visual design elements\n    Create Wizard of Oz prototypes to efficiently test complex interactions and interactive systems that are not screen-based (e.g., smart assistants)\n\nSHOW ALL ABOUT UX DESIGN: FROM CONCEPT TO PROTOTYPE\nSHOW ALL"
    },
    {
       "Url":"/learn/ux-research-at-scale?specialization=michiganux",
       "name":"UX Research at Scale: Surveys, Analytics, Online Testing",
       "Rating":"UX Research at Scale: Surveys, Analytics, Online Testing\n4.4\nstars\n126 ratings\n•\n29 reviews\n\nThis UX course will provide an overview of survey methodology from the perspective of UX research. UX surveys typically focus on uncovering user needs, connecting needs to user characteristics, and gaining insight into user attitudes towards systems they use. In this course, learners will learn the basics of UX survey research and conduct a survey of their own design!\n\nLearners will be introduced to techniques for gaining UX insights from large numbers of users, including web analytics, A/B testing, and remote unmoderated studies. We will discuss how these techniques work, when they can be applied, and what can be learned by using them.\n\nWhat You’ll Learn:\n    -Learn how web analytics works and how to analyze analytics data\n    -Understand how to develop A-B tests, before/after, and multivariate experiments\n    -Learn how to set up and analyze remote unmoderated testing studies\n    -Analyze and report on large scale user experience studies  Learn about the different types and uses of surveys in UX research\n    -Understand the survey population: when to sample, when to recruit\n    -Develop a survey instrument that meets your requirements\n    -Analyze and report on surveys\n    -Learn to critique user surveys\n\nSHOW ALL ABOUT UX RESEARCH AT SCALE: SURVEYS, ANALYTICS, ONLINE TESTING\nSHOW ALL"
    },
    {
       "Url":"/learn/user-experience-capstone?specialization=michiganux",
       "name":"UX (User Experience) Capstone",
       "Rating":"UX (User Experience) Capstone\n4.6\nstars\n40 ratings\n•\n10 reviews\n\nIn this UX capstone course, you’ll conduct a multi-stage user experience project to design a product from scratch. You will employ interviews, inspection methods, and user testing, along with ideation, design, and prototyping methods to gain and communicate valuable insight that can be used to deliver a compelling product.\n\nYou will:\n    Learn how to design and carry out an integrated multi-phase user experience research and design project\n    Gain experience conducting user experience research in a real-world setting\n    Gain hands-on experience with a realistic UX design project\n    Improve ability to communicate design concepts and actionable research findings.\n\nSHOW ALL ABOUT UX (USER EXPERIENCE) CAPSTONE\nSHOW ALL"
    },
    "/specializations/secure-software-design",
    {
       "Url":"/learn/software-design-development-life-cycle?specialization=secure-software-design",
       "name":"Software Design as an Element of the Software Development Lifecycle",
       "Rating":"Software Design as an Element of the Software Development Lifecycle\n4.6\nstars\n210 ratings\n•\n52 reviews\n\nThis course talks about software development lifecycles a description/prescription for how we write software.  Design is a step in this life cycle, and the course explores the implications of this.  Design has a role in the life cycle; it is always there, regardless of the kind of life cycle we’re talking about.  Why is that?  Why was design considered as a step in this life cycle?\n\nSHOW ALL ABOUT SOFTWARE DESIGN AS AN ELEMENT OF THE SOFTWARE DEVELOPMENT LIFECYCLE\nSHOW ALL"
    },
    {
       "Url":"/learn/software-design-abstraction?specialization=secure-software-design",
       "name":"Software Design as an Abstraction",
       "Rating":"Software Design as an Abstraction\n4.7\nstars\n114 ratings\n•\n26 reviews\n\nThe design step in developing software has some unique characteristics.  First of all, it’s the only step where drawing pictures of things is the norm.  Why is that?  What do pictures do that other representations cannot do?  Pictures have varying levels of detail; pictures have context.  Pictures…paint a picture.  Why are these things important?  In this course, too, we begin looking at other disciplines (building architecture is a favorite one) for lessons on design.\n\nSHOW ALL ABOUT SOFTWARE DESIGN AS AN ABSTRACTION\nSHOW ALL"
    },
    {
       "Url":"/learn/software-design-methods-tools?specialization=secure-software-design",
       "name":"Software Design Methods and Tools",
       "Rating":"Software Design Methods and Tools\n4.8\nstars\n100 ratings\n•\n19 reviews\n\nSince many software developers are compulsive coders, they have created software over the years to help them do their job.  There are tools which make design and its associated tasks easier.  The course introduces some basic tools and techniques to help you with design.  Tools aren’t always tangible, however.  The last two lessons of this course discuss questions of Ethics in software development. The purpose here is, as with tools, to equip you to better carry our your responsibilities as a designer. Students will be required to have a prior knowledge of writing and delivering software and some programming knowledge in java.\n\nSHOW ALL ABOUT SOFTWARE DESIGN METHODS AND TOOLS\nSHOW ALL"
    },
    {
       "Url":"/learn/software-design-threats-mitigations?specialization=secure-software-design",
       "name":"Software Design Threats and Mitigations",
       "Rating":"Software Design Threats and Mitigations\n4.7\nstars\n68 ratings\n•\n9 reviews\n\nThe design step in developing software has some unique characteristics.  First of all, it’s the only step where drawing pictures of things is the norm.  Why is that?  What do pictures do that other representations cannot do?  Pictures have varying levels of detail; pictures have context.  Pictures…paint a picture.  Why are these things important?  In this course, too, we begin looking at other disciplines (building architecture is a favorite one) for lessons on design.\n\nSHOW ALL ABOUT SOFTWARE DESIGN THREATS AND MITIGATIONS\nSHOW ALL"
    },
    "/specializations/javascript-security",
    {
       "Url":"/learn/javascript-security-refreshers?specialization=javascript-security",
       "name":"JavaScript Security Refreshers",
       "Rating":"JavaScript Security Refreshers\n\nThis course is a Secure Javascript Programming Overview. It gives the student an introduction to JavaScript security and covers important topics like authentication best practices and refreshers on  JavaScript, Web browsers and Node.js."
    },
    {
       "Url":"/learn/javascript-security-part-1?specialization=javascript-security",
       "name":"JavaScript Security Part 1",
       "Rating":"JavaScript Security Part 1\n\nThis course covers XSS and Javascript Remote Code Execution and CSRF and Browser Security."
    },
    {
       "Url":"/learn/javascript-security-part-2?specialization=javascript-security",
       "name":"JavaScript Security Part 2",
       "Rating":"JavaScript Security Part 2\n\nThis course covers Expressions, Prototype Pollution and Ecosystem Modules (npm) and Supply Chain."
    },
    {
       "Url":"/learn/javascript-security-part-3?specialization=javascript-security",
       "name":"JavaScript Security Part 3",
       "Rating":"JavaScript Security Part 3\n\nThis course covers Serverless Javascript and Web Developer Desktop Security."
    },
    "/specializations/vital-skills-for-data-science",
    {
       "Url":"/learn/data-science-as-a-field?specialization=vital-skills-for-data-science",
       "name":"Data Science as a Field",
       "Rating":"Data Science as a Field\n\nThis course provides a general introduction to the field of Data Science. It has been designed for aspiring data scientists, content experts who work with data scientists, or anyone interested in learning about what Data Science is and what it’s used for. Weekly topics include an overview of the skills needed to be a data scientist; the process and pitfalls involved in data science; and the practice of data science in the professional and academic world. This course is part of CU Boulder’s Master’s of Science in Data Science and was collaboratively designed by both academics and industry professionals to provide learners with an insider’s perspective on this exciting, evolving, and increasingly vital discipline.\n\nData Science as a Field can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nSHOW ALL ABOUT DATA SCIENCE AS A FIELD\nSHOW ALL"
    },
    {
       "Url":"/learn/ethical-issues-data-science?specialization=vital-skills-for-data-science",
       "name":"Ethical Issues in Data Science",
       "Rating":"Ethical Issues in Data Science\n\nComputing applications involving large amounts of data – the domain of data science – impact the lives of most people in the U.S. and the world. These impacts include recommendations made to us by internet-based systems, information that is available about us online, techniques that are used for security and surveillance, data that is used in health care, and many more.  In many cases, they are affected by techniques in artificial intelligence and machine learning.\n\nThis course examines some of the ethical issues related to data science, with the fundamental objective of making data science professionals aware of and sensitive to ethical considerations that may arise in their careers. It does this through a combination of discussion of ethical frameworks, examination of a variety of data science applications that lead to ethical considerations, reading current media and scholarly articles, and drawing upon the perspectives and experiences of fellow students and computing professionals.\n\nEthical Issues in Data Science can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nSHOW ALL ABOUT ETHICAL ISSUES IN DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/cybersecurity-for-data-science?specialization=vital-skills-for-data-science",
       "name":"Cybersecurity for Data Science",
       "Rating":"Cybersecurity for Data Science\n\nThis course aims to help anyone interested in data science understand the cybersecurity risks and the tools/techniques that can be used to mitigate those risks.  We will cover the distinctions between confidentiality, integrity, and availability, introduce learners to relevant cybersecurity tools and techniques including cryptographic tools, software resources, and policies that will be essential to data science. We will explore key tools and techniques for authentication and access control so producers, curators, and users of data can help ensure the security and privacy of the data.\n\nThis course can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nSHOW ALL ABOUT CYBERSECURITY FOR DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/fundamentals-of-data-visualization?specialization=vital-skills-for-data-science",
       "name":"Fundamentals of Data Visualization",
       "Rating":"Fundamentals of Data Visualization\n\nData is everywhere. Charts, graphs, and other types of information visualizations help people to make sense of this data. This course explores the design, development, and evaluation of such information visualizations. By combining aspects of design, computer graphics, HCI, and data science, you will gain hands-on experience with creating visualizations, using exploratory tools, and architecting data narratives. Topics include user-centered design, web-based visualization, data cognition and perception, and design evaluation.\n\nThis course can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nSHOW ALL ABOUT FUNDAMENTALS OF DATA VISUALIZATION\nSHOW ALL"
    },
    "/specializations/introduction-data-science",
    {
       "Url":"/learn/what-is-datascience?specialization=introduction-data-science",
       "name":"What is Data Science?",
       "Rating":"What is Data Science?\n4.7\nstars\n48,273 ratings\n•\n9,106 reviews\n\nThe art of uncovering the insights and trends in data has been around since ancient times. The ancient Egyptians used census data to increase efficiency in tax collection and they accurately predicted the flooding of the Nile river every year. Since then, people working in data science have carved out a unique and distinct field for the work they do. This field is data science. In this course, we will meet some data science practitioners and we will get an overview of what data science is today.\n\nSHOW ALL ABOUT WHAT IS DATA SCIENCE? \nSHOW ALL"
    },
    {
       "Url":"/learn/open-source-tools-for-data-science?specialization=introduction-data-science",
       "name":"Tools for Data Science",
       "Rating":"Tools for Data Science\n4.5\nstars\n22,223 ratings\n•\n3,472 reviews\n\nWhat are some of the most popular data science tools, how do you use them, and what are their features? In this course, you'll learn about Jupyter Notebooks, JupyterLab, RStudio IDE, Git, GitHub, and Watson Studio. You will learn about what each tool is used for, what programming languages they can execute, their features and limitations. With the tools hosted in the cloud on Skills Network Labs, you will be able to test each tool and follow instructions to run simple code in Python, R or Scala. To end the course, you will create a final project with a Jupyter Notebook on IBM Watson Studio and demonstrate your proficiency preparing a notebook, writing Markdown, and sharing your work with your peers.\n\nSHOW ALL ABOUT TOOLS FOR DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/data-science-methodology?specialization=introduction-data-science",
       "name":"Data Science Methodology",
       "Rating":"Data Science Methodology\n4.6\nstars\n16,639 ratings\n•\n2,017 reviews\n\nDespite the recent increase in computing power and access to data over the last couple of decades, our ability to use the data within the decision making process is either lost or not maximized at all too often, we don't have a solid understanding of the questions being asked and how to apply the data correctly to the problem at hand.\n\nThis course has one purpose, and that is to share a methodology that can be used within data science, to ensure that the data used in problem solving is relevant and properly manipulated to address the question at hand.\n\nAccordingly, in this course, you will learn:\n    - The major steps involved in tackling a data science problem.\n    - The major steps involved in practicing data science, from forming a concrete business or research problem, to collecting and analyzing data, to building a model, and understanding the feedback after model deployment.\n    - How data scientists think!\n\nLIMITED TIME OFFER: Subscription is only $39 USD per month for access to graded materials and a certificate.\n\nSHOW ALL ABOUT DATA SCIENCE METHODOLOGY\nSHOW ALL"
    },
    {
       "Url":"/learn/sql-data-science?specialization=introduction-data-science",
       "name":"Databases and SQL for Data Science with Python",
       "Rating":"Databases and SQL for Data Science with Python\n4.7\nstars\n13,764 ratings\n•\n1,659 reviews\n\nMuch of the world's data resides in databases. SQL (or Structured Query Language) is a powerful language which is used for communicating with and extracting data from databases. A working knowledge of databases and SQL is a must if you want to become a data scientist.\n\nThe purpose of this course is to introduce relational database concepts and help you learn and apply foundational knowledge of the SQL language. It is also intended to get you started with performing SQL access in a data science environment.  \n\nThe emphasis in this course is on hands-on and practical learning . As such, you will work with real databases, real data science tools, and real-world datasets. You will create a database instance in the cloud. Through a series of hands-on labs you will practice building and running SQL queries. You will also learn how to access databases from Jupyter notebooks using SQL and Python.\n\nNo prior knowledge of databases, SQL, Python, or programming is required.\n\nAnyone can audit this course at no-charge. If you choose to take this course and earn the Coursera course certificate, you can also earn an IBM digital badge upon successful completion of the course.\n\nLIMITED TIME OFFER: Subscription is only $39 USD per month for access to graded materials and a certificate.\n\nSHOW ALL ABOUT DATABASES AND SQL FOR DATA SCIENCE WITH PYTHON\nSHOW ALL"
    },
    "/specializations/data-science-fundamentals-python-sql",
    {
       "Url":"/learn/open-source-tools-for-data-science?specialization=data-science-fundamentals-python-sql",
       "name":"Tools for Data Science",
       "Rating":"Tools for Data Science\n4.5\nstars\n22,223 ratings\n•\n3,472 reviews\n\nWhat are some of the most popular data science tools, how do you use them, and what are their features? In this course, you'll learn about Jupyter Notebooks, JupyterLab, RStudio IDE, Git, GitHub, and Watson Studio. You will learn about what each tool is used for, what programming languages they can execute, their features and limitations. With the tools hosted in the cloud on Skills Network Labs, you will be able to test each tool and follow instructions to run simple code in Python, R or Scala. To end the course, you will create a final project with a Jupyter Notebook on IBM Watson Studio and demonstrate your proficiency preparing a notebook, writing Markdown, and sharing your work with your peers.\n\nSHOW ALL ABOUT TOOLS FOR DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/python-for-applied-data-science-ai?specialization=data-science-fundamentals-python-sql",
       "name":"Python for Data Science, AI & Development",
       "Rating":"Python for Data Science, AI & Development\n4.6\nstars\n22,873 ratings\n•\n3,757 reviews\n\nKickstart your learning of Python for data science, as well as programming in general, with this beginner-friendly introduction to Python. Python is one of the world’s most popular programming languages, and there has never been greater demand for professionals with the ability to apply Python fundamentals to drive business solutions across industries. \n\nThis course will take you from zero to programming in Python in a matter of hours—no prior programming experience necessary! You will learn Python fundamentals, including data structures and data analysis, complete hands-on exercises throughout the course modules, and create a final project to demonstrate your new skills. \n\nBy the end of this course, you’ll feel comfortable creating basic programs, working with data, and solving real-world problems in Python. You’ll gain a strong foundation for more advanced learning in the field, and develop skills to help advance your career. \n\nThis course can be applied to multiple Specialization or Professional Certificate programs. Completing this course will count towards your learning in any of the following programs: \n\nIBM Applied AI Professional Certificate \n\nApplied Data Science Specialization \n\nIBM Data Science Professional Certificate \n\nUpon completion of any of the above programs, in addition to earning a Specialization completion certificate from Coursera, you’ll also receive a digital badge from IBM recognizing your expertise in the field.\n\nSHOW ALL ABOUT PYTHON FOR DATA SCIENCE, AI & DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/python-project-for-data-science?specialization=data-science-fundamentals-python-sql",
       "name":"Python Project for Data Science",
       "Rating":"Python Project for Data Science\n4.5\nstars\n1,044 ratings\n•\n204 reviews\n\nThis mini-course is intended to for you to demonstrate foundational Python skills for working with data. The completion of this course involves working on a hands-on project where you will develop a simple dashboard using Python.\n\nThis course is part of the IBM Data Science Professional Certificate and the IBM Data Analytics Professional Certificate.\n\nPRE-REQUISITE: **Python for Data Science, AI and Development** course from IBM is a pre-requisite for this project course. Please ensure that before taking this course you have either completed the Python for Data Science, AI and Development course from IBM or have equivalent proficiency in working with Python and data.\n\nNOTE: This course is not intended to teach you Python and does not have too much instructional content. It is intended for you to apply prior Python knowledge.\n\nSHOW ALL ABOUT PYTHON PROJECT FOR DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/statistics-for-data-science-python?specialization=data-science-fundamentals-python-sql",
       "name":"Statistics for Data Science with Python",
       "Rating":"Statistics for Data Science with Python\n4.6\nstars\n142 ratings\n•\n34 reviews\n\nThis Statistics for Data Science course is designed to introduce you to the basic principles of statistical methods and procedures used for data analysis. After completing this course you will have practical knowledge of crucial topics in statistics including  - data gathering, summarizing data using descriptive statistics, displaying and visualizing data, examining relationships between variables, probability distributions, expected values, hypothesis testing, introduction to ANOVA (analysis of variance), regression and correlation analysis. You will take a hands-on approach to statistical analysis using Python and Jupyter Notebooks – the tools of choice for Data Scientists and Data Analysts. \n\nAt the end of the course, you will complete a project to apply various concepts in the course to a Data Science problem involving a real-life inspired scenario and demonstrate an understanding of the foundational statistical thinking and reasoning. The focus is on developing a clear understanding of the different \napproaches for different data types, developing an intuitive understanding, making appropriate assessments of the proposed methods, using Python to analyze our data, and interpreting the output accurately. \n\nThis course is suitable for a variety of professionals and students intending to start their journey in data and statistics-driven roles such as Data Scientists, Data Analysts, Business Analysts, Statisticians, and Researchers. It does not require any computer science or statistics background.  We strongly recommend taking the Python for Data Science course before starting this course to get familiar with the Python programming language,  Jupyter notebooks, and libraries. An optional refresher on Python is also provided.\n\nAfter completing this course, a learner will be able to:\n✔Calculate and apply measures of central tendency and measures of dispersion to grouped and ungrouped data.\n✔Summarize, present, and visualize data in a way that is clear, concise, and provides a practical insight for non-statisticians needing the results.\n✔Identify appropriate hypothesis tests to use for common data sets.\n✔Conduct hypothesis tests, correlation tests, and regression analysis.\n✔Demonstrate proficiency in statistical analysis using Python and Jupyter Notebooks.\n\nSHOW ALL ABOUT STATISTICS FOR DATA SCIENCE WITH PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/sql-data-science?specialization=data-science-fundamentals-python-sql",
       "name":"Databases and SQL for Data Science with Python",
       "Rating":"Databases and SQL for Data Science with Python\n4.7\nstars\n13,764 ratings\n•\n1,659 reviews\n\nMuch of the world's data resides in databases. SQL (or Structured Query Language) is a powerful language which is used for communicating with and extracting data from databases. A working knowledge of databases and SQL is a must if you want to become a data scientist.\n\nThe purpose of this course is to introduce relational database concepts and help you learn and apply foundational knowledge of the SQL language. It is also intended to get you started with performing SQL access in a data science environment.  \n\nThe emphasis in this course is on hands-on and practical learning . As such, you will work with real databases, real data science tools, and real-world datasets. You will create a database instance in the cloud. Through a series of hands-on labs you will practice building and running SQL queries. You will also learn how to access databases from Jupyter notebooks using SQL and Python.\n\nNo prior knowledge of databases, SQL, Python, or programming is required.\n\nAnyone can audit this course at no-charge. If you choose to take this course and earn the Coursera course certificate, you can also earn an IBM digital badge upon successful completion of the course.\n\nLIMITED TIME OFFER: Subscription is only $39 USD per month for access to graded materials and a certificate.\n\nSHOW ALL ABOUT DATABASES AND SQL FOR DATA SCIENCE WITH PYTHON\nSHOW ALL"
    },
    "/specializations/applied-data-science",
    {
       "Url":"/learn/python-for-applied-data-science-ai?specialization=applied-data-science",
       "name":"Python for Data Science, AI & Development",
       "Rating":"Python for Data Science, AI & Development\n4.6\nstars\n22,873 ratings\n•\n3,757 reviews\n\nKickstart your learning of Python for data science, as well as programming in general, with this beginner-friendly introduction to Python. Python is one of the world’s most popular programming languages, and there has never been greater demand for professionals with the ability to apply Python fundamentals to drive business solutions across industries. \n\nThis course will take you from zero to programming in Python in a matter of hours—no prior programming experience necessary! You will learn Python fundamentals, including data structures and data analysis, complete hands-on exercises throughout the course modules, and create a final project to demonstrate your new skills. \n\nBy the end of this course, you’ll feel comfortable creating basic programs, working with data, and solving real-world problems in Python. You’ll gain a strong foundation for more advanced learning in the field, and develop skills to help advance your career. \n\nThis course can be applied to multiple Specialization or Professional Certificate programs. Completing this course will count towards your learning in any of the following programs: \n\nIBM Applied AI Professional Certificate \n\nApplied Data Science Specialization \n\nIBM Data Science Professional Certificate \n\nUpon completion of any of the above programs, in addition to earning a Specialization completion certificate from Coursera, you’ll also receive a digital badge from IBM recognizing your expertise in the field.\n\nSHOW ALL ABOUT PYTHON FOR DATA SCIENCE, AI & DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/python-project-for-data-science?specialization=applied-data-science",
       "name":"Python Project for Data Science",
       "Rating":"Python Project for Data Science\n4.5\nstars\n1,044 ratings\n•\n204 reviews\n\nThis mini-course is intended to for you to demonstrate foundational Python skills for working with data. The completion of this course involves working on a hands-on project where you will develop a simple dashboard using Python.\n\nThis course is part of the IBM Data Science Professional Certificate and the IBM Data Analytics Professional Certificate.\n\nPRE-REQUISITE: **Python for Data Science, AI and Development** course from IBM is a pre-requisite for this project course. Please ensure that before taking this course you have either completed the Python for Data Science, AI and Development course from IBM or have equivalent proficiency in working with Python and data.\n\nNOTE: This course is not intended to teach you Python and does not have too much instructional content. It is intended for you to apply prior Python knowledge.\n\nSHOW ALL ABOUT PYTHON PROJECT FOR DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/data-analysis-with-python?specialization=applied-data-science",
       "name":"Data Analysis with Python",
       "Rating":"Data Analysis with Python\n4.7\nstars\n13,847 ratings\n•\n2,048 reviews\n\nLearn how to analyze data using Python. This course will take you from the basics of Python to exploring many different types of data. You will learn how to prepare data for analysis, perform simple statistical analysis, create meaningful data visualizations, predict future trends from data, and more!\n\nTopics covered:\n\n1) Importing Datasets\n2) Cleaning the Data\n3) Data frame manipulation\n4) Summarizing the Data\n5) Building machine learning Regression models\n6) Building data pipelines\n\n Data Analysis with Python will be delivered through lecture, lab, and assignments. It includes following parts:\n\nData Analysis libraries: will learn to use Pandas, Numpy and Scipy libraries to work with a sample dataset. We will introduce you to pandas, an open-source library, and we will use it to load, manipulate, analyze, and visualize cool datasets. Then we will introduce you to another open-source library, scikit-learn, and we will use some of its machine learning algorithms to build smart models and make cool predictions.\n\nIf you choose to take this course and earn the Coursera course certificate, you will also earn an IBM digital badge.  \n\nLIMITED TIME OFFER: Subscription is only $39 USD per month for access to graded materials and a certificate.\n\nSHOW ALL ABOUT DATA ANALYSIS WITH PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/python-for-data-visualization?specialization=applied-data-science",
       "name":"Data Visualization with Python",
       "Rating":"Data Visualization with Python\n4.5\nstars\n9,488 ratings\n•\n1,419 reviews\n\n\"A picture is worth a thousand words\". We are all familiar with this expression. It especially applies when trying to explain the insight obtained from the analysis of increasingly large datasets. Data visualization plays an essential role in the representation of both small and large-scale data.\n\nOne of the key skills of a data scientist is the ability to tell a compelling story, visualizing data and findings in an approachable and stimulating way. Learning how to leverage a software tool to visualize data will also enable you to extract information, better understand the data, and make more effective decisions.\n\nThe main goal of this Data Visualization with Python course is to teach you how to take data that at first glance has little meaning and present that data in a form that makes sense to people. Various techniques have been developed for presenting data visually but in this course, we will be using several data visualization libraries in Python, namely Matplotlib, Seaborn, and Folium.\n\nLIMITED TIME OFFER: Subscription is only $39 USD per month for access to graded materials and a certificate.\n\nSHOW ALL ABOUT DATA VISUALIZATION WITH PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/applied-data-science-capstone?specialization=applied-data-science",
       "name":"Applied Data Science Capstone",
       "Rating":"Applied Data Science Capstone\n4.7\nstars\n5,542 ratings\n•\n718 reviews\n\nThis capstone project course will give you a taste of what data scientists go through in real life when working with real datasets. You will assume the role of a Data Scientist working for a startup intending to compete with SpaceX, and in the process follow the Data Science methodology involving data collection, data wrangling, exploratory data analysis, data visualization, model development, model evaluation, and reporting your results to stakeholders.   \n\nYou are tasked with predicting if the first stage of the SpaceX Falcon 9 rocket will land successfully.  SpaceX advertises Falcon 9 rocket launches on its website, with a cost of 62 million dollars; other providers cost upward of 165 million dollars each, much of the savings is because SpaceX can reuse the first stage. \n\nTherefore if you can accurately predict the likelyhood of the first stage rocket landing successfully, you can determine the cost of a launch. With the help your Data Science findings and models, the competing startup you have been hired by, can make more informed bids against SpaceX for a rocket launch. \n\nThis course is the final course in the IBM Data Science Professional Certificate as well as the Applied Data Science with Python Specialization. It is expected that you have completed all of the prior courses in the specialization/certificate before starting this one, as it requires the application of the knowledge and skills taught in those courses. In this course there will not be too much new learning, and instead, the focus will be on hands-on work to demonstrate what you have learned in the previous courses.\n\nIf you choose to take this course and earn the Coursera course certificate, you will also earn an IBM digital badge upon successful completion of the course.\n\nSHOW ALL ABOUT APPLIED DATA SCIENCE CAPSTONE\nSHOW ALL"
    },
    "/specializations/data-analysis-visualization-foundations",
    {
       "Url":"/learn/introduction-to-data-analytics?specialization=data-analysis-visualization-foundations",
       "name":"Introduction to Data Analytics",
       "Rating":"Introduction to Data Analytics\n4.8\nstars\n3,322 ratings\n•\n737 reviews\n\nThis course presents a gentle introduction into the concepts of data analysis, the role of a Data Analyst, and the tools that are used to perform daily functions. You will gain an understanding of the data ecosystem and the fundamentals of data analysis, such as data gathering or data mining.  You will then learn the soft skills that are required to effectively communicate your data to stakeholders, and how mastering these skills can give you the option to become a data driven decision maker.\n\nThis course will help you to differentiate between the roles of a Data Analyst, Data Scientist, and Data Engineer. You will learn the responsibilities of a Data Analyst and exactly what data analysis entails. You will be able to summarize the data ecosystem, such as databases and data warehouses. You will then uncover the major vendors within the data ecosystem and explore the various tools on-premise and in the cloud. Continue this exciting journey and discover Big Data platforms such as Hadoop, Hive, and Spark. By the end of this course you will be able to visualize the daily life of a Data Analyst, understand the different career paths that are available for data analytics, and identify the many resources available for mastering this profession.\n\n     Throughout this course you will learn the key aspects to data analysis. You will begin to explore the fundamentals of gathering data, and learning how to identify your data sources. You will then learn how to clean, analyze, and share your data with the use of visualizations and dashboard tools. This all comes together in the final project where it will test your knowledge of the course material, explore what it means to be a Data Analyst, and provide a real-world scenario of data analysis. \n\n     This course does not require any prior data analysis, spreadsheet, or computer science experience. All you need to get started is basic computer literacy, high school level math, and access to a modern web browser such as Chrome or Firefox.\n\nSHOW ALL ABOUT INTRODUCTION TO DATA ANALYTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/excel-basics-data-analysis-ibm?specialization=data-analysis-visualization-foundations",
       "name":"Excel Basics for Data Analysis",
       "Rating":"Excel Basics for Data Analysis\n4.7\nstars\n1,478 ratings\n•\n272 reviews\n\nThis course is designed to provide you with basic working knowledge for using Excel spreadsheets for Data Analysis. It covers some of the first steps for working with spreadsheets and their usage in the process of analyzing data.  It includes plenty of videos, demos, and examples for you to learn, followed by step-by-step instructions for you to apply and practice on a live spreadsheet.\n\nExcel is an essential tool for working with data - whether for business, marketing, data analytics, or research. This course is suitable for those aspiring to take up Data Analysis or Data Science as a profession, as well as those who just want to use Excel for data analysis in their own domains. You will gain valuable experience in cleansing and wrangling data using functions and then analyze your data using techniques like filtering, sorting and creating pivot tables.   \n\nThis course starts with an introduction to spreadsheets like Microsoft Excel and Google Sheets and loading data from multiple formats. With this introduction you will then learn to perform some basic level data wrangling and cleansing tasks and continue to expand your knowledge of analyzing data through the use of filtering, sorting, and using pivot tables within the spreadsheet. By performing these tasks throughout the course, it will give you an understanding of how spreadsheets can be used as a data analysis tool and understand its limitations. \n\nThere is a strong focus on practice and applied learning in this course. With each lab, you will gain hands-on experience in manipulating data and begin to understand the important role of spreadsheets. Clean and analyze your data faster by understanding functions in the formatting of data. You will then convert your data to a pivot table and learn its features to make your data organized and readable. The final project enables you to show off your newly acquired data analysis skills. By the end of this course you will have worked with several data sets and spreadsheets and demonstrated the basics of cleaning and analyzing data all without having to learn any code. \n\nGetting started with Excel is made easy in this course. It does not require any prior experience with spreadsheets or coding. Nor does it require downloads or installation of any software. All you need is a device with a modern web browser, and ability to create a Microsoft account to access Excel online at no-cost.  However if you already have a desktop version of Excel, you can follow along quite easily as well.\n\nSHOW ALL ABOUT EXCEL BASICS FOR DATA ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/data-visualization-dashboards-excel-cognos?specialization=data-analysis-visualization-foundations",
       "name":"Data Visualization and Dashboards with Excel and Cognos",
       "Rating":"Data Visualization and Dashboards with Excel and Cognos\n4.7\nstars\n811 ratings\n•\n121 reviews\n\nThis course covers some of the first steps in the development of data visualizations using spreadsheets and dashboards. Begin the process of telling a story with your data by creating the many types of charts that are available in spreadsheets like Excel. Explore the different tools of a spreadsheet, such as the important pivot function and the ability to create dashboards and learn how each one has its own unique property to transform your data. Continue to gain valuable experience by becoming familiar with the popular analytics tool - IBM Cognos Analytics - to create interactive dashboards.\n\nBy completing this course, you will have a basic understanding of using spreadsheets as a data visualization tool. You will gain the ability to effectively create data visualizations, such as charts or graphs, and will begin to see how they play a key role in communicating your data analysis findings. All of this can be accomplished by learning the basics of data analysis with Excel and IBM Cognos Analytics, without having to write any code. By the end of this course you will be able to describe common dashboarding tools used by a data analyst, design and create a dashboard in a cloud platform, and begin to elevate your confidence level in creating intermediate level data visualizations. \n\nThroughout this course you will encounter numerous hands-on labs and a final project. With each lab, gain hands-on experience with creating basic and advanced charts, then continue through the course and begin creating dashboards with spreadsheets and IBM Cognos Analytics. You will then end this course by creating a set of data visualizations with IBM Cognos Analytics and creating an interactive dashboard that can be shared with peers, professional communities or prospective employers.\n\nThis course does not require any prior data analysis, or computer science experience. All you need to get started is basic computer literacy, high school level math, access to a modern web browser such as Chrome or Firefox, the ability to create a Microsoft account to access Excel for the Web, and a basic understanding of Excel spreadsheets.\n\nSHOW ALL ABOUT DATA VISUALIZATION AND DASHBOARDS WITH EXCEL AND COGNOS\nSHOW ALL"
    },
    "/specializations/finance-quantitative-modeling-analysts",
    {
       "Url":"/learn/wharton-quantitative-modeling?specialization=finance-quantitative-modeling-analysts",
       "name":"Fundamentals of Quantitative Modeling",
       "Rating":"Fundamentals of Quantitative Modeling\n4.6\nstars\n7,415 ratings\n•\n1,461 reviews\n\nHow can you put data to work for you? Specifically, how can numbers in a spreadsheet tell us about present and past business activities, and how can we use them to forecast the future? The answer is in building quantitative models, and this course is designed to help you understand the fundamentals of this critical, foundational, business skill. Through a series of short lectures, demonstrations, and assignments, you’ll learn the key ideas and process of quantitative modeling so that you can begin to create your own models for your own business or enterprise. By the end of this course, you will have seen a variety of practical commonly used quantitative models as well as the building blocks that will allow you to start structuring your own models. These building blocks will be put to use in the other courses in this Specialization.\n\nSHOW ALL ABOUT FUNDAMENTALS OF QUANTITATIVE MODELING\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-introduction-spreadsheets-models?specialization=finance-quantitative-modeling-analysts",
       "name":"Introduction to Spreadsheets and Models",
       "Rating":"Introduction to Spreadsheets and Models\n4.2\nstars\n3,443 ratings\n•\n643 reviews\n\nThe simple spreadsheet is one of the most powerful data analysis tools that exists, and it’s available to almost anyone. Major corporations and small businesses alike use spreadsheet models to determine where key measures of their success are now, and where they are likely to be in the future. But in order to get the most out of a spreadsheet, you have the know-how to use it. This course is designed to give you an introduction to basic spreadsheet tools and formulas so that you can begin harness the power of spreadsheets to map the data you have now and to predict the data you may have in the future. Through short, easy-to-follow demonstrations, you’ll learn how to use Excel or Sheets so that you can begin to build models and decision trees in future courses in this Specialization. \n\nBasic familiarity with, and access to, Excel or Sheets is required.\n\nSHOW ALL ABOUT INTRODUCTION TO SPREADSHEETS AND MODELS\nSHOW ALL"
    },
    {
       "Url":"/learn/finance-healthcare-managers?specialization=finance-quantitative-modeling-analysts",
       "name":"Financial Acumen for Non-Financial Managers",
       "Rating":"Financial Acumen for Non-Financial Managers\n4.5\nstars\n698 ratings\n•\n138 reviews\n\nIn this course, you’ll explore how financial statement data and non-financial metrics can be linked to financial performance. Professors Rick Lambert and Chris Ittner of the Wharton School have designed this course to help you gain a practical understanding of how data is used to assess what drives financial performance and forecast future financial scenarios. You’ll learn more about the frameworks of financial reporting, income statements, and cash reporting, and apply different approaches to analyzing financial performance using real-life examples to see the concepts in action. By the end of this course, you’ll have honed your skills in understanding how financial data and non-financial data interact to forecast events and be able to determine the best financial strategy for your organization.\n\nSHOW ALL ABOUT FINANCIAL ACUMEN FOR NON-FINANCIAL MANAGERS\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-finance?specialization=finance-quantitative-modeling-analysts",
       "name":"Introduction to Corporate Finance",
       "Rating":"Introduction to Corporate Finance\n4.6\nstars\n5,025 ratings\n•\n1,006 reviews\n\nThis course provides a brief introduction to the fundamentals of finance, emphasizing their application to a wide variety of real-world situations spanning personal finance, corporate decision-making, and financial intermediation. Key concepts and applications include: time value of money, risk-return tradeoff, cost of capital, interest rates, retirement savings, mortgage financing, auto leasing, capital budgeting, asset valuation, discounted cash flow (DCF) analysis, net present value, internal rate of return, hurdle rate, payback period.\n\nSHOW ALL ABOUT INTRODUCTION TO CORPORATE FINANCE\nSHOW ALL"
    },
    "/specializations/wharton-business-financial-modeling",
    {
       "Url":"/learn/wharton-quantitative-modeling?specialization=wharton-business-financial-modeling",
       "name":"Fundamentals of Quantitative Modeling",
       "Rating":"Fundamentals of Quantitative Modeling\n4.6\nstars\n7,415 ratings\n•\n1,461 reviews\n\nHow can you put data to work for you? Specifically, how can numbers in a spreadsheet tell us about present and past business activities, and how can we use them to forecast the future? The answer is in building quantitative models, and this course is designed to help you understand the fundamentals of this critical, foundational, business skill. Through a series of short lectures, demonstrations, and assignments, you’ll learn the key ideas and process of quantitative modeling so that you can begin to create your own models for your own business or enterprise. By the end of this course, you will have seen a variety of practical commonly used quantitative models as well as the building blocks that will allow you to start structuring your own models. These building blocks will be put to use in the other courses in this Specialization.\n\nSHOW ALL ABOUT FUNDAMENTALS OF QUANTITATIVE MODELING\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-introduction-spreadsheets-models?specialization=wharton-business-financial-modeling",
       "name":"Introduction to Spreadsheets and Models",
       "Rating":"Introduction to Spreadsheets and Models\n4.2\nstars\n3,443 ratings\n•\n643 reviews\n\nThe simple spreadsheet is one of the most powerful data analysis tools that exists, and it’s available to almost anyone. Major corporations and small businesses alike use spreadsheet models to determine where key measures of their success are now, and where they are likely to be in the future. But in order to get the most out of a spreadsheet, you have the know-how to use it. This course is designed to give you an introduction to basic spreadsheet tools and formulas so that you can begin harness the power of spreadsheets to map the data you have now and to predict the data you may have in the future. Through short, easy-to-follow demonstrations, you’ll learn how to use Excel or Sheets so that you can begin to build models and decision trees in future courses in this Specialization. \n\nBasic familiarity with, and access to, Excel or Sheets is required.\n\nSHOW ALL ABOUT INTRODUCTION TO SPREADSHEETS AND MODELS\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-risk-models?specialization=wharton-business-financial-modeling",
       "name":"Modeling Risk and Realities",
       "Rating":"Modeling Risk and Realities\n4.6\nstars\n2,070 ratings\n•\n299 reviews\n\nUseful quantitative models help you to make informed decisions both in situations in which the factors affecting your decision are clear, as well as in situations in which some important factors are not clear at all. In this course, you can learn how to create quantitative models to reflect complex realities, and how to include in your model elements of risk and uncertainty. You’ll also learn the methods for creating predictive models for identifying optimal choices; and how those choices change in response to changes in the model’s assumptions. You’ll also learn the basics of the measurement and management of risk. By the end of this course, you’ll be able to build your own models with your own data, so that you can begin making data-informed decisions. You’ll also be prepared for the next course in the Specialization.\n\nSHOW ALL ABOUT MODELING RISK AND REALITIES\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-decision-making-scenarios?specialization=wharton-business-financial-modeling",
       "name":"Decision-Making and Scenarios",
       "Rating":"Decision-Making and Scenarios\n4.6\nstars\n1,619 ratings\n•\n220 reviews\n\nThis course is designed to show you how use quantitative models to transform data into better business decisions. You’ll learn both how to use models to facilitate decision-making and also how to structure decision-making for optimum results. Two of Wharton’s most acclaimed professors will show you the step-by-step processes of modeling common business and financial scenarios, so you can significantly improve your ability to structure complex problems and derive useful insights about alternatives. Once you’ve created models of existing realities, possible risks, and alternative scenarios, you can determine the best solution for your business or enterprise, using the decision-making tools and techniques you’ve learned in this course.\n\nSHOW ALL ABOUT DECISION-MAKING AND SCENARIOS\nSHOW ALL"
    },
    {
       "Url":"/learn/wharton-business-financial-modeling-capstone?specialization=wharton-business-financial-modeling",
       "name":"Wharton Business and Financial Modeling Capstone",
       "Rating":"Wharton Business and Financial Modeling Capstone\n4.6\nstars\n433 ratings\n•\n76 reviews\n\nIn this Capstone you will recommend a business strategy based on a data model you’ve constructed. Using a data set designed by Wharton Research Data Services (WRDS), you will implement quantitative models in spreadsheets to identify the best opportunities for success and minimizing risk. Using your newly acquired decision-making skills, you will structure a decision and present this course of action in a professional quality PowerPoint presentation which includes both data and data analysis from your quantitative models.\n\nWharton Research Data Services (WRDS) is the leading data research platform and business intelligence tool for over 30,000 corporate, academic, government and nonprofit clients in 33 countries. WRDS provides the user with one location to access over 200 terabytes of data across multiple disciplines including Accounting, Banking, Economics, ESG, Finance, Insurance, Marketing, and Statistics.\n\nSHOW ALL ABOUT WHARTON BUSINESS AND FINANCIAL MODELING CAPSTONE\nSHOW ALL"
    },
    "/specializations/natural-language-processing",
    {
       "Url":"/learn/classification-vector-spaces-in-nlp?specialization=natural-language-processing",
       "name":"Natural Language Processing with Classification and Vector Spaces",
       "Rating":"Natural Language Processing with Classification and Vector Spaces\n4.6\nstars\n2,941 ratings\n•\n602 reviews\n\nIn Course 1 of the Natural Language Processing Specialization, offered by deeplearning.ai, you will:   \n\na) Perform sentiment analysis of tweets using logistic regression and then naïve Bayes, \nb) Use vector space models to discover relationships between words and use PCA to reduce the dimensionality of the vector space and visualize those relationships, and\nc) Write a simple English to French translation algorithm using pre-computed word embeddings and locality sensitive hashing to relate words via approximate k-nearest neighbor search.   \n    \nPlease make sure that you’re comfortable programming in Python and have a basic knowledge of machine learning, matrix multiplications, and conditional probability.   \n   \nBy the end of this Specialization, you will have designed NLP applications that perform question-answering and sentiment analysis, created tools to translate languages and summarize text, and even built a chatbot!   \n   \nThis Specialization is designed and taught by two experts in NLP, machine learning, and deep learning. Younes Bensouda Mourri is an Instructor of AI at Stanford University who also helped build the Deep Learning Specialization. Łukasz Kaiser is a Staff Research Scientist at Google Brain and the co-author of Tensorflow, the Tensor2Tensor and Trax libraries, and the Transformer paper.\n\nSHOW ALL ABOUT NATURAL LANGUAGE PROCESSING WITH CLASSIFICATION AND VECTOR SPACES\nSHOW ALL"
    },
    {
       "Url":"/learn/probabilistic-models-in-nlp?specialization=natural-language-processing",
       "name":"Natural Language Processing with Probabilistic Models",
       "Rating":"Natural Language Processing with Probabilistic Models\n4.7\nstars\n1,200 ratings\n•\n209 reviews\n\nIn Course 2 of the Natural Language Processing Specialization, offered by deeplearning.ai, you will:\n\na) Create a simple auto-correct algorithm using minimum edit distance and dynamic programming,\nb) Apply the Viterbi Algorithm for part-of-speech (POS) tagging, which is important for computational linguistics,\nc) Write a better auto-complete algorithm using an N-gram language model, and \nd) Write your own Word2Vec model that uses a neural network to compute word embeddings using a continuous bag-of-words model.\n \nPlease make sure that you’re comfortable programming in Python and have a basic knowledge of machine learning, matrix multiplications, and conditional probability.\n\nBy the end of this Specialization, you will have designed NLP applications that perform question-answering and sentiment analysis, created tools to translate languages and summarize text, and even built a chatbot!\n\nThis Specialization is designed and taught by two experts in NLP, machine learning, and deep learning. Younes Bensouda Mourri is an Instructor of AI at Stanford University who also helped build the Deep Learning Specialization. Łukasz Kaiser is a Staff Research Scientist at Google Brain and the co-author of Tensorflow, the Tensor2Tensor and Trax libraries, and the Transformer paper.\n\nSHOW ALL ABOUT NATURAL LANGUAGE PROCESSING WITH PROBABILISTIC MODELS\nSHOW ALL"
    },
    {
       "Url":"/learn/sequence-models-in-nlp?specialization=natural-language-processing",
       "name":"Natural Language Processing with Sequence Models",
       "Rating":"Natural Language Processing with Sequence Models\n4.5\nstars\n777 ratings\n•\n158 reviews\n\nIn Course 3 of the Natural Language Processing Specialization, offered by deeplearning.ai, you will:\n\na) Train a neural network with GLoVe word embeddings to perform sentiment analysis of tweets,\nb) Generate synthetic Shakespeare text using a Gated Recurrent Unit (GRU) language model,\nc) Train a recurrent neural network to perform named entity recognition (NER) using LSTMs with linear layers, and \nd) Use so-called ‘Siamese’ LSTM models to compare questions in a corpus and identify those that are worded differently but have the same meaning. \n \nPlease make sure that you’ve completed Course 2 and are familiar with the basics of TensorFlow. If you’d like to prepare additionally, you can take Course 1: Neural Networks and Deep Learning of the Deep Learning Specialization.\n\nBy the end of this Specialization, you will have designed NLP applications that perform question-answering and sentiment analysis, created tools to translate languages and summarize text, and even built a chatbot!\n\nThis Specialization is designed and taught by two experts in NLP, machine learning, and deep learning. Younes Bensouda Mourri is an Instructor of AI at Stanford University who also helped build the Deep Learning Specialization. Łukasz Kaiser is a Staff Research Scientist at Google Brain and the co-author of Tensorflow, the Tensor2Tensor and Trax libraries, and the Transformer paper.\n\nSHOW ALL ABOUT NATURAL LANGUAGE PROCESSING WITH SEQUENCE MODELS\nSHOW ALL"
    },
    {
       "Url":"/learn/attention-models-in-nlp?specialization=natural-language-processing",
       "name":"Natural Language Processing with Attention Models",
       "Rating":"Natural Language Processing with Attention Models\n4.4\nstars\n651 ratings\n•\n161 reviews\n\nIn Course 4 of the Natural Language Processing Specialization, offered by DeepLearning.AI, you will:\n\na) Translate complete English sentences into German using an encoder-decoder attention model,\nb) Build a Transformer model to summarize text, \nc) Use T5 and BERT models to perform question-answering, and\nd) Build a chatbot using a Reformer model.  \n \nThis course is for students of machine learning or artificial intelligence as well as software engineers looking for a deeper understanding of how NLP models work and how to apply them. \n\nBy the end of this Specialization, you will have designed NLP applications that perform question-answering and sentiment analysis, created tools to translate languages and summarize text, and even built a chatbot!   \n\nLearners should have a working knowledge of machine learning, intermediate Python including experience with a deep learning framework (e.g., TensorFlow, Keras), as well as proficiency in calculus, linear algebra, and statistics. Please make sure that you’ve completed course 3 - Natural Language Processing with Sequence Models - before starting this course.\n   \nThis Specialization is designed and taught by two experts in NLP, machine learning, and deep learning. Younes Bensouda Mourri is an Instructor of AI at Stanford University who also helped build the Deep Learning Specialization. Łukasz Kaiser is a Staff Research Scientist at Google Brain and the co-author of Tensorflow, the Tensor2Tensor and Trax libraries, and the Transformer paper.\n\nSHOW ALL ABOUT NATURAL LANGUAGE PROCESSING WITH ATTENTION MODELS\nSHOW ALL"
    },
    "/specializations/learn-sql-basics-data-science",
    {
       "Url":"/learn/sql-for-data-science?specialization=learn-sql-basics-data-science",
       "name":"SQL for Data Science",
       "Rating":"SQL for Data Science\n4.6\nstars\n10,470 ratings\n•\n2,739 reviews\n\nAs data collection has increased exponentially, so has the need for people skilled at using and interacting with data; to be able to think critically, and provide insights to make better decisions and optimize their businesses. This is a data scientist, “part mathematician, part computer scientist, and part trend spotter” (SAS Institute, Inc.). According to Glassdoor, being a data scientist is the best job in America; with a median base salary of $110,000 and thousands of job openings at a time. The skills necessary to be a good data scientist include being able to retrieve and work with data, and to do that you need to be well versed in SQL, the standard language for communicating with database systems.\n\nThis course is designed to give you a primer in the fundamentals of SQL and working with data so that you can begin analyzing it for data science purposes. You will begin to ask the right questions and come up with good answers to deliver valuable insights for your organization. This course starts with the basics and assumes you do not have any knowledge or skills in SQL. It will build on that foundation and gradually have you write both simple and complex queries to help you select data from tables.  You'll start to work with different types of data like strings and numbers and discuss methods to filter and pare down your results. \n\nYou will create new tables and be able to move data into them. You will learn common operators and how to combine the data. You will use case statements and concepts like data governance and profiling. You will discuss topics on data, and practice using real-world programming assignments. You will interpret the structure, meaning, and relationships in source data and use SQL as a professional to shape your data for targeted analysis purposes. \n\nAlthough we do not have any specific prerequisites or software requirements to take this course, a simple text editor is recommended for the final project. So what are you waiting for? This is your first step in landing a job in the best occupation in the US and soon the world!\n\nSHOW ALL ABOUT SQL FOR DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/data-wrangling-analysis-abtesting?specialization=learn-sql-basics-data-science",
       "name":"Data Wrangling, Analysis and AB Testing with SQL",
       "Rating":"Data Wrangling, Analysis and AB Testing with SQL\n3.4\nstars\n395 ratings\n•\n158 reviews\n\nThis course allows you to apply the SQL skills taught in “SQL for Data Science” to four increasingly complex and authentic data science inquiry case studies. We'll learn how to convert timestamps of all types to common formats and perform date/time calculations. We'll select and perform the optimal JOIN for a data science inquiry and clean data within an analysis dataset by deduping, running quality checks, backfilling, and handling nulls. We'll learn how to segment and analyze data per segment using windowing functions and use case statements to execute conditional logic to address a data science inquiry. We'll also describe how to convert a query into a scheduled job and how to insert data into a date partition. Finally, given a predictive analysis need, we'll engineer a feature from raw data using the tools and skills we've built over the course. The real-world application of these skills will give you the framework for performing the analysis of an AB test.\n\nSHOW ALL ABOUT DATA WRANGLING, ANALYSIS AND AB TESTING WITH SQL\nSHOW ALL"
    },
    {
       "Url":"/learn/spark-sql?specialization=learn-sql-basics-data-science",
       "name":"Distributed Computing with Spark SQL",
       "Rating":"Distributed Computing with Spark SQL\n4.5\nstars\n329 ratings\n•\n82 reviews\n\nThis course is all about big data. It’s for students with SQL experience that want to take the next step on their data journey by learning distributed computing using Apache Spark. Students will gain a thorough understanding of this open-source standard for working with large datasets. Students will gain an understanding of the fundamentals of data analysis using SQL on Spark, setting the foundation for how to combine data with advanced analytics at scale and in production environments. The four modules build on one another and by the end of the course you will understand: the Spark architecture, queries within Spark, common ways to optimize Spark SQL, and how to build reliable data pipelines. \n\nThe first module introduces Spark and the Databricks environment including how Spark distributes computation and Spark SQL. Module 2 covers the core concepts of Spark such as storage vs. compute, caching, partitions, and troubleshooting performance issues via the Spark UI. It also covers new features in Apache Spark 3.x such as Adaptive Query Execution. The third module focuses on Engineering Data Pipelines including connecting to databases, schemas and data types, file formats, and writing reliable data. The final module covers data lakes, data warehouses, and lakehouses. Students build production grade data pipelines by combining Spark with the open-source project Delta Lake. By the end of this course, students will hone their SQL and distributed computing skills to become more adept at advanced analysis and to set the stage for transitioning to more advanced analytics as Data Scientists.\n\nSHOW ALL ABOUT DISTRIBUTED COMPUTING WITH SPARK SQL\nSHOW ALL"
    },
    {
       "Url":"/learn/sql-data-science-capstone?specialization=learn-sql-basics-data-science",
       "name":"SQL for Data Science Capstone Project",
       "Rating":"SQL for Data Science Capstone Project\n3.8\nstars\n59 ratings\n•\n15 reviews\n\nData science is a dynamic and growing career field that demands knowledge and skills-based in SQL to be successful. This course is designed to provide you with a solid foundation in applying SQL skills to analyze data and solve real business problems.\n\nWhether you have successfully completed the other courses in the Learn SQL Basics for Data Science Specialization or are taking just this course, this project is your chance to apply the knowledge and skills you have acquired to practice important SQL  querying and solve problems with data. You will participate in your own personal or professional journey to create a portfolio-worthy piece from start to finish. You will choose a dataset and develop a project proposal. You will explore your data and perform some initial statistics you have learned through this specialization. You will uncover analytics for qualitative data and consider new metrics that make sense from the patterns that surface in your analysis. You will put all of your work together in the form of a presentation where you will tell the story of your findings. Along the way, you will receive feedback through the peer-review process. This community of fellow learners will provide additional input to help you refine your approach to data analysis with SQL and present your findings to clients and management.\n\nSHOW ALL ABOUT SQL FOR DATA SCIENCE CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/digital-marketing",
    {
       "Url":"/learn/marketing-digital?specialization=digital-marketing",
       "name":"Marketing in a Digital World",
       "Rating":"Marketing in a Digital World\n4.7\nstars\n15,728 ratings\n•\n5,085 reviews\n\nThis course examines how new digital tools, such as the Internet, smartphones, and 3D printing, are revolutionizing the world of marketing by changing the roles and practices of both firms and consumers. Marketing in a Digital World is one of the most popular courses on Coursera with over 500,000 learners and is rated by Class Central as one of the Top 50 MOOCs of All Time (https://www.class-central.com/report/top-moocs/).\n\nYou will be able to: \n•\tUnderstand how digital tools are changing the nature of marketing\n•\tExplain how digital tools allow consumers to take a more active role in product development, promotion, placement, and pricing activities\n•\tObtain a new set of concepts, tools, and stories to enhance your digital marketing efforts\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT MARKETING IN A DIGITAL WORLD\nSHOW ALL"
    },
    {
       "Url":"/learn/marketing-analytics?specialization=digital-marketing",
       "name":"Digital Marketing Analytics in Theory",
       "Rating":"Digital Marketing Analytics in Theory\n4.5\nstars\n4,508 ratings\n•\n1,089 reviews\n\nSuccessfully marketing brands today requires a well-balanced blend of art and science. This course introduces students to the science of web analytics while casting a keen eye toward the artful use of numbers found in the digital space. The goal is to provide the foundation needed to apply data analytics to real-world challenges marketers confront daily. Digital Analytics for Marketing Professionals: Marketing Analytics in Theory is the first in a two-part series of complementary courses and focuses on the background information and frameworks analysts need to be successful in today's digital business world.\n\nYou will be able to:\n-\tIdentify the web analytic tool right for your specific needs\n-\tUnderstand valid and reliable ways to collect, analyze, and visualize data from the web\n-\tUtilize data in decision making for agencies, organizations, or clients\n\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT DIGITAL MARKETING ANALYTICS IN THEORY\nSHOW ALL"
    },
    {
       "Url":"/learn/digital-analytics?specialization=digital-marketing",
       "name":"Digital Marketing Analytics in Practice",
       "Rating":"Digital Marketing Analytics in Practice\n4.5\nstars\n3,120 ratings\n•\n673 reviews\n\nSuccessfully marketing brands today requires a well-balanced blend of art and science. This course introduces students to the science of web analytics while casting a keen eye toward the artful use of numbers found in the digital space. The goal is to provide the foundation needed to apply data analytics to real-world challenges marketers confront daily. Digital Analytics for Marketing Professionals: Marketing Analytics in Practice is the second in a two-part series of complementary courses and focuses on the skills and practical abilities analysts need to be successful in today's digital business world.\n\nYou will be able to:\n-\tIdentify the web analytic tool right for your specific needs\n-\tUnderstand valid and reliable ways to collect, analyze, and visualize data from the web\n-\tUtilize data in decision making for agencies, organizations, or clients\n\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT DIGITAL MARKETING ANALYTICS IN PRACTICE\nSHOW ALL"
    },
    {
       "Url":"/learn/marketing-channels?specialization=digital-marketing",
       "name":"Digital Media and Marketing Principles",
       "Rating":"Digital Media and Marketing Principles\n4.4\nstars\n2,574 ratings\n•\n617 reviews\n\nThe Digital Revolution has led to a titanic shift in the landscape of marketing communications, while also creating new opportunities for businesses to reach and engage consumers through smart, social, and mobile media technologies. In this course, you will learn about the impacts of digital technologies on marketing communication strategies and practices. By understanding the underlying processes of marketing communication and the core features of new media technologies, you can strategically select the appropriate channels to deliver the right marketing message to the right audience at the right moment.\n\nYou will be able to:\n-\tExamine marketing as a process of highly strategic communication \n-\tUnderstand the impacts of digital media and information technologies on communication and marketing\n-\tDevelop a conceptual understanding of several digital marketing strategies\n-\tConsider the rise of exciting new technologies, such as  AI, Internet of Things, and Mix Reality, as new tools for digital marketing\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into the program and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT DIGITAL MEDIA AND MARKETING PRINCIPLES\nSHOW ALL"
    },
    {
       "Url":"/learn/marketing-plan?specialization=digital-marketing",
       "name":"Digital Media and Marketing Strategies",
       "Rating":"Digital Media and Marketing Strategies\n4.5\nstars\n2,606 ratings\n•\n622 reviews\n\nThe proliferation of digital technology gives businesses an unprecedented and diverse new set of tools to reach, engage, monitor, and respond to consumers. The aggregated and voluminous digital data can also be leveraged to better target specific consumer segments. Following “Digital Media and Marketing Principles,” this course aims to give you a deeper understanding of core processes of planning a digital marketing campaign and the role of various digital channels in integrated marketing communication.\n\nYou will be able to:\n-\tAdopt a holistic and integrated approach to digital marketing planning\n-\tDevelop a purposeful content marketing strategy to achieve your business and marketing goals\n-\tEffectively mix paid, earned, owned, and shared media channels to discover, reach, and engage your customers\n-\tCritically evaluate the role social media platforms play in viral and influencer marketing campaigns \n-\tEvaluate and measure the success of digital marketing campaigns\n-\tIdentify and manage risks in digital marketing\n\nThis course is part of Gies College of Business’s suite of online programs, including the iMBA and iMSM. Learn more about admission into the program and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT DIGITAL MEDIA AND MARKETING STRATEGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/digital-marketing-revolution?specialization=digital-marketing",
       "name":"The Digital Marketing Revolution",
       "Rating":"The Digital Marketing Revolution\n4.7\nstars\n952 ratings\n•\n243 reviews\n\nThe Digital Revolution is dramatically altered the way many products are created, promoted, distributed, and consumed. Before the advent of new digital technologies such as the Internet, personal computer and smartphone, marketing was largely an Analog (i.e., physical) activity. Today, many marketing activities such as how products are promoted are increasingly Digital in nature. However, we still live in an Analog (or physical) World. For example, even today, most sales are still conducted in physical stores. Thus, both marketers and consumers must simultaneously navigate both the Analog and Digital worlds on a daily basis. This course examines both the Analog and the Digital and how these two forces relate to one another within the Digital Marketing Revolution.\n\nThis course will begin with an exploration of the key differences between the Analog and the Digital and then examine four ways in which the Analog World has been affected by the Digital Revolution: Domination, Resistance, Synergy, and Transformation. This course will contain several examples of each of these concepts and explore their implications for both marketers and consumers. This course will also employ a variety of learning techniques, including video lectures, case studies, hands-on exercises, and interviews with leading marketing scholars. The learning approach will be highly interactive; you will have the opportunity to engage in a variety of hands-on activities and be a member of a rich learning community. I hope you will join us in this learning adventure.\n\nUpon successful completion of this course, you will be able to:\n-Understand the key differences between Analog and Digital and the implications of these differences for marketing.\n-Understand the four ways in which the Analog is being affected by the Digital Revolution.\n-Develop and apply critical thinking skills regarding the role of both the Analog and the Digital upon both firms and consumers.\n-Learn several real-world examples of various strategies for successful marketing of Analog products and services in an increasingly Digital world.\n\nThis course is part of Gies College of Business’ suite of online programs, including the iMBA and iMSM. Learn more about admission into these programs and explore how your Coursera work can be leveraged if accepted into a degree program at https://degrees.giesbusiness.illinois.edu/idegrees/.\n\nSHOW ALL ABOUT THE DIGITAL MARKETING REVOLUTION\nSHOW ALL"
    },
    {
       "Url":"/learn/digital-marketing-capstone?specialization=digital-marketing",
       "name":"Digital Marketing Capstone",
       "Rating":"Digital Marketing Capstone\n4.5\nstars\n528 ratings\n•\n160 reviews\n\nThis four-week Capstone of the Digital Marketing Specialization is designed to help you apply the principles you have learned in the previous  courses.\n\nThis capstone course is designed to give you hands-on experience in executing a digital marketing campaign for a fictitious firm selling electronics. In the previous courses on analytics and channels, you came up with strategies to identify a firm’s objectives, specify a few key ones, research alternatives to reaching the customer in their decision journey and finally propose a multi-channel digital marketing plan. In this capstone, you will execute a campaign, rather than creating another \"plan\".\n\nYou will use an online simulation to do this. You will be a marketing manager for a firm selling digital cameras online through their webstore. You will be reviewing the products, pricing, margins, and historical sales. You will create a targeted ad campaign after researching appropriate keywords for the products you are selling. You will also review the basics of landing page design and search engine optimization. You will then create and execute an email campaign. Once these campaigns are executed, you get feedback on the KPI's such as revenue, profits, traffic, conversions. You will get an opportunity to redo this campaign, with new strategies, to improve your KPI's in the second round. \n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.\n\nSHOW ALL ABOUT DIGITAL MARKETING CAPSTONE\nSHOW ALL"
    },
    "/specializations/improve-english",
    {
       "Url":"/learn/professional-emails-english?specialization=improve-english",
       "name":"Write Professional Emails in English",
       "Rating":"Write Professional Emails in English\n4.8\nstars\n13,750 ratings\n•\n4,296 reviews\n\nThis is a course to help you write effective business emails in English. This course is unique because each module will provide tips on writing more professional emails as well as lessons to improve your overall English writing skills. Therefore, you will improve your grammar and vocabulary skills for email writing and also improve your cross cultural knowledge to make you more powerful and successful in your business communication. You will look at different email formats to analyze tone, formality levels, and various organizational styles. You will be able to improve your emails of introduction, announcements, requests and emails that apologize or revise a request. In this course you will write and revise 4–5 emails, complete several comprehension quizzes and review the emails of other participants.  \n\nBy the end of this course, you will be able to \n•\tImprove your overall written English skills\n•\tSee differences and similarities among the different email formats \n•\tWrite more effective subject lines and email text\n•\tApply various key language to different types of emails\n•\tCorrect common errors such as punctuation and capitalization\n•\tStudy tone and level of formality in emails \n•\tUnderstand how culture affects what is appropriate in a business emails \n•\tWrite powerful business emails for professional needs\n\nSHOW ALL ABOUT WRITE PROFESSIONAL EMAILS IN ENGLISH\nSHOW ALL"
    },
    {
       "Url":"/learn/speak-english-professionally?specialization=improve-english",
       "name":"Speak English Professionally: In Person, Online & On the Phone",
       "Rating":"Speak English Professionally: In Person, Online & On the Phone\n4.7\nstars\n8,904 ratings\n•\n2,736 reviews\n\nDo you want to speak better English? This course will help you reach that goal. Speak English Professionally: In person, Online and On the Phone will boost your English speaking skills. In this 5 week course, you will learn how to identify and make a strong personal introduction. You will develop and demonstrate the speaking skills for group discussions: how to agree or disagree, how to clarify, restate and summarize. You will review and practice how to give information and respond to requests on the phone. You will study and role play effective interviewing. You will  prepare and give a sales “pitch”, introducing a product or service. Throughout the course, you will adjust how you speak English and you will become more fluent and accurate when you speak. You will demonstrate  culturally appropriate body language and tone. As you work through the course, you will complete self- and peer-evaluations. Through a combination of lectures, comprehension and vocabulary quizzes, practice and performance, you’ll gain the skills and confidence to communicate well  in English, anywhere in the world.\t\n\nBy the end of this course you will:\n•      Change how you speak English\n•\tImprove your pronunciation and fluency  \n•       Increase your English vocabulary \n•\tIdentify how culture influences your speech\n•\tUse culture to help you speak correctly \n•\tDemonstrate the best body language for different cultural settings\n•\tKnow statements, questions and responses for different settings and situations\n\nSHOW ALL ABOUT SPEAK ENGLISH PROFESSIONALLY: IN PERSON, ONLINE & ON THE PHONE\nSHOW ALL"
    },
    {
       "Url":"/learn/eportfolio-english?specialization=improve-english",
       "name":"Build Your Professional ePortfolio in English",
       "Rating":"Build Your Professional ePortfolio in English\n4.7\nstars\n1,380 ratings\n•\n399 reviews\n\nRoughly half of the world’s population is already online and so setting yourself apart from the crowd is more important than ever before.  One of the best ways to do that is by creating your own ePortfolio.  An ePortfolio is a site that showcases or shows your background, your resume, and samples of your work.  In this course, you will learn step by step how to build the site and you’ll learn the grammar, vocabulary and writing skills needed to create it.  You will learn how to apply information from your ePortfolio to other online tools like LinkedIn, Twitter, Instagram and YouTube in order to network with others so that you get a job or connect with other professionals.  For each step in that process, you will listen to lectures, take comprehension quizzes, and learn how to use English appropriately to each part of your site.  You will also complete self and peer assessments and gain the needed skills to make your ePortfolio a reality and establish yourself online.\n\nBy the end of this course, you will be able to \n•\tWrite a proper headline or title for your ePortfolio\n•\tDescribe your work in 1 sentence and in longer forms\n•\tIdentify how to use hashtags effectively\n•\tWrite an effective summary about yourself and your work\n•\tApply appropriate vocabulary to write your education and professional experience for your resume \n•\tUnderstand how to write a tweet to get a job \n•\tDiscover how to write specific comments and network work with others \n•\tApply what you have on your portfolio to other tools like Instagram, Twitter, LinkedIn or YouTube.\n\nSHOW ALL ABOUT BUILD YOUR PROFESSIONAL EPORTFOLIO IN ENGLISH\nSHOW ALL"
    },
    {
       "Url":"/learn/english-communication-capstone?specialization=improve-english",
       "name":"Take Your English Communication Skills to the Next Level",
       "Rating":"Take Your English Communication Skills to the Next Level\n4.8\nstars\n617 ratings\n•\n191 reviews\n\nThis Capstone builds on the communication and content skills you’ve acquired throughout the Specialization and develops them further. During course lessons and Peer Assessments you will practice and expand the language skills necessary for success in the professional world. Throughout the course, you will have the opportunity to complete assessments relevant to the working world.\n\nIn this course, you will:\n\n* Study cultural influences on communication more thoroughly, identify key cultural influences in your own experience and compare your culture with a different one to identify ways to improve communication and decrease misunderstanding.\n\n* Develop your email accuracy and style and engage in email correspondence with potential employers, clients or investors to set up interviews and/or meetings.\n\n* Practice and Demonstrate fluent and accurate spoken English as you prepare and present a short talk about a personal accomplishment or “Sales Pitch” for a product or service.\n\n* Polish your pronunciation through more connected speech including use of through groups, contractions/reductions, and linking.\n\nWeek by week, as you practice your language skills, make connections with people important to you and develop your network, you will increase your opportunities for success. Completing this Capstone Project will help you reach your English language and professional goals now and in the future.\n\nSHOW ALL ABOUT TAKE YOUR ENGLISH COMMUNICATION SKILLS TO THE NEXT LEVEL\nSHOW ALL"
    },
    "/specializations/developing-apps-gcp",
    {
       "Url":"/learn/gcp-fundamentals?specialization=developing-apps-gcp",
       "name":"Google Cloud Fundamentals: Core Infrastructure",
       "Rating":"Google Cloud Fundamentals: Core Infrastructure\n4.7\nstars\n41,631 ratings\n•\n7,152 reviews\n\nThis course introduces you to important concepts and terminology for working with Google Cloud Platform (GCP). You learn about, and compare, many of the computing and storage services available in Google Cloud Platform, including Google App Engine, Google Compute Engine, Google Kubernetes Engine, Google Cloud Storage, Google Cloud SQL, and BigQuery. You learn about important resource and policy management tools, such as the Google Cloud Resource Manager hierarchy and Google Cloud Identity and Access Management. Hands-on labs give you foundational skills for working with GCP.\n\nNote:\n•Google services are currently unavailable in China.\n\nSHOW ALL ABOUT GOOGLE CLOUD FUNDAMENTALS: CORE INFRASTRUCTURE\nSHOW ALL"
    },
    {
       "Url":"/learn/getting-started-app-development?specialization=developing-apps-gcp",
       "name":"Getting Started With Application Development",
       "Rating":"Getting Started With Application Development\n4.5\nstars\n1,992 ratings\n•\n254 reviews\n\nIn this course, application developers learn how to design and develop cloud-native applications that seamlessly integrate managed services from Google Cloud. Participants learn how to apply best practices for application development and use the appropriate Google Cloud storage services for object storage, relational data, caching, and analytics.\n\nSHOW ALL ABOUT GETTING STARTED WITH APPLICATION DEVELOPMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/securing-integrating-components-app?specialization=developing-apps-gcp",
       "name":"Securing and Integrating Components of your Application",
       "Rating":"Securing and Integrating Components of your Application\n4.6\nstars\n1,242 ratings\n•\n122 reviews\n\nIn this course, application developers learn how to design and develop cloud-native applications that seamlessly integrate managed services from Google Cloud. Through a combination of presentations, demos, and hands-on labs, participants learn how to apply best practices for application development and use the appropriate Google Cloud storage services for object storage, relational data, caching, and analytics. Learners can choose to complete labs in their favorite language: Node.js, Java, or Python.\n\nSHOW ALL ABOUT SECURING AND INTEGRATING COMPONENTS OF YOUR APPLICATION\nSHOW ALL"
    },
    {
       "Url":"/learn/app-deployment-debugging-performance?specialization=developing-apps-gcp",
       "name":"App Deployment, Debugging, and Performance",
       "Rating":"App Deployment, Debugging, and Performance\n4.6\nstars\n1,077 ratings\n•\n121 reviews\n\nIn this course, application developers learn how to design and develop cloud-native applications that seamlessly integrate managed services from Google Cloud. Through a combination of presentations, demos, and hands-on labs, participants learn how to apply best practices for application development and use the appropriate Google Cloud storage services for object storage, relational data, caching, and analytics. Learners can choose to complete labs in their favorite language: Node.js, Java, or Python.\t\n\n• Completed Google Cloud Platform Fundamentals or have equivalent experience\n• Working knowledge of Node.js, Java, or Python\n• Basic proficiency with command-line tools and Linux operating system environments\n• Previous course(s) in the specialization\n\nSHOW ALL ABOUT APP DEPLOYMENT, DEBUGGING, AND PERFORMANCE\nSHOW ALL"
    },
    "/specializations/data-science-foundations-r",
    {
       "Url":"/learn/data-scientists-tools?specialization=data-science-foundations-r",
       "name":"The Data Scientist’s Toolbox",
       "Rating":"The Data Scientist’s Toolbox\n4.6\nstars\n32,164 ratings\n•\n6,874 reviews\n\nIn this course you will get an introduction to the main tools and ideas in the data scientist's toolbox. The course gives an overview of the data, questions, and tools that data analysts and data scientists work with. There are two components to this course. The first is a conceptual introduction to the ideas behind turning data into actionable knowledge. The second is a practical introduction to the tools that will be used in the program like version control, markdown, git, GitHub, R, and RStudio.\n\nSHOW ALL ABOUT THE DATA SCIENTIST’S TOOLBOX\nSHOW ALL"
    },
    {
       "Url":"/learn/r-programming?specialization=data-science-foundations-r",
       "name":"R Programming",
       "Rating":"R Programming\n4.5\nstars\n21,187 ratings\n•\n4,574 reviews\n\nIn this course you will learn how to program in R and how to use R for effective data analysis. You will learn how to install and configure software necessary for a statistical programming environment and describe generic programming language concepts as they are implemented in a high-level statistical language. The course covers practical issues in statistical computing which includes programming in R, reading data into R, accessing R packages, writing R functions, debugging, profiling R code, and organizing and commenting R code. Topics in statistical data analysis will provide working examples.\n\nSHOW ALL ABOUT R PROGRAMMING\nSHOW ALL"
    },
    {
       "Url":"/learn/data-cleaning?specialization=data-science-foundations-r",
       "name":"Getting and Cleaning Data",
       "Rating":"Getting and Cleaning Data\n4.6\nstars\n7,839 ratings\n•\n1,280 reviews\n\nBefore you can work with data you have to get some. This course will cover the basic ways that data can be obtained. The course will cover obtaining data from the web, from APIs, from databases and from colleagues in various formats. It will also cover the basics of data cleaning and how to make data “tidy”. Tidy data dramatically speed downstream data analysis tasks. The course will also cover the components of a complete data set including raw data, processing instructions, codebooks, and processed data. The course will cover the basics needed for collecting, cleaning, and sharing data.\n\nSHOW ALL ABOUT GETTING AND CLEANING DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/exploratory-data-analysis?specialization=data-science-foundations-r",
       "name":"Exploratory Data Analysis",
       "Rating":"Exploratory Data Analysis\n4.7\nstars\n5,903 ratings\n•\n859 reviews\n\nThis course covers the essential exploratory techniques for summarizing data. These techniques are typically applied before formal modeling commences and can help inform the development of more complex statistical models. Exploratory techniques are also important for eliminating or sharpening potential hypotheses about the world that can be addressed by the data. We will cover in detail the plotting systems in R as well as some of the basic principles of constructing data graphics. We will also cover some of the common multivariate statistical techniques used to visualize high-dimensional data.\n\nSHOW ALL ABOUT EXPLORATORY DATA ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/reproducible-research?specialization=data-science-foundations-r",
       "name":"Reproducible Research",
       "Rating":"Reproducible Research\n4.6\nstars\n4,065 ratings\n•\n584 reviews\n\nThis course focuses on the concepts and tools behind reporting modern data analyses in a reproducible manner. Reproducible research is the idea that data analyses, and more generally, scientific claims, are published with their data and software code so that others may verify the findings and build upon them.  The need for reproducibility is increasing dramatically as data analyses become more complex, involving larger datasets and more sophisticated computations. Reproducibility allows for people to focus on the actual content of a data analysis, rather than on superficial details reported in a written summary. In addition, reproducibility makes an analysis more useful to others because the data and code that actually conducted the analysis are available. This course will focus on literate statistical analysis tools which allow one to publish data analyses in a single document that allows others to easily execute the same analysis to obtain the same results.\n\nSHOW ALL ABOUT REPRODUCIBLE RESEARCH\nSHOW ALL"
    },
    "/specializations/aws-nodejs-serverless-development",
    {
       "Url":"/learn/aws-cloud-technical-essentials?specialization=aws-nodejs-serverless-development",
       "name":"AWS Cloud Technical Essentials",
       "Rating":"AWS Cloud Technical Essentials\n4.8\nstars\n858 ratings\n•\n208 reviews\n\nAre you in a technical role and want to learn the fundamentals of AWS? Do you aspire to have a job or career as a cloud developer, architect, or in an operations role? If so, AWS Cloud Technical Essentials is an ideal way to start. This course was designed for those at the beginning of their cloud-learning journey - no prior knowledge of cloud computing or AWS products and services required!\n\nThroughout the course, students will build highly available, scalable, and cost effective application step-by-step. Upon course completion, you will be able to make an informed decision about when and how to apply core AWS services for compute, storage, and database to different use cases. You’ll also learn about cloud security with a review of AWS' shared responsibility model and an introduction to AWS Identity and Access Management (IAM). And, you’ll know how AWS services can be used to monitor and optimize infrastructure in the cloud.\n\nAWS Cloud Technical Essentials is a fundamental-level course and will build your competence, confidence, and credibility with practical cloud skills that help you innovate and advance your professional future. Enroll in AWS Cloud Technical Essentials and start learning the technical fundamentals of AWS today!\n\nNote: This course was designed for learners with a technical background. If you are new to the cloud or come from a business background, we recommend completing AWS Cloud Practitioner Essentials (https://www.coursera.org/learn/aws-cloud-practitioner-essentials) before enrolling in this course.\n\nSHOW ALL ABOUT AWS CLOUD TECHNICAL ESSENTIALS\nSHOW ALL"
    },
    {
       "Url":"/learn/building-modern-node-applications-on-aws?specialization=aws-nodejs-serverless-development",
       "name":"Building Modern Node.js Applications on AWS",
       "Rating":"Building Modern Node.js Applications on AWS\n4.4\nstars\n38 ratings\n•\n6 reviews\n\nIn modern cloud native application development, it’s oftentimes the goal to build out serverless architectures that are scalable, are highly available, and are fully managed. This means less operational overhead for you and your business, and more focusing on the applications and business specific projects that differentiate you in your marketplace. In this course, we will be covering how to build a modern, greenfield serverless backend on AWS. \n\nBuilding brand new applications on AWS is a different task than lifting and shifting existing applications into AWS. When you have an existing application that you need to move to AWS, you might first look to using Amazon EC2 as your virtual machines, or maybe you might look into using docker containers and container hosting services like Amazon Elastic Container Service or Amazon Elastic Kubernetes Service. Those are all great application hosting options, but in most cases, they still require you to have some kind of pulse on the underlying infrastructure hosting your application. \t`\n\nBuilding Modern Node.js Applications on AWS will explore how to build an API driven application using Amazon API Gateway for serverless API hosting, AWS Lambda for serverless computing, and Amazon Cognito for serverless authentication. We will follow an API driven development process and first mock up what the API will look like. We will cover all the ins and outs of the service Amazon API Gateway, and as you’ll learn- it does a lot more than just hosting an API. \n\nThen we will add authentication to the API using Amazon Cognito. You’ll learn about how the authorization flow works with Cognito, and how to build it into your APIs. From there, we will add a Lambda backend that will be triggered by API Gateway. The lambda functions will be using the AWS SDKs to perform various data processing tasks. You’ll learn about the different configurations that exist for Lambda, and we will show you how to create and manage lambda functions. Some of the features of our API will require multiple lambda functions to execute in a specific order, like a workflow, and we will use AWS Step Functions to create a serverless workflow. Finally, we will talk about how to optimize your APIs at every layer using AWS features.\n\nNote: There are three versions of this class, \"Building Modern Node.js Applications on AWS\" for Node.js developers, \"Building Modern Python Applications on AWS\" for Python developers, and \"Building Modern Java Applications on AWS\" for Java developers.  The courses do for a large part, overlap and in general, we recommend that you take the course that focuses on the SDK you plan to use to develop your AWS Cloud based applications.\n\nWe expect that you have basic knowledge of AWS already. Some examples of concepts you should be familiar with are: you should know the basics of the AWS Global infrastructure, like what regions and availability zones are. You also should know the at a high-level AWS Identity and Access Management, or IAM, and how it is used to control access to AWS resources. You should also understand what an Amazon EC2 instance is, what Amazon S3 is, what a VPC is, as well as other basic AWS terminology.\n\nSHOW ALL ABOUT BUILDING MODERN NODE.JS APPLICATIONS ON AWS\nSHOW ALL"
    },
    {
       "Url":"/learn/dynamodb-nosql-database-driven-apps?specialization=aws-nodejs-serverless-development",
       "name":"Amazon DynamoDB: Building NoSQL Database-Driven Applications",
       "Rating":"Amazon DynamoDB: Building NoSQL Database-Driven Applications\n4.8\nstars\n128 ratings\n•\n29 reviews\n\nThis course introduces you to NoSQL databases and the challenges they solve. Expert instructors will dive deep into Amazon DynamoDB topics such as recovery, SDKs, partition keys, security and encryption, global tables, stateless applications, streams, and best practices.\n\nDynamoDB is a key-value and document database that delivers single-digit millisecond performance at any scale. It's a fully managed, multiregion, multimaster database with built-in security, backup and restore, and in-memory caching for internet-scale applications. DynamoDB can handle more than 10 trillion requests per day and support peaks of more than 20 million requests per second.\n\nThis course uses a combination of video-based lectures delivered by Amazon Web Services expert technical trainers, demonstrations, and hands-on lab exercises, that you run in your own AWS account  to enable you to build, deploy and manage your own DynamoDB-powered application.\n\nSHOW ALL ABOUT AMAZON DYNAMODB: BUILDING NOSQL DATABASE-DRIVEN APPLICATIONS\nSHOW ALL"
    },
    "/specializations/algorithms",
    {
       "Url":"/learn/algorithms-divide-conquer?specialization=algorithms",
       "name":"Divide and Conquer, Sorting and Searching, and Randomized Algorithms",
       "Rating":"Divide and Conquer, Sorting and Searching, and Randomized Algorithms\n4.8\nstars\n4,627 ratings\n•\n901 reviews\n\nThe primary topics in this part of the specialization are: asymptotic (\"Big-oh\") notation, sorting and searching, divide and conquer (master method, integer and matrix multiplication, closest pair), and randomized algorithms (QuickSort, contraction algorithm for min cuts)."
    },
    {
       "Url":"/learn/algorithms-graphs-data-structures?specialization=algorithms",
       "name":"Graph Search, Shortest Paths, and Data Structures",
       "Rating":"Graph Search, Shortest Paths, and Data Structures\n4.8\nstars\n1,820 ratings\n•\n216 reviews\n\nThe primary topics in this part of the specialization are: data structures (heaps, balanced search trees, hash tables, bloom filters), graph primitives (applications of breadth-first and depth-first search, connectivity, shortest paths), and their applications (ranging from deduplication to social network analysis)."
    },
    {
       "Url":"/learn/algorithms-greedy?specialization=algorithms",
       "name":"Greedy Algorithms, Minimum Spanning Trees, and Dynamic Programming",
       "Rating":"Greedy Algorithms, Minimum Spanning Trees, and Dynamic Programming\n4.8\nstars\n1,152 ratings\n•\n139 reviews\n\nThe primary topics in this part of the specialization are: greedy algorithms (scheduling, minimum spanning trees, clustering, Huffman codes) and dynamic programming (knapsack, sequence alignment, optimal search trees)."
    },
    {
       "Url":"/learn/algorithms-npcomplete?specialization=algorithms",
       "name":"Shortest Paths Revisited, NP-Complete Problems and What To Do About Them",
       "Rating":"Shortest Paths Revisited, NP-Complete Problems and What To Do About Them\n4.8\nstars\n736 ratings\n•\n102 reviews\n\nThe primary topics in this part of the specialization are: shortest paths (Bellman-Ford, Floyd-Warshall, Johnson), NP-completeness and what it means for the algorithm designer, and strategies for coping with computationally intractable problems (analysis of heuristics, local search)."
    },
    "/specializations/data-science-python",
    {
       "Url":"/learn/python-data-analysis?specialization=data-science-python",
       "name":"Introduction to Data Science in Python",
       "Rating":"Introduction to Data Science in Python\n4.5\nstars\n24,557 ratings\n•\n5,516 reviews\n\nThis course will introduce the learner to the basics of the python programming environment, including fundamental python programming techniques such as lambdas, reading and manipulating csv files, and the numpy library. The course will introduce data manipulation and cleaning techniques using the popular python pandas data science library and introduce the abstraction of the Series and DataFrame as the central data structures for data analysis, along with tutorials on how to use functions such as groupby, merge, and pivot tables effectively. By the end of this course, students will be able to take tabular data, clean it, manipulate it, and run basic inferential statistical analyses. \n\nThis course should be taken before any of the other Applied Data Science with Python courses: Applied Plotting, Charting & Data Representation in Python, Applied Machine Learning in Python, Applied Text Mining in Python, Applied Social Network Analysis in Python.\n\nSHOW ALL ABOUT INTRODUCTION TO DATA SCIENCE IN PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/python-plotting?specialization=data-science-python",
       "name":"Applied Plotting, Charting & Data Representation in Python",
       "Rating":"Applied Plotting, Charting & Data Representation in Python\n4.5\nstars\n5,795 ratings\n•\n985 reviews\n\nThis course will introduce the learner to information visualization basics, with a focus on reporting and charting using the matplotlib library. The course will start with a design and information literacy perspective, touching on what makes a good and bad visualization, and what statistical measures translate into in terms of visualizations. The second week will focus on the technology used to make visualizations in python, matplotlib, and introduce users to best practices when creating basic charts and how to realize design decisions in the framework. The third week will be a tutorial of functionality available in matplotlib, and demonstrate a variety of basic statistical charts helping learners to identify when a particular method is good for a particular problem. The course will end with a discussion of other forms of structuring and visualizing data. \n\nThis course should be taken after Introduction to Data Science in Python and before the remainder of the Applied Data Science with Python courses: Applied Machine Learning in Python, Applied Text Mining in Python, and Applied Social Network Analysis in Python.\n\nSHOW ALL ABOUT APPLIED PLOTTING, CHARTING & DATA REPRESENTATION IN PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/python-machine-learning?specialization=data-science-python",
       "name":"Applied Machine Learning in Python",
       "Rating":"Applied Machine Learning in Python\n4.6\nstars\n7,522 ratings\n•\n1,372 reviews\n\nThis course will introduce the learner to applied machine learning, focusing more on the techniques and methods than on the statistics behind these methods. The course will start with a discussion of how machine learning is different than descriptive statistics, and introduce the scikit learn toolkit through a tutorial. The issue of dimensionality of data will be discussed, and the task of clustering data, as well as evaluating those clusters, will be tackled. Supervised approaches for creating predictive models will be described, and learners will be able to apply the scikit learn predictive modelling methods while understanding process issues related to data generalizability (e.g. cross validation, overfitting). The course will end with a look at more advanced techniques, such as building ensembles, and practical limitations of predictive models. By the end of this course, students will be able to identify the difference between a supervised (classification) and unsupervised (clustering) technique, identify which technique they need to apply for a particular dataset and need, engineer features to meet that need, and write python code to carry out an analysis. \n\nThis course should be taken after Introduction to Data Science in Python and Applied Plotting, Charting & Data Representation in Python and before Applied Text Mining in Python and Applied Social Analysis in Python.\n\nSHOW ALL ABOUT APPLIED MACHINE LEARNING IN PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/python-text-mining?specialization=data-science-python",
       "name":"Applied Text Mining in Python",
       "Rating":"Applied Text Mining in Python\n4.2\nstars\n3,545 ratings\n•\n687 reviews\n\nThis course will introduce the learner to text mining and text manipulation basics. The course begins with an understanding of how text is handled by python, the structure of text both to the machine and to humans, and an overview of the nltk framework for manipulating text. The second week focuses on common manipulation needs, including regular expressions (searching for text), cleaning text, and preparing text for use by machine learning processes. The third week will apply basic natural language processing methods to text, and demonstrate how text classification is accomplished. The final week will explore more advanced methods for detecting the topics in documents and grouping them by similarity (topic modelling). \n\nThis course should be taken after: Introduction to Data Science in Python, Applied Plotting, Charting & Data Representation in Python, and Applied Machine Learning in Python.\n\nSHOW ALL ABOUT APPLIED TEXT MINING IN PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/python-social-network-analysis?specialization=data-science-python",
       "name":"Applied Social Network Analysis in Python",
       "Rating":"Applied Social Network Analysis in Python\n4.7\nstars\n2,476 ratings\n•\n416 reviews\n\nThis course will introduce the learner to network analysis through tutorials using the NetworkX library. The course begins with an understanding of what network analysis is and motivations for why we might model phenomena as networks. The second week introduces the concept of connectivity and network robustness. The third week will explore ways of measuring the importance or centrality of a node in a network. The final week will explore the evolution of networks over time and cover models of network generation and the link prediction problem. \n\nThis course should be taken after: Introduction to Data Science in Python, Applied Plotting, Charting & Data Representation in Python, and Applied Machine Learning in Python.\n\nSHOW ALL ABOUT APPLIED SOCIAL NETWORK ANALYSIS IN PYTHON\nSHOW ALL"
    }
 ]