[
    "/specializations/practical-data-science",
    {
       "Url":"/learn/automl-datasets-ml-models?specialization=practical-data-science",
       "name":"Analyze Datasets and Train ML Models using AutoML",
       "Rating":"Analyze Datasets and Train ML Models using AutoML\n4.6\nstars\n127 ratings\n•\n27 reviews\n\nIn the first course of the Practical Data Science Specialization, you will learn foundational concepts for exploratory data analysis (EDA), automated machine learning (AutoML), and text classification algorithms. With Amazon SageMaker Clarify and Amazon SageMaker Data Wrangler, you will analyze a dataset for statistical bias, transform the dataset into machine-readable features, and select the most important features to train a multi-class text classifier. You will then perform automated machine learning (AutoML) to automatically train, tune, and deploy the best text-classification algorithm for the given dataset using Amazon SageMaker Autopilot. Next, you will work with Amazon SageMaker BlazingText, a highly optimized and scalable implementation of the popular FastText algorithm, to train a text classifier with very little code.\n\nPractical data science is geared towards handling massive datasets that do not fit in your local hardware and could originate from multiple sources. One of the biggest benefits of developing and running data science projects in the cloud is the agility and elasticity that the cloud offers to scale up and out at a minimum cost.\n\nThe Practical Data Science Specialization helps you develop the practical skills to effectively deploy your data science projects and overcome challenges at each step of the ML workflow using Amazon SageMaker. This Specialization is designed for data-focused developers, scientists, and analysts familiar with the Python and SQL programming languages and want to learn how to build, train, and deploy scalable, end-to-end ML pipelines - both automated and human-in-the-loop - in the AWS cloud.\n\nSHOW ALL ABOUT ANALYZE DATASETS AND TRAIN ML MODELS USING AUTOML\nSHOW ALL"
    },
    {
       "Url":"/learn/ml-pipelines-bert?specialization=practical-data-science",
       "name":"Build, Train, and Deploy ML Pipelines using BERT",
       "Rating":"Build, Train, and Deploy ML Pipelines using BERT\n4.7\nstars\n56 ratings\n•\n9 reviews\n\nIn the second course of the Practical Data Science Specialization, you will learn to automate a natural language processing task by building an end-to-end machine learning pipeline using Hugging Face’s highly-optimized implementation of the state-of-the-art BERT algorithm with Amazon SageMaker Pipelines. Your pipeline will first transform the dataset into BERT-readable features and store the features in the Amazon SageMaker Feature Store. It will then fine-tune a text classification model to the dataset using a Hugging Face pre-trained model, which has learned to understand the human language from millions of Wikipedia documents. Finally, your pipeline will evaluate the model’s accuracy and only deploy the model if the accuracy exceeds a given threshold.\n\nPractical data science is geared towards handling massive datasets that do not fit in your local hardware and could originate from multiple sources. One of the biggest benefits of developing and running data science projects in the cloud is the agility and elasticity that the cloud offers to scale up and out at a minimum cost.\n\nThe Practical Data Science Specialization helps you develop the practical skills to effectively deploy your data science projects and overcome challenges at each step of the ML workflow using Amazon SageMaker. This Specialization is designed for data-focused developers, scientists, and analysts familiar with the Python and SQL programming languages and want to learn how to build, train, and deploy scalable, end-to-end ML pipelines - both automated and human-in-the-loop - in the AWS cloud.\n\nSHOW ALL ABOUT  BUILD, TRAIN, AND DEPLOY ML PIPELINES USING BERT\nSHOW ALL"
    },
    {
       "Url":"/learn/ml-models-human-in-the-loop-pipelines?specialization=practical-data-science",
       "name":"Optimize ML Models and Deploy Human-in-the-Loop Pipelines",
       "Rating":"Optimize ML Models and Deploy Human-in-the-Loop Pipelines\n4.8\nstars\n32 ratings\n•\n9 reviews\n\nIn the third course of the Practical Data Science Specialization, you will learn a series of performance-improvement and cost-reduction techniques to automatically tune model accuracy, compare prediction performance, and generate new training data with human intelligence.  After tuning your text classifier using Amazon SageMaker Hyper-parameter Tuning (HPT), you will deploy two model candidates into an A/B test to compare their real-time prediction performance and automatically scale the winning model using Amazon SageMaker Hosting. Lastly, you will set up a human-in-the-loop pipeline to fix misclassified predictions and generate new training data using Amazon Augmented AI and Amazon SageMaker Ground Truth.\n\nPractical data science is geared towards handling massive datasets that do not fit in your local hardware and could originate from multiple sources. One of the biggest benefits of developing and running data science projects in the cloud is the agility and elasticity that the cloud offers to scale up and out at a minimum cost.\n\nThe Practical Data Science Specialization helps you develop the practical skills to effectively deploy your data science projects and overcome challenges at each step of the ML workflow using Amazon SageMaker. This Specialization is designed for data-focused developers, scientists, and analysts familiar with the Python and SQL programming languages and want to learn how to build, train, and deploy scalable, end-to-end ML pipelines - both automated and human-in-the-loop - in the AWS cloud.\n\nSHOW ALL ABOUT OPTIMIZE ML MODELS AND DEPLOY HUMAN-IN-THE-LOOP PIPELINES\nSHOW ALL"
    },
    "/specializations/genomic-data-science",
    {
       "Url":"/learn/introduction-genomics?specialization=genomic-data-science",
       "name":"Introduction to Genomic Technologies",
       "Rating":"Introduction to Genomic Technologies\n4.6\nstars\n3,574 ratings\n•\n561 reviews\n\nThis course introduces you to the basic biology of modern genomics and the experimental tools that we use to measure it. We'll introduce the Central Dogma of Molecular Biology and cover how next-generation sequencing can be used to measure DNA, RNA, and epigenetic patterns. You'll also get an introduction to the key concepts in computing and data science that you'll need to understand how data from next-generation sequencing experiments are generated and analyzed.  \n\nThis is the first course in the Genomic Data Science Specialization.\n\nSHOW ALL ABOUT INTRODUCTION TO GENOMIC TECHNOLOGIES\nSHOW ALL"
    },
    {
       "Url":"/learn/galaxy-project?specialization=genomic-data-science",
       "name":"Genomic Data Science with Galaxy",
       "Rating":"Genomic Data Science with Galaxy\n3.6\nstars\n908 ratings\n•\n289 reviews\n\nLearn to use the tools that are available from the Galaxy Project. This is the second course in the Genomic Big Data Science Specialization."
    },
    {
       "Url":"/learn/python-genomics?specialization=genomic-data-science",
       "name":"Python for Genomic Data Science",
       "Rating":"Python for Genomic Data Science\n4.3\nstars\n1,336 ratings\n•\n255 reviews\n\nThis class provides an introduction to the Python programming language and the iPython notebook. This is the third course in the Genomic Big Data Science Specialization from Johns Hopkins University."
    },
    {
       "Url":"/learn/dna-sequencing?specialization=genomic-data-science",
       "name":"Algorithms for DNA Sequencing",
       "Rating":"Algorithms for DNA Sequencing\n4.7\nstars\n732 ratings\n•\n174 reviews\n\nWe will learn computational methods -- algorithms and data structures -- for analyzing DNA sequencing data. We will learn a little about DNA, genomics, and how DNA sequencing is used.  We will use Python to implement key algorithms and data structures and to analyze real genomes and DNA sequencing datasets."
    },
    {
       "Url":"/learn/genomic-tools?specialization=genomic-data-science",
       "name":"Command Line Tools for Genomic Data Science",
       "Rating":"Command Line Tools for Genomic Data Science\n4.1\nstars\n464 ratings\n•\n128 reviews\n\nIntroduces to the commands that you need to manage and analyze directories, files, and large sets of genomic data. This is the fourth course in the Genomic Big Data Science Specialization from Johns Hopkins University."
    },
    {
       "Url":"/learn/bioconductor?specialization=genomic-data-science",
       "name":"Bioconductor for Genomic Data Science",
       "Rating":"Bioconductor for Genomic Data Science\n3.9\nstars\n296 ratings\n•\n58 reviews\n\nLearn to use tools from the Bioconductor project to perform analysis of genomic data. This is the fifth course in the Genomic Big Data Specialization from Johns Hopkins University."
    },
    {
       "Url":"/learn/statistical-genomics?specialization=genomic-data-science",
       "name":"Statistics for Genomic Data Science",
       "Rating":"Statistics for Genomic Data Science\n4.2\nstars\n293 ratings\n•\n56 reviews\n\nAn introduction to the statistics behind the most popular genomic data science projects. This is the sixth course in the Genomic Big Data Science Specialization from Johns Hopkins University."
    },
    {
       "Url":"/learn/genomic-data-science-project?specialization=genomic-data-science",
       "name":"Genomic Data Science Capstone",
       "Rating":"Genomic Data Science Capstone\n4.6\nstars\n58 ratings\n•\n20 reviews\n\nIn this culminating project, you will deploy the tools and techniques that you've mastered over the course of the specialization. You'll work with a real data set to perform analyses and prepare a report of your findings."
    },
    "/specializations/python-3-programming",
    {
       "Url":"/learn/python-basics?specialization=python-3-programming",
       "name":"Python Basics",
       "Rating":"Python Basics\n4.8\nstars\n13,577 ratings\n•\n3,040 reviews\n\nThis course introduces the basics of Python 3, including conditional execution and iteration as control structures, and strings and lists as data structures. You'll program an on-screen Turtle to draw pretty pictures. You'll also learn to draw reference diagrams as a way to reason about program executions, which will help to build up your debugging skills. The course has no prerequisites. It will cover Chapters 1-9 of the textbook \"Fundamentals of Python Programming,\" which is the accompanying text (optional and free) for this course.\n\nThe course is for you if you're a newcomer to Python programming, if you need a refresher on Python basics, or if you may have had some exposure to Python programming but want a more in-depth exposition and vocabulary for describing and reasoning about programs.\n\nThis is the first of five courses in the Python 3 Programming Specialization.\n\nSHOW ALL ABOUT PYTHON BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/python-functions-files-dictionaries?specialization=python-3-programming",
       "name":"Python Functions, Files, and Dictionaries",
       "Rating":"Python Functions, Files, and Dictionaries\n4.8\nstars\n4,322 ratings\n•\n679 reviews\n\nThis course introduces the dictionary data structure and user-defined functions. You’ll learn about local and global variables, optional and keyword parameter-passing, named functions and lambda expressions. You’ll also learn about Python’s sorted function and how to control the order in which it sorts by passing in another function as an input. For your final project, you’ll read in simulated social media data from a file, compute sentiment scores, and write out .csv files. It covers chapters 10-16 of the textbook “Fundamentals of Python Programming,” which is the accompanying text (optional and free) for this course.\n\nThe course is well-suited for you if you have already taken the \"Python Basics\" course and want to gain further fundamental knowledge of the Python language. Together, both courses are geared towards newcomers to Python programming, those who need a refresher on Python basics, or those who may have had some exposure to Python programming but want a more in-depth exposition and vocabulary for describing and reasoning about programs.\n\nThis is a follow-up to the \"Python Basics\" course (course 1 of the Python 3 Programming Specialization), and it is the second of five courses in the specialization.\n\nSHOW ALL ABOUT PYTHON FUNCTIONS, FILES, AND DICTIONARIES\nSHOW ALL"
    },
    {
       "Url":"/learn/data-collection-processing-python?specialization=python-3-programming",
       "name":"Data Collection and Processing with Python",
       "Rating":"Data Collection and Processing with Python\n4.7\nstars\n3,288 ratings\n•\n554 reviews\n\nThis course teaches you to fetch and process data from services on the Internet. It covers Python list comprehensions and provides opportunities to practice extracting from and processing deeply nested data. You'll also learn how to use the Python requests module to interact with REST APIs and what to look for in documentation of those APIs. For the final project, you will construct a “tag recommender” for the flickr photo sharing site.\n\nThe course is well-suited for you if you have already taken the \"Python Basics\" and \"Python Functions, Files, and Dictionaries\" courses (courses 1 and 2 of the Python 3 Programming Specialization). If you are already familiar with Python fundamentals but want practice at retrieving and processing complex nested data from Internet services, you can also benefit from this course without taking the previous two.\n\nThis is the third of five courses in the Python 3 Programming Specialization.\n\nSHOW ALL ABOUT DATA COLLECTION AND PROCESSING WITH PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/python-classes-inheritance?specialization=python-3-programming",
       "name":"Python Classes and Inheritance",
       "Rating":"Python Classes and Inheritance\n4.7\nstars\n3,069 ratings\n•\n480 reviews\n\nThis course introduces classes, instances, and inheritance. You will learn how to use classes to represent data in concise and natural ways. You'll also learn how to override built-in methods and how to create \"inherited\" classes that reuse functionality. You'll also learn about how to design classes. Finally, you will be introduced to the good programming habit of writing automated tests for their own code.\n\nThe course is best-suited for you if you are already familiar with Python fundamentals, which are covered in the \"Python Basics\" and \"Python Functions, Files, and Dictionaries\" courses (courses 1 and 2 of the Python 3 Programming Specialization). It is optional to have taken the \"Data Collection and Processing with Python\" course (course 3 of the specialization), but knowledge of retrieving and processing complex nested data is helpful.\n\nThis is the fourth of five courses in the Python 3 Programming Specialization.\n\nSHOW ALL ABOUT PYTHON CLASSES AND INHERITANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/python-project?specialization=python-3-programming",
       "name":"Python Project: pillow, tesseract, and opencv",
       "Rating":"Python Project: pillow, tesseract, and opencv\n4.0\nstars\n1,613 ratings\n•\n394 reviews\n\nThis course will walk you through a hands-on project suitable for a portfolio. You will be introduced to third-party APIs and will be shown how to manipulate images using the Python imaging library (pillow), how to apply optical character recognition to images to recognize text (tesseract and py-tesseract), and how to identify faces in images using the popular opencv library. By the end of the course you will have worked with three different libraries available for Python 3 to create a real-world data-analysis project.\n\nThe course is best-suited for learners who have taken the first four courses of the Python 3 Programming Specialization. Learners who already have Python programming skills but want to practice with a hands-on, real-world data-analysis project can also benefit from this course.\n\nThis is the fifth and final course in the Python 3 Programming Specialization.\n\nSHOW ALL ABOUT PYTHON PROJECT: PILLOW, TESSERACT, AND OPENCV\nSHOW ALL"
    },
    "/specializations/java-programming",
    {
       "Url":"/learn/duke-programming-web?specialization=java-programming",
       "name":"Programming Foundations with JavaScript, HTML and CSS",
       "Rating":"Programming Foundations with JavaScript, HTML and CSS\n4.6\nstars\n12,564 ratings\n•\n2,735 reviews\n\nLearn foundational programming concepts (e.g., functions, for loops, conditional statements) and how to solve problems like a programmer. In addition, learn basic web development as you build web pages using HTML, CSS, JavaScript. By the end of the course, will create a web page where others can upload their images and apply image filters that you create.\n\nAfter completing this course, you will be able to:\n1. Think critically about how to solve a problem using programming;\n2. Write JavaScript programs using functions, for loops, and conditional statements;\n3. Use HTML to construct a web page with paragraphs, divs, images, links, and lists;\n4. Add styles to a web page with CSS IDs and classes; and\n5. Make a web page interactive with JavaScript commands like alert, onClick, onChange, adding input features like an image canvas, button, and slider.\n\nSHOW ALL ABOUT PROGRAMMING FOUNDATIONS WITH JAVASCRIPT, HTML AND CSS\nSHOW ALL"
    },
    {
       "Url":"/learn/java-programming?specialization=java-programming",
       "name":"Java Programming: Solving Problems with Software",
       "Rating":"Java Programming: Solving Problems with Software\n4.6\nstars\n6,617 ratings\n•\n1,390 reviews\n\nLearn to code in Java and improve your programming and problem-solving skills. You will learn to design algorithms as well as develop and debug programs. Using custom open-source classes, you will write programs that access and transform images, websites, and other types of data. At the end of the course you will build a program that determines the popularity of different baby names in the US over time by analyzing comma separated value (CSV) files. \n\nAfter completing this course you will be able to:\n1. Edit, compile, and run a Java program;\n2. Use conditionals and loops in a Java program;\n3. Use Java API documentation in writing programs. \n4. Debug a Java program using the scientific method;\n5. Write a Java method to solve a specific problem;\n6. Develop a set of test cases as part of developing a program;\n7. Create a class with multiple methods that work together to solve a problem; and\n8. Use divide-and-conquer design techniques for a program that uses multiple methods.\n\nSHOW ALL ABOUT JAVA PROGRAMMING: SOLVING PROBLEMS WITH SOFTWARE\nSHOW ALL"
    },
    {
       "Url":"/learn/java-programming-arrays-lists-data?specialization=java-programming",
       "name":"Java Programming: Arrays, Lists, and Structured Data",
       "Rating":"Java Programming: Arrays, Lists, and Structured Data\n4.7\nstars\n2,659 ratings\n•\n476 reviews\n\nBuild on the software engineering skills you learned in “Java Programming: Solving Problems with Software” by learning new data structures. Use these data structures to build more complex programs that use Java’s object-oriented features. At the end of the course you will write an encryption program and a program to break your encryption algorithm.\n\nAfter completing this course, you will be able to:\n1. Read and write data from/to files;\n2. Solve problems involving data files;\n3. Perform quantitative analyses of data (e.g., finding maximums, minimums, averages); \n4. Store and manipulate data in an array or ArrayList;\n5. Combine multiple classes to solve larger problems;\n6. Use iterables and collections (including maps) in Java.\n\nSHOW ALL ABOUT JAVA PROGRAMMING: ARRAYS, LISTS, AND STRUCTURED DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/java-programming-design-principles?specialization=java-programming",
       "name":"Java Programming: Principles of Software Design",
       "Rating":"Java Programming: Principles of Software Design\n4.6\nstars\n1,320 ratings\n•\n229 reviews\n\nSolve real world problems with Java using multiple classes. Learn how to create programming solutions that scale using Java interfaces. Recognize that software engineering is more than writing code - it also involves logical thinking and design. By the end of this course you will have written a program that analyzes and sorts earthquake data, and developed a predictive text generator.\n\nAfter completing this course, you will be able to:\n1. Use sorting appropriately in solving problems;\n2. Develop classes that implement the Comparable interface;\n3. Use timing data to analyze empirical performance;\n4. Break problems into multiple classes, each with their own methods;\n5. Determine if a class from the Java API can be used in solving a particular problem;\n6. Implement programming solutions using multiple approaches and recognize tradeoffs;\n7. Use object-oriented concepts including interfaces and abstract classes when developing programs;\n8. Appropriately hide implementation decisions so they are not visible in public methods; and\n9. Recognize the limitations of algorithms and Java programs in solving problems.\n10. Recognize standard Java classes and idioms including exception-handling, static methods, java.net, and java.io packages.\n\nSHOW ALL ABOUT JAVA PROGRAMMING: PRINCIPLES OF SOFTWARE DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/java-programming-recommender?specialization=java-programming",
       "name":"Java Programming: Build a Recommendation System",
       "Rating":"Java Programming: Build a Recommendation System\n4.7\nstars\n543 ratings\n•\n100 reviews\n\nEver wonder how Netflix decides what movies to recommend for you? Or how Amazon recommends books? We can get a feel for how it works by building a simplified recommender of our own!\n\nIn this capstone, you will show off your problem solving and Java programming skills by creating recommender systems. You will work with data for movies, including ratings, but the principles involved can easily be adapted to books, restaurants, and more. You will write a program to answer questions about the data, including which items should be recommended to a user based on their ratings of several movies. Given input files on users ratings and movie titles, you will be able to:\n\n1. Read in and parse data into lists and maps;\n2. Calculate average ratings;\n3. Calculate how similar a given rater is to another user based on ratings; and\n4. Recommend movies to a given user based on ratings. \n5. Display recommended movies for a given user on a webpage.\n\nSHOW ALL ABOUT JAVA PROGRAMMING: BUILD A RECOMMENDATION SYSTEM\nSHOW ALL"
    },
    "/specializations/blockchain-financial-services",
    {
       "Url":"/learn/intro-blockchain-financial-services?specialization=blockchain-financial-services",
       "name":"Introduction to Blockchain for Financial Services",
       "Rating":"Introduction to Blockchain for Financial Services\n4.7\nstars\n434 ratings\n•\n118 reviews\n\nIn this first course of the specialization, we will discuss the limitations of the Internet for business and economic activity, and explain how blockchain technology represents the way forward. After completing this course, you will be able to explain what blockchain is, how it works, and why it is revolutionary. You will learn key concepts such as mining, hashing, proof-of-work, public key cryptography, and the double-spend problem. You’ll be able to describe seven design principles for blockchain technology, and the challenges facing the people developing it. You’ll also meet the players in the blockchain ecosystem, and consider your own role in stewarding the blockchain revolution.\n\nSHOW ALL ABOUT INTRODUCTION TO BLOCKCHAIN FOR FINANCIAL SERVICES\nSHOW ALL"
    },
    {
       "Url":"/learn/blockchain-crypto-decentralized-finance?specialization=blockchain-financial-services",
       "name":"Blockchain, Cryptoassets, and Decentralized Finance",
       "Rating":"Blockchain, Cryptoassets, and Decentralized Finance\n4.6\nstars\n223 ratings\n•\n50 reviews\n\nToday, large intermediaries establish trust in our economy and control the movement, storage, and allocation of money and assets. The status quo, however, is rife with inefficiencies. In this course, we’ll address the many challenges of the status quo and discuss how cryptoassets, smart contracts, new identity systems, and new financial business models can help overcome them. You’ll learn how blockchain technology empowers individuals, entrepreneurs, and businesses with the tools they need to help level the playing field and to participate in the value they create. By the end of this course, you’ll learn how and why transacting on the blockchain can help us bring about a future that is faster, fairer, and more distributed than the world we inhabit today.\n\nSHOW ALL ABOUT BLOCKCHAIN, CRYPTOASSETS, AND DECENTRALIZED FINANCE\nSHOW ALL"
    },
    {
       "Url":"/learn/blockchain-transformations-financial-services?specialization=blockchain-financial-services",
       "name":"Blockchain Transformations of Financial Services",
       "Rating":"Blockchain Transformations of Financial Services\n4.7\nstars\n132 ratings\n•\n25 reviews\n\nThe current global financial system is riddled with inefficiencies, uneven developments, and bizarre contradictions. Blockchain technology has the potential to bring about profound changes to financial services. In this course, you will learn how blockchain technology will disrupt the core functions of the financial services industry, offering individuals and organizations alike real choices in how they create and manage value.\n\nSHOW ALL ABOUT BLOCKCHAIN TRANSFORMATIONS OF FINANCIAL SERVICES\nSHOW ALL"
    },
    {
       "Url":"/learn/blockchain-strategic-action-plan?specialization=blockchain-financial-services",
       "name":"Blockchain in Financial Services: Strategic Action Plan",
       "Rating":"Blockchain in Financial Services: Strategic Action Plan\n4.3\nstars\n40 ratings\n•\n13 reviews\n\nIn this fourth and final course of the specialization, you will synthesize your learning into a Strategic Action Plan. The goals of this course are twofold: One, it’s for you to identify a specific need or problem within the financial services industry that can potentially be solved using blockchain technology. Two, it’s for you to investigate possible solutions to this problem, and to develop a strategic plan for how these solutions might be executed. You will accomplish different project milestones each week, and will be introduced to several tools to organize your findings. Throughout this process, you will hear from real-world practitioners who have hands-on experience in the blockchain ecosystem. Additionally, by participating in this course you will gain access to our Blockchain Case Commons—a crowdsourced collection of blockchain applications and use-cases spanning multiple industries. As an outcome of this course, you will walk away with a consolidated, peer-reviewed Strategic Action Plan, which you can use to pitch your idea to your organization and/or potential investors.\n\nSHOW ALL ABOUT BLOCKCHAIN IN FINANCIAL SERVICES: STRATEGIC ACTION PLAN\nSHOW ALL"
    },
    "/specializations/data-structures-algorithms",
    {
       "Url":"/learn/algorithmic-toolbox?specialization=data-structures-algorithms",
       "name":"Algorithmic Toolbox",
       "Rating":"Algorithmic Toolbox\n4.6\nstars\n10,986 ratings\n•\n2,340 reviews\n\nThe course covers basic algorithmic techniques and ideas for computational problems arising frequently in practical applications: sorting and searching, divide and conquer, greedy algorithms, dynamic programming. We will learn a lot of theory: how to sort data and how it helps for searching; how to break a large problem into pieces and solve them recursively; when it makes sense to proceed greedily; how dynamic programming is used in genomic studies. You will practice solving computational problems, designing new algorithms, and implementing solutions efficiently (so that they run in less than a second).\n\nSHOW ALL ABOUT ALGORITHMIC TOOLBOX\nSHOW ALL"
    },
    {
       "Url":"/learn/data-structures?specialization=data-structures-algorithms",
       "name":"Data Structures",
       "Rating":"Data Structures\n4.6\nstars\n4,409 ratings\n•\n755 reviews\n\nA good algorithm usually comes together with a set of good data structures that allow the algorithm to manipulate the data efficiently. In this course, we consider the common data structures that are used in various computational problems. You will learn how these data structures are implemented in different programming languages and will practice implementing them in our programming assignments. This will help you to understand what is going on inside a particular built-in implementation of a data structure and what to expect from it. You will also learn typical use cases for these data structures.\n\nA few examples of questions that we are going to cover in this class are the following:\n1. What is a good strategy of resizing a dynamic array?\n2. How priority queues are implemented in C++, Java, and Python?\n3. How to implement a hash table so that the amortized running time of all operations is O(1) on average?\n4. What are good strategies to keep a binary tree balanced? \n\nYou will also learn how services like Dropbox manage to upload some large files instantly and to save a lot of storage space!\n\nSHOW ALL ABOUT DATA STRUCTURES\nSHOW ALL"
    },
    {
       "Url":"/learn/algorithms-on-graphs?specialization=data-structures-algorithms",
       "name":"Algorithms on Graphs",
       "Rating":"Algorithms on Graphs\n4.7\nstars\n2,023 ratings\n•\n341 reviews\n\nIf you have ever used a navigation service to find optimal route and estimate time to destination, you've used algorithms on graphs. Graphs arise in various real-world situations as there are road networks, computer networks and, most recently, social networks! If you're looking for the fastest time to get to work, cheapest way to connect set of computers into a network or efficient algorithm to automatically find communities and opinion leaders in Facebook, you're going to work with graphs and algorithms on graphs.\n\nIn this course, you will first learn what a graph is and what are some of the most important properties. Then you'll learn several ways to traverse graphs and how you can do useful things while traversing the graph in some order. We will then talk about shortest paths algorithms — from the basic ones to those which open door for 1000000 times faster algorithms used in Google Maps and other navigational services. You will use these algorithms if you choose to work on our Fast Shortest Routes industrial capstone project. We will finish with minimum spanning trees which are used to plan road, telephone and computer networks and also find applications in clustering and approximate algorithms.\n\nSHOW ALL ABOUT ALGORITHMS ON GRAPHS\nSHOW ALL"
    },
    {
       "Url":"/learn/algorithms-on-strings?specialization=data-structures-algorithms",
       "name":"Algorithms on Strings",
       "Rating":"Algorithms on Strings\n4.5\nstars\n969 ratings\n•\n168 reviews\n\nWorld and internet is full of textual information. We search for information using textual queries, we read websites, books, e-mails. All those are strings from the point of view of computer science. To make sense of all that information and make search efficient, search engines use many string algorithms. Moreover, the emerging field of personalized medicine uses many search algorithms to find disease-causing mutations in the human genome.\n\nSHOW ALL ABOUT ALGORITHMS ON STRINGS\nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-algorithms-and-complexity?specialization=data-structures-algorithms",
       "name":"Advanced Algorithms and Complexity",
       "Rating":"Advanced Algorithms and Complexity\n4.6\nstars\n610 ratings\n•\n117 reviews\n\nYou've learned the basic algorithms now and are ready to step into the area of more complex problems and algorithms to solve them. Advanced algorithms build upon basic ones and use new ideas. We will start with networks flows which are used in more typical applications such as optimal matchings, finding disjoint paths and flight scheduling as well as more surprising ones like image segmentation in computer vision. We then proceed to linear programming with applications in optimizing budget allocation, portfolio optimization, finding the cheapest diet satisfying all requirements and many others. Next we discuss inherently hard problems for which no exact good solutions are known (and not likely to be found) and how to solve them in practice. We finish with a soft introduction to streaming algorithms that are heavily used in Big Data processing. Such algorithms are usually designed to be able to process huge datasets without being able even to store a dataset.\n\nSHOW ALL ABOUT ADVANCED ALGORITHMS AND COMPLEXITY\nSHOW ALL"
    },
    {
       "Url":"/learn/assembling-genomes?specialization=data-structures-algorithms",
       "name":"Genome Assembly Programming Challenge",
       "Rating":"Genome Assembly Programming Challenge\n4.5\nstars\n295 ratings\n•\n55 reviews\n\nIn Spring 2011, thousands of people in Germany were hospitalized with a deadly disease that started as food poisoning with bloody diarrhea and often led to kidney failure. It was the beginning of the deadliest outbreak in recent history, caused by a mysterious bacterial strain that we will refer to as E. coli X. Soon, German officials linked the outbreak to a restaurant in Lübeck, where nearly 20% of the patrons had developed bloody diarrhea in a single week. At this point, biologists knew that they were facing a previously unknown pathogen and that traditional methods would not suffice – computational biologists would be needed to assemble and analyze the genome of the newly emerged pathogen.\n\nTo investigate the evolutionary origin and pathogenic potential of the outbreak strain, researchers started a crowdsourced research program. They released bacterial DNA sequencing data from one of a patient, which elicited a burst of analyses carried out by computational biologists on four continents. They even used GitHub for the project: https://github.com/ehec-outbreak-crowdsourced/BGI-data-analysis/wiki\n\nThe 2011 German outbreak represented an early example of epidemiologists collaborating with computational biologists to stop an outbreak. In this Genome Assembly Programming Challenge, you will follow in the footsteps of the bioinformaticians investigating the outbreak by developing a program to assemble the genome of the E. coli X from millions of overlapping substrings of the E.coli X genome.\n\nSHOW ALL ABOUT GENOME ASSEMBLY PROGRAMMING CHALLENGE\nSHOW ALL"
    },
    "/specializations/machine-learning-tensorflow-gcp",
    {
       "Url":"/learn/google-machine-learning?specialization=machine-learning-tensorflow-gcp",
       "name":"How Google does Machine Learning",
       "Rating":"How Google does Machine Learning\n4.6\nstars\n6,675 ratings\n•\n1,051 reviews\n\nWhat is machine learning, and what kinds of problems can it solve? Google thinks about machine learning slightly differently -- of being about logic, rather than just data. We talk about why such a framing is useful for data scientists when thinking about building a pipeline of machine learning models. \n\nThen, we discuss the five phases of converting a candidate use case to be driven by machine learning, and consider why it is important the phases not be skipped. We end with a recognition of the biases that machine learning can amplify and how to recognize this.\n\n>>> By enrolling in this specialization you agree to the Qwiklabs Terms of Service as set out in the FAQ and located at: https://qwiklabs.com/terms_of_service <<<\n\nSHOW ALL ABOUT HOW GOOGLE DOES MACHINE LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/launching-machine-learning?specialization=machine-learning-tensorflow-gcp",
       "name":"Launching into Machine Learning",
       "Rating":"Launching into Machine Learning\n4.6\nstars\n4,063 ratings\n•\n465 reviews\n\nStarting from a history of machine learning, we discuss why neural networks today perform so well in a variety of data science problems. We then discuss how to set up a supervised learning problem and find a good solution using gradient descent. This involves creating datasets that permit generalization; we talk about methods of doing so in a repeatable way that supports experimentation.\n\nCourse Objectives:\nIdentify why deep learning is currently popular\nOptimize and evaluate models using loss functions and performance metrics\nMitigate common problems that arise in machine learning\nCreate repeatable and scalable training, evaluation, and test datasets\n\nSHOW ALL ABOUT LAUNCHING INTO MACHINE LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/intro-tensorflow?specialization=machine-learning-tensorflow-gcp",
       "name":"Introduction to TensorFlow",
       "Rating":"Introduction to TensorFlow\n4.4\nstars\n2,591 ratings\n•\n321 reviews\n\nThis course is focused on using the flexibility and “ease  of use” of TensorFlow 2.x and Keras to build, train, and deploy machine learning models.  You will learn about the TensorFlow 2.x API hierarchy and will get to know the main components of TensorFlow through hands-on exercises.  We will introduce you to working with datasets and feature columns. You will learn how to design and build a TensorFlow 2.x input data pipeline.  You will get hands-on practice loading csv data, numPy arrays, text data, and images using tf.Data.Dataset. You will also get hands-on practice creating numeric, categorical, bucketized, and hashed feature columns.\n\nWe will introduce you to the Keras Sequential API and the Keras Functional API to show you how to create deep learning models.  We’ll talk about activation functions, loss, and optimization.  Our Jupyter Notebooks hands-on labs offer you the opportunity to build basic linear regression, basic logistic regression, and advanced logistic regression machine learning models.  You will learn how to train, deploy, and productionalize machine learning models at scale with Cloud AI Platform.\n\nSHOW ALL ABOUT INTRODUCTION TO TENSORFLOW\nSHOW ALL"
    },
    {
       "Url":"/learn/feature-engineering?specialization=machine-learning-tensorflow-gcp",
       "name":"Feature Engineering",
       "Rating":"Feature Engineering\n4.5\nstars\n1,651 ratings\n•\n180 reviews\n\nWant to know how you can improve the accuracy of your ML models? What about how to find which data columns make the most useful features? Welcome to Feature Engineering where we will discuss good vs bad features and how you can preprocess and transform them for optimal use in your models."
    },
    {
       "Url":"/learn/art-science-ml?specialization=machine-learning-tensorflow-gcp",
       "name":"Art and Science of Machine Learning",
       "Rating":"Art and Science of Machine Learning\n4.6\nstars\n1,362 ratings\n•\n119 reviews\n\nWelcome to the Art and Science of machine learning.  This course is delivered in 6 modules. The course covers the essential skills of ML intuition, good judgment and experimentation needed to finely tune and optimize ML models for the best performance.  You will learn how to generalize your model using Regularization techniques and about the effects of hyperparameters such as batch size and learning rate on  model performance.  We’ll cover some of the most common model optimization algorithms and show you how to specify an optimization method in your TensorFlow code.\n\nSHOW ALL ABOUT ART AND SCIENCE OF MACHINE LEARNING\nSHOW ALL"
    },
    "/specializations/advanced-data-science-ibm",
    {
       "Url":"/learn/ds?specialization=advanced-data-science-ibm",
       "name":"Fundamentals of Scalable Data Science",
       "Rating":"Fundamentals of Scalable Data Science\n4.3\nstars\n1,906 ratings\n•\n420 reviews\n\nApache Spark is the de-facto standard for large scale data processing. This is the first course of a series of courses towards the IBM Advanced Data Science Specialization. We strongly believe that is is crucial for success to start learning a scalable data science platform since memory and CPU constraints are to most limiting factors when it comes to building advanced machine learning models.\n\nIn this course we teach you the fundamentals of Apache Spark using python and pyspark. We'll introduce Apache Spark in the first two weeks and learn how to apply it to compute basic exploratory and data pre-processing tasks in the last two weeks. Through this exercise you'll also be introduced to the most fundamental statistical measures and data visualization technologies.\n\nThis gives you enough knowledge to take over the role of a data engineer in any modern environment. But it gives you also the basis for advancing your career towards data science. \n\nPlease have a look at the full specialization curriculum:\nhttps://www.coursera.org/specializations/advanced-data-science-ibm\n\nIf you choose to take this course and earn the Coursera course certificate, you will also earn an IBM digital badge.  To find out more about IBM digital badges follow the link ibm.biz/badging.\n\n\nAfter completing this course, you will be able to:\n•\tDescribe how basic statistical measures, are used to reveal  patterns within the data \n•\tRecognize data characteristics, patterns, trends, deviations or inconsistencies, and potential outliers.\n•\tIdentify useful techniques for working with big data such as dimension reduction and feature selection methods \n•\tUse advanced tools and charting libraries to:\n      o\timprove efficiency of analysis of big-data with partitioning and parallel analysis \n      o\tVisualize the data in an number of 2D and 3D formats (Box Plot, Run Chart, Scatter Plot, Pareto Chart, and Multidimensional Scaling)\n\nFor successful completion of the course, the following prerequisites are recommended: \n•\tBasic programming skills in python\n•\tBasic math\n•\tBasic SQL (you can get it easily from https://www.coursera.org/learn/sql-data-science if needed)\n\nIn order to complete this course, the following technologies will be used:\n(These technologies are introduced in the course as necessary so no previous knowledge is required.)\n•\tJupyter notebooks (brought to you by IBM Watson Studio for free)\n•\tApacheSpark (brought to you by IBM Watson Studio for free)\n•\tPython\n\nWe've been reported that some of the material in this course is too advanced. So in case you feel the same, please have a look at the following materials first before starting this course, we've been reported that this really helps.\n\nOf course, you can give this course a try first and then in case you need, take the following courses / materials. It's free...\n\nhttps://cognitiveclass.ai/learn/spark\n\nhttps://dataplatform.cloud.ibm.com/analytics/notebooks/v2/f8982db1-5e55-46d6-a272-fd11b670be38/view?access_token=533a1925cd1c4c362aabe7b3336b3eae2a99e0dc923ec0775d891c31c5bbbc68\n\nThis course takes four weeks, 4-6h per week\n\nSHOW ALL ABOUT FUNDAMENTALS OF SCALABLE DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-machine-learning-signal-processing?specialization=advanced-data-science-ibm",
       "name":"Advanced Machine Learning and Signal Processing",
       "Rating":"Advanced Machine Learning and Signal Processing\n4.5\nstars\n1,155 ratings\n•\n209 reviews\n\n>>> By enrolling in this course you agree to the End User License Agreement as set out in the FAQ.  Once enrolled you can access the license in the Resources area <<<\n\nThis course, Advanced Machine Learning and Signal Processing, is part of the IBM Advanced Data Science Specialization which IBM is currently creating and gives you easy access to the invaluable insights into Supervised and Unsupervised Machine Learning Models used by experts in many field relevant disciplines. We’ll learn about the fundamentals of Linear Algebra to understand how machine learning modes work. Then we introduce the most popular Machine Learning Frameworks for python Scikit-Learn and SparkML. SparkML is making up the greatest portion of this course since scalability is key to address performance bottlenecks. We learn how to tune the models in parallel by evaluating hundreds of different parameter-combinations in parallel. We’ll continuously use a real-life example from IoT (Internet of Things), for exemplifying the different algorithms. For passing the course you are even required to create your own vibration sensor data using the accelerometer sensors in your smartphone. So you are actually working on a self-created, real dataset throughout the course.\n\nIf you choose to take this course and earn the Coursera course certificate, you will also earn an IBM digital badge.  To find out more about IBM digital badges follow the link ibm.biz/badging.\n\nSHOW ALL ABOUT ADVANCED MACHINE LEARNING AND SIGNAL PROCESSING\nSHOW ALL"
    },
    {
       "Url":"/learn/ai?specialization=advanced-data-science-ibm",
       "name":"Applied AI with DeepLearning",
       "Rating":"Applied AI with DeepLearning\n4.4\nstars\n1,029 ratings\n•\n177 reviews\n\n>>> By enrolling in this course you agree to the End User License Agreement as set out in the FAQ.  Once enrolled you can access the license in the Resources area <<<\n\nThis course, Applied Artificial Intelligence with DeepLearning, is part of the IBM Advanced Data Science Certificate which IBM is currently creating and gives you easy access to the invaluable insights into Deep Learning models used by experts in Natural Language Processing, Computer Vision, Time Series Analysis, and many other disciplines. We’ll learn about the fundamentals of Linear Algebra and Neural Networks. Then we introduce the most popular DeepLearning Frameworks like Keras, TensorFlow, PyTorch, DeepLearning4J and Apache SystemML. Keras and TensorFlow are making up the greatest portion of this course. We learn about Anomaly Detection, Time Series Forecasting, Image Recognition and Natural Language Processing by building up models using Keras on real-life examples from IoT (Internet of Things), Financial Marked Data, Literature or Image Databases. Finally, we learn how to scale those artificial brains using Kubernetes, Apache Spark and GPUs.\n\nIMPORTANT: THIS COURSE ALONE IS NOT SUFFICIENT TO OBTAIN THE \"IBM Watson IoT Certified Data Scientist certificate\". You need to take three other courses where two of them are currently built. The Specialization will be ready late spring, early summer 2018\n\nUsing these approaches, no matter what your skill levels in topics you would like to master, you can change your thinking and change your life. If you’re already an expert, this peep under the mental hood will give your ideas for turbocharging successful creation and deployment of DeepLearning models. If you’re struggling, you’ll see a structured treasure trove of practical techniques that walk you through what you need to do to get on track. If you’ve ever wanted to become better at anything, this course will help serve as your guide.\n\nPrerequisites: Some coding skills are necessary. Preferably python, but any other programming language will do fine. Also some basic understanding of math (linear algebra) is a plus, but we will cover that part in the first week as well.\n\nIf you choose to take this course and earn the Coursera course certificate, you will also earn an IBM digital badge.  To find out more about IBM digital badges follow the link ibm.biz/badging.\n\nSHOW ALL ABOUT APPLIED AI WITH DEEPLEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-data-science-capstone?specialization=advanced-data-science-ibm",
       "name":"Advanced Data Science Capstone",
       "Rating":"Advanced Data Science Capstone\n4.6\nstars\n360 ratings\n•\n66 reviews\n\nThis project completer has proven a deep understanding on massive parallel data processing, data exploration and visualization, advanced machine learning and deep learning and how to apply his knowledge in a real-world practical use case where he justifies architectural decisions, proves understanding the characteristics of different algorithms, frameworks and technologies and how they impact model performance and scalability. \n\nPlease note: You are requested to create a short video presentation at the end of the course. This is mandatory to pass. You don't need to share the video in public.\n\nSHOW ALL ABOUT ADVANCED DATA SCIENCE CAPSTONE\nSHOW ALL"
    },
    "/specializations/ai-for-medicine",
    {
       "Url":"/learn/ai-for-medical-diagnosis?specialization=ai-for-medicine",
       "name":"AI for Medical Diagnosis",
       "Rating":"AI for Medical Diagnosis\n4.7\nstars\n1,586 ratings\n•\n348 reviews\n\nAI is transforming the practice of medicine. It’s helping doctors diagnose patients more accurately, make predictions about patients’ future health, and recommend better treatments. As an AI practitioner, you have the opportunity to join in this transformation of modern medicine. If you're already familiar with some of the math and coding behind AI algorithms, and are eager to develop your skills further to tackle challenges in the healthcare industry, then this specialization is for you. No prior medical expertise is required! \n\nThis program will give you practical experience in applying cutting-edge machine learning techniques to concrete problems in modern medicine:\n\n- In Course 1, you will create convolutional neural network image classification and segmentation models to make diagnoses of lung and brain disorders. \n- In Course 2, you will build risk models and survival estimators for heart disease using statistical methods and a random forest predictor to determine patient prognosis. \n- In Course 3, you will build a treatment effect predictor, apply model interpretation techniques and use natural language processing to extract information from radiology reports.\n\nThese courses go beyond the foundations of deep learning to give you insight into the nuances of applying AI to medical use cases. As a learner, you will be set up for success in this program if you are already comfortable with some of the math and coding behind AI algorithms. You don't need to be an AI expert, but a working knowledge of deep neural networks, particularly convolutional networks, and proficiency in Python programming at an intermediate level will be essential. If you are relatively new to machine learning or neural networks, we recommend that you first take the Deep Learning Specialization, offered by deeplearning.ai and taught by Andrew Ng.\n\nThe demand for AI practitioners with the skills and knowledge to tackle the biggest issues in modern medicine is growing exponentially. Join us in this specialization and begin your journey toward building the future of healthcare.\n\nSHOW ALL ABOUT AI FOR MEDICAL DIAGNOSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/ai-for-medical-prognosis?specialization=ai-for-medicine",
       "name":"AI for Medical Prognosis",
       "Rating":"AI for Medical Prognosis\n4.7\nstars\n668 ratings\n•\n115 reviews\n\nAI is transforming the practice of medicine. It’s helping doctors diagnose patients more accurately, make predictions about patients’ future health, and recommend better treatments. This Specialization will give you practical experience in applying machine learning to concrete problems in medicine.\n\nMachine learning is a powerful tool for prognosis, a branch of medicine that specializes in predicting the future health of patients. In this second course, you’ll walk through multiple examples of prognostic tasks. You’ll then use decision trees to model non-linear relationships, which are commonly observed in medical data, and apply them to predicting mortality rates more accurately. Finally, you’ll learn how to handle missing data, a key real-world challenge. \n\nThese courses go beyond the foundations of deep learning to teach you the nuances in applying AI to medical use cases.  This course focuses on tree-based machine learning, so a foundation in deep learning is not required for this course.  However, a foundation in deep learning is highly recommended for course 1 and 3 of this specialization.  You can gain a foundation in deep learning by taking the Deep Learning Specialization offered by deeplearning.ai and taught by Andrew Ng.\n\nSHOW ALL ABOUT AI FOR MEDICAL PROGNOSIS \nSHOW ALL"
    },
    {
       "Url":"/learn/ai-for-medical-treatment?specialization=ai-for-medicine",
       "name":"AI For Medical Treatment",
       "Rating":"AI For Medical Treatment\n4.7\nstars\n444 ratings\n•\n93 reviews\n\nAI is transforming the practice of medicine. It’s helping doctors diagnose patients more accurately, make predictions about patients’ future health, and recommend better treatments. This Specialization will give you practical experience in applying machine learning to concrete problems in medicine.\n\nMedical treatment may impact patients differently based on their existing health conditions. In this third course, you’ll recommend treatments more suited to individual patients using data from randomized control trials. In the second week, you’ll apply machine learning interpretation methods to explain the decision-making of complex machine learning models. Finally, you’ll use natural language entity extraction and question-answering methods to automate the task of labeling medical datasets.\n\nThese courses go beyond the foundations of deep learning to teach you the nuances in applying AI to medical use cases. If you are new to deep learning or want to get a deeper foundation of how neural networks work, we recommend that you take the Deep Learning Specialization.\n\nSHOW ALL ABOUT AI FOR MEDICAL TREATMENT\nSHOW ALL"
    },
    "/specializations/executive-data-science",
    {
       "Url":"/learn/data-science-course?specialization=executive-data-science",
       "name":"A Crash Course in Data Science",
       "Rating":"A Crash Course in Data Science\n4.5\nstars\n7,680 ratings\n•\n1,453 reviews\n\nBy now you have definitely heard about data science and big data. In this one-week class, we will provide a crash course in what these terms mean and how they play a role in successful organizations. This class is for anyone who wants to learn what all the data science action is about, including those who will eventually need to manage data scientists. The goal is to get you up to speed as quickly as possible on data science without all the fluff. We've designed this course to be as convenient as possible without sacrificing any of the essentials.\n\nThis is a focused course designed to rapidly get you up to speed on the field of data science. Our goal was to make this as convenient as possible for you without sacrificing any essential content. We've left the technical information aside so that you can focus on managing your team and moving it forward.\n\nAfter completing this course you will know. \n\n1. How to describe the role data science plays in various contexts\n2. How statistics, machine learning, and software engineering play a role in data science\n3. How to describe the structure of a data science project\n4. Know the key terms and tools used by data scientists\n5. How to identify a successful and an unsuccessful data science project\n3. The role of a data science manager\n\n\nCourse cover image by r2hox. Creative Commons BY-SA: https://flic.kr/p/gdMuhT\n\nSHOW ALL ABOUT A CRASH COURSE IN DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/build-data-science-team?specialization=executive-data-science",
       "name":"Building a Data Science Team",
       "Rating":"Building a Data Science Team\n4.5\nstars\n3,184 ratings\n•\n438 reviews\n\nData science is a team sport. As a data science executive it is your job to recruit, organize, and manage the team to success. In this one-week course, we will cover how you can find the right people to fill out your data science team, how to organize them to give them the best chance to feel empowered and successful, and how to manage your team as it grows. \n\nThis is a focused course designed to rapidly get you up to speed on the process of building and managing a data science team. Our goal was to make this as convenient as possible for you without sacrificing any essential content. We've left the technical information aside so that you can focus on managing your team and moving it forward.\n\nAfter completing this course you will know.\n\n1. The different roles in the data science team including data scientist and data engineer\n2. How the data science team relates to other teams in an organization\n3. What are the expected qualifications of different data science team members\n4. Relevant questions for interviewing data scientists\n5. How to manage the onboarding process for the team\n6. How to guide data science teams to success\n7. How to encourage and empower data science teams\n\nCommitment: 1 week of study, 4-6 hours\n\nCourse cover image by JaredZammit. Creative Commons BY-SA. https://flic.kr/p/5vuWZz\n\nSHOW ALL ABOUT BUILDING A DATA SCIENCE TEAM\nSHOW ALL"
    },
    {
       "Url":"/learn/managing-data-analysis?specialization=executive-data-science",
       "name":"Managing Data Analysis",
       "Rating":"Managing Data Analysis\n4.6\nstars\n3,152 ratings\n•\n445 reviews\n\nThis one-week course describes the process of analyzing data and how to manage that process. We describe the iterative nature of data analysis and the role of stating a sharp question, exploratory data analysis, inference, formal statistical modeling, interpretation, and communication. In addition, we will describe how to direct analytic activities within a team and to drive the data analysis process towards coherent and useful results. \n\nThis is a focused course designed to rapidly get you up to speed on the process of data analysis and how it can be managed. Our goal was to make this as convenient as possible for you without sacrificing any essential content. We've left the technical information aside so that you can focus on managing your team and moving it forward.\n\nAfter completing this course you will know how to….\n\n1. Describe the basic data analysis iteration\n2. Identify different types of questions and translate them to specific datasets\n3. Describe different types of data pulls\n4. Explore datasets to determine if data are appropriate for a given question\n5. Direct model building efforts in common data analyses\n6. Interpret the results from common data analyses\n7. Integrate statistical findings to form coherent data analysis presentations\n\nCommitment: 1 week of study, 4-6 hours\n\nCourse cover image by fdecomite. Creative Commons BY https://flic.kr/p/4HjmvD\n\nSHOW ALL ABOUT MANAGING DATA ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/real-life-data-science?specialization=executive-data-science",
       "name":"Data Science in Real Life",
       "Rating":"Data Science in Real Life\n4.4\nstars\n2,254 ratings\n•\n270 reviews\n\nHave you ever had the perfect data science experience? The data pull went perfectly. There were no merging errors or missing data. Hypotheses were clearly defined prior to analyses. Randomization was performed for the treatment of interest. The analytic plan was outlined prior to analysis and followed exactly. The conclusions were clear and actionable decisions were obvious. Has that every happened to you? Of course not. Data analysis in real life is messy. How does one manage a team facing real data analyses? In this one-week course, we contrast the ideal with what happens in real life. By contrasting the ideal, you will learn key concepts that will help you manage real life analyses. \n\nThis is a focused course designed to rapidly get you up to speed on doing data science in real life. Our goal was to make this as convenient as possible for you without sacrificing any essential content. We've left the technical information aside so that you can focus on managing your team and moving it forward.\n\nAfter completing this course you will know how to:\n\n1, Describe the “perfect” data science experience\n2. Identify strengths and weaknesses in experimental designs\n3. Describe possible pitfalls when pulling / assembling data and learn solutions for managing data pulls.\n4. Challenge statistical modeling assumptions and drive feedback to data analysts\n5. Describe common pitfalls in communicating data analyses\n6. Get a glimpse into a day in the life of a data analysis manager.\n\nThe course will be taught at a conceptual level for active managers of data scientists and statisticians.  Some key concepts being discussed include:\n1. Experimental design, randomization, A/B testing\n2. Causal inference, counterfactuals, \n3. Strategies for managing data quality.\n4. Bias and confounding\n5. Contrasting machine learning versus classical statistical inference\n\nCourse promo:\nhttps://www.youtube.com/watch?v=9BIYmw5wnBI\n\nCourse cover image by Jonathan Gross. Creative Commons BY-ND https://flic.kr/p/q1vudb\n\nSHOW ALL ABOUT DATA SCIENCE IN REAL LIFE\nSHOW ALL"
    },
    {
       "Url":"/learn/executive-data-science-capstone?specialization=executive-data-science",
       "name":"Executive Data Science Capstone",
       "Rating":"Executive Data Science Capstone\n4.7\nstars\n1,499 ratings\n•\n329 reviews\n\nThe Executive Data Science Capstone, the specialization’s culminating project, is an opportunity for people who have completed all four EDS courses to apply what they've learned to a real-world scenario developed in collaboration with Zillow, a data-driven online real estate and rental marketplace, and DataCamp, a web-based platform for data science programming. Your task will be to lead a virtual data science team and make key decisions along the way to demonstrate that you have what it takes to shepherd a complex analysis project from start to finish.  For the final project, you will prepare and submit a presentation, which will be evaluated and graded by your fellow capstone participants.\n\nCourse cover image by Luckey_sun. Creative Commons BY-SA https://flic.kr/p/bx1jvU\n\nSHOW ALL ABOUT EXECUTIVE DATA SCIENCE CAPSTONE\nSHOW ALL"
    },
    "/specializations/excel-data-analytics-visualization",
    {
       "Url":"/learn/excel-data-analysis-fundamentals?specialization=excel-data-analytics-visualization",
       "name":"Excel Fundamentals for Data Analysis",
       "Rating":"Excel Fundamentals for Data Analysis\n4.8\nstars\n1,415 ratings\n•\n379 reviews\n\nAs data becomes the modern currency, so the ability to analyse the data quickly and accurately has become of paramount importance. Excel with its extraordinarily broad range of features and capabilities is one of the most widely used programs for doing this. In the first course of our Excel Skills for Data Analysis and Visualization Specialization, you will learn the fundamentals of Excel for data analysis. When you have completed the course, you will be able to use a range of Excel tools and functions to clean and prepare data for analysis; automate data analysis with the help of Named Ranges and Tables; and use logical and lookup functions to transform, link and categorise data.\n\nThis course will enable you to build a strong foundation in the fundamentals, helping you to be more efficient in your day-to-day and developing the necessary skills to work with the more advanced techniques used in later courses. To make the content easy to relate to and to personalize the learning experience, we are going to follow Zara's journey through the course. Who is Zara? Well, she is no-one and everyone. You will find that Zara's trials and tribulations sound familiar, and together with Zara, you will develop your Excel skills along the way — and, importantly, have some fun doing it.\n\nThe Excel Skills for Data Analytics and Visualization courses are the sequel to one of most successful specializations on Coursera, Excel Skills for Business, which has attracted hundreds of thousands of learners and top ratings. Transform your skills, your confidence, and your opportunities by adding this new set of skills to your repertoire.\n\nSHOW ALL ABOUT EXCEL FUNDAMENTALS FOR DATA ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/excel-data-visualization?specialization=excel-data-analytics-visualization",
       "name":"Data Visualization in Excel",
       "Rating":"Data Visualization in Excel\n4.9\nstars\n200 ratings\n•\n60 reviews\n\nIn an age now driven by \"big data\", we need to cut through the noise and present key information in a way that can be quickly consumed and acted upon making data visualization an increasingly important skill. Visualizations need to not only present data in an easy to understand and attractive way, but they must also provide context for the data, tell a story, achieving that fine balance between form and function. Excel has many rivals in this space, but it is still an excellent choice, particularly if it's where your data resides. It offers a wealth of tools for creating visualizations other than charts and the chart options available are constantly increasing and improving, so the newer versions now include waterfall charts, sunburst diagrams and even map charts. But what sets Excel apart is its flexibility, it gives us total creative control over our designs so if needed we could produce our own animated custom chart to tell the right story for our data.\n\nOver five weeks we will explore Excel's rich selection of visualization tools using practical case studies as seen through the eyes of Rohan, an environmental analyst. Rohan is required to produce visualizations that will show trends, forecasts, breakdowns and comparisons for a large variety of environmental data sets. As well as utilising the usual chart types he wants to use conditional formats, sparklines, specialised charts and even create his own animated charts and infographics. In some cases, he will also need to prepare the data using pivot tables to drill down and answer very specific questions. We are going to help him achieve all this and present our finished visualizations in attractive reports and dashboards that use tools like slicers and macros for automation and interactivity.\n\nThese are the topics we will cover:\nWeek 1: \tDynamic visualizations with conditional formatting, custom number formatting, sparklines and macros\nWeek 2: \tCharting techniques for telling the right story\nWeek 3: \tCreating specialised and custom charts\nWeek 4: \tSummarising and filtering data with pivot tables and pivot charts\nWeek 5: \tCreating interactive dashboards in Excel\n\nThis is the second course in our Specialization on Data Analytics and Visualization. The first course: Excel Fundamentals for Data Analysis, covers data preparation and cleaning but also teaches some of the prerequisites for this course like tables and named ranges as well as text, lookup and logical functions. To get the most out of this course we would recommend you do the first course or have experience with these topics. In this course we focus on Data Visualization in Excel, join us for this exciting journey.\n\nSHOW ALL ABOUT DATA VISUALIZATION IN EXCEL\nSHOW ALL"
    },
    {
       "Url":"/learn/excel-power-tools?specialization=excel-data-analytics-visualization",
       "name":"Excel Power Tools for Data Analysis",
       "Rating":"Excel Power Tools for Data Analysis\n4.9\nstars\n167 ratings\n•\n53 reviews\n\nWelcome to Excel Power Tools for Data Analysis. In this four-week course, we introduce Power Query, Power Pivot and Power BI, three power tools for transforming, analysing and presenting data.\n\nExcel's ease and flexibility have long made it a tool of choice for doing data analysis, but it does have some inherent limitations: for one, truly \"big\" data simply does not fit in a spreadsheet and for another, the process of importing and cleaning data can be a repetitive, time-consuming and error-prone. Over the last few years, Microsoft have worked on transforming the end-to-end experience for analysts, and Excel has undergone a major upgrade with the inclusion of Power Query and Power Pivot.\n\nIn this course, we will learn how to use Power Query to automate the process of importing and preparing data for analysis. We will see how Power Pivot revolutionises the actual analysis process by providing us with an analytical database inside the Excel workbook, capable of storing millions of rows, and a powerful modelling language called DAX which allows us to perform advanced analytics on our data. We will finish off by venturing out of Excel and introducing Power BI, which also uses the Power Query and Power BI architecture but allows us to create stunning interactive reports and dashboards.\n\nThis is the third course in our Specialization on Data Analytics and Visualization. The previous courses: Excel Fundamentals for Data Analysis and Data Visualization in Excel, cover data preparation, cleaning, visualisation, and creating dashboards. To get the most out of this course we would recommend you do the previous courses or have experience with these topics. In this course we focus on Excel Power Tools, join us for this exciting journey.\n\nPlease note that Power Query, Power Pivot and Power BI Desktop are only available on the Windows platform, so Mac users will require Bootcamp running Windows or a Virtual machine with a Window O/S. While Power Query is available as an add-in Excel 2010 and 2013, the tools have changed significantly, and this course has only been designed and tested for Excel 2016 and later. For an optimal experience, we recommend Office 365.\n\nSHOW ALL ABOUT EXCEL POWER TOOLS FOR DATA ANALYSIS\nSHOW ALL"
    },
    "/specializations/boulder-data-structures-algorithms",
    {
       "Url":"/learn/algorithms-searching-sorting-indexing?specialization=boulder-data-structures-algorithms",
       "name":"Algorithms for Searching, Sorting, and Indexing",
       "Rating":"Algorithms for Searching, Sorting, and Indexing\n4.7\nstars\n33 ratings\n•\n12 reviews\n\nThis course covers basics of algorithm design and analysis, as well as algorithms for sorting arrays, data structures such as priority queues, hash functions, and applications such as Bloom filters.\n\nAlgorithms for Searching, Sorting, and Indexing can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nSHOW ALL ABOUT ALGORITHMS FOR SEARCHING, SORTING, AND INDEXING\nSHOW ALL"
    },
    {
       "Url":"/learn/trees-graphs-basics?specialization=boulder-data-structures-algorithms",
       "name":"Trees and Graphs: Basics",
       "Rating":"Trees and Graphs: Basics\n4.7\nstars\n11 ratings\n•\n5 reviews\n\nBasic algorithms on tree data structures, binary search trees, self-balancing trees, graph data structures and basic traversal algorithms on graphs. This course also covers advanced topics such as kd-trees for spatial data and algorithms for spatial data.\n\nTrees and Graphs: Basics can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nSHOW ALL ABOUT TREES AND GRAPHS: BASICS\nSHOW ALL"
    },
    {
       "Url":"/learn/dynamic-programming-greedy-algorithms?specialization=boulder-data-structures-algorithms",
       "name":"Dynamic Programming, Greedy Algorithms",
       "Rating":"Dynamic Programming, Greedy Algorithms\n\nThis course covers basic algorithm design techniques such as divide and conquer, dynamic programming, and greedy algorithms. It concludes with a brief introduction to intractability (NP-completeness) and using linear/integer programming solvers for solving optimization problems. We will also cover some advanced topics in data structures.\n\nDynamic Programming, Greedy Algorithms can be taken for academic credit as part of CU Boulder’s Master of Science in Data Science (MS-DS) degree offered on the Coursera platform. The MS-DS is an interdisciplinary degree that brings together faculty from CU Boulder’s departments of Applied Mathematics, Computer Science, Information Science, and others. With performance-based admissions and no application process, the MS-DS is ideal for individuals with a broad range of undergraduate education and/or professional experience in computer science, information science, mathematics, and statistics. Learn more about the MS-DS program at https://www.coursera.org/degrees/master-of-science-data-science-boulder.\n\nSHOW ALL ABOUT DYNAMIC PROGRAMMING, GREEDY ALGORITHMS\nSHOW ALL"
    },
    "/specializations/excel-mysql",
    {
       "Url":"/learn/analytics-business-metrics?specialization=excel-mysql",
       "name":"Business Metrics for Data-Driven Companies",
       "Rating":"Business Metrics for Data-Driven Companies\n4.6\nstars\n7,946 ratings\n•\n1,647 reviews\n\nIn this course, you will learn best practices for how to use data analytics to make any company more competitive and more profitable. You will be able to recognize the most critical business metrics and distinguish them from mere data.\n\nYou’ll get a clear picture of the vital but different roles business analysts, business data analysts, and data scientists each play in various types of companies. And you’ll know exactly what skills are required to be hired for, and succeed at, these high-demand jobs.\n \nFinally, you will be able to use a checklist provided in the course to score any company on how effectively it is embracing big data culture. Digital companies like Amazon, Uber and Airbnb are transforming entire industries through their creative use of big data. You’ll understand why these companies are so disruptive and how they use data-analytics techniques to out-compete traditional companies.\n\nSHOW ALL ABOUT BUSINESS METRICS FOR DATA-DRIVEN COMPANIES\nSHOW ALL"
    },
    {
       "Url":"/learn/analytics-excel?specialization=excel-mysql",
       "name":"Mastering Data Analysis in Excel",
       "Rating":"Mastering Data Analysis in Excel\n4.2\nstars\n3,764 ratings\n•\n910 reviews\n\nImportant: The focus of this course is on math - specifically, data-analysis concepts and methods - not on Excel for its own sake. We use Excel to do our calculations, and all math formulas are given as Excel Spreadsheets, but we do not attempt to cover Excel Macros, Visual Basic, Pivot Tables, or other intermediate-to-advanced Excel functionality.\n\nThis course will prepare you to design and implement realistic predictive models based on data. In the Final Project (module 6) you will assume the role of a business data analyst for a bank, and develop two different predictive models to determine which applicants for credit cards should be accepted and which rejected. Your first model will focus on minimizing default risk, and your second on maximizing bank profits. The two models should demonstrate to you in a practical, hands-on way the idea that your choice of business metric drives your choice of an optimal model.\n\nThe second big idea this course seeks to demonstrate is that your data-analysis results cannot and should not aim to eliminate all uncertainty. Your role as a data-analyst is to reduce uncertainty for decision-makers by a financially valuable increment, while quantifying how much uncertainty remains. You will learn to calculate and apply to real-world examples the most important uncertainty measures used in business, including classification error rates, entropy of information, and confidence intervals for linear regression.\n\nAll the data you need is provided within the course, all assignments are designed to be done in MS Excel, and you will learn enough Excel to complete all assignments. The course will give you enough practice with Excel to become fluent in its most commonly used business functions, and you’ll be ready to learn any other Excel functionality you might need in the future (module 1).\n\nThe course does not cover Visual Basic or Pivot Tables and you will not need them to complete the assignments. All advanced concepts are demonstrated in individual Excel spreadsheet templates that you can use to answer relevant questions. You will emerge with substantial vocabulary and practical knowledge of how to apply business data analysis methods based on binary classification (module 2), information theory and entropy measures (module 3), and linear regression (module 4 and 5), all using no software tools more complex than Excel.\n\nSHOW ALL ABOUT MASTERING DATA ANALYSIS IN EXCEL\nSHOW ALL"
    },
    {
       "Url":"/learn/analytics-tableau?specialization=excel-mysql",
       "name":"Data Visualization and Communication with Tableau",
       "Rating":"Data Visualization and Communication with Tableau\n4.7\nstars\n2,988 ratings\n•\n703 reviews\n\nOne of the skills that characterizes great business data analysts is the ability to communicate practical implications of quantitative analyses to any kind of audience member.  Even the most sophisticated statistical analyses are not useful to a business if they do not lead to actionable advice, or if the answers to those business questions are not conveyed in a way that non-technical people can understand.  \n\nIn this course you will learn how to become a master at communicating business-relevant implications of data analyses.  By the end, you will know how to structure your data analysis projects to ensure the fruits of your hard labor yield results for your stakeholders.  You will also know how to streamline your analyses and highlight their implications efficiently using visualizations in Tableau, the most popular visualization program in the business world.  Using other Tableau features, you will be able to make effective visualizations that harness the human brain’s innate perceptual and cognitive tendencies to convey conclusions directly and clearly.  Finally, you will be practiced in designing and persuasively presenting business “data stories” that use these visualizations, capitalizing on business-tested methods and design principles.\n\nSHOW ALL ABOUT DATA VISUALIZATION AND COMMUNICATION WITH TABLEAU\nSHOW ALL"
    },
    {
       "Url":"/learn/analytics-mysql?specialization=excel-mysql",
       "name":"Managing Big Data with MySQL",
       "Rating":"Managing Big Data with MySQL\n4.7\nstars\n3,759 ratings\n•\n879 reviews\n\nThis course is an introduction to how to use relational databases in business analysis.  You will learn how relational databases work, and how to use entity-relationship diagrams to display the structure of the data held within them.  This knowledge will help you understand how data needs to be collected in business contexts, and help you identify features you want to consider if you are involved in implementing new data collection efforts.  You will also learn how to execute the most useful query and table aggregation statements for business analysts, and practice using them with real databases. No more waiting 48 hours for someone else in the company to provide data to you – you will be able to get the data by yourself!\n\nBy the end of this course, you will have a clear understanding of how relational databases work, and have a portfolio of queries you can show potential employers. Businesses are collecting increasing amounts of information with the hope that data will yield novel insights into how to improve businesses. Analysts that understand how to access this data – this means you! – will have a strong competitive advantage in this data-smitten business world.\n\nSHOW ALL ABOUT MANAGING BIG DATA WITH MYSQL\nSHOW ALL"
    },
    {
       "Url":"/learn/analytics-capstone?specialization=excel-mysql",
       "name":"Increasing Real Estate Management Profits: Harnessing Data Analytics",
       "Rating":"Increasing Real Estate Management Profits: Harnessing Data Analytics\n4.7\nstars\n230 ratings\n•\n51 reviews\n\nIn this final course you will complete a Capstone Project using data analysis to recommend a method for improving profits for your company, Watershed Property Management, Inc. Watershed is responsible for managing thousands of residential rental properties throughout the United States. Your job is to persuade Watershed’s management team to pursue a new strategy for managing its properties that will increase their profits. To do this, you will: (1) Elicit information about important variables relevant to your analysis; (2) Draw upon your new MySQL database skills to extract relevant data from a real estate database; (3) Implement data analysis in Excel to identify the best opportunities for Watershed to increase revenue and maximize profits, while managing any new risks; (4) Create a Tableau dashboard to show Watershed executives the results of a sensitivity analysis; and (5) Articulate a significant and innovative business process change for Watershed based on your data analysis, that you will recommend to company executives. \n\nAirbnb, our Capstone’s official Sponsor, provided input on the project design. The top 10 Capstone completers each year will have the opportunity to present their work directly to senior data scientists at Airbnb live for feedback and discussion.\n\n\"Note: Only learners who have passed the four previous courses in the specialization are eligible to take the Capstone.\"\n\nSHOW ALL ABOUT INCREASING REAL ESTATE MANAGEMENT PROFITS: HARNESSING DATA ANALYTICS\nSHOW ALL"
    },
    "/specializations/everyday-excel",
    {
       "Url":"/learn/everyday-excel-part-1?specialization=everyday-excel",
       "name":"Everyday Excel, Part 1",
       "Rating":"Everyday Excel, Part 1\n4.7\nstars\n1,905 ratings\n•\n669 reviews\n\n\"Everyday Excel, Part 1\" is aimed at learners who are seeking to learn Excel from the ground up.  No experience with Excel is necessary.  While this course is meant for beginners of Excel, advanced users will undoubtedly pick up new skills and tools.\n\nThis course is the first part of a three-part series and Specialization that focuses on teaching introductory through very advanced techniques and tools in Excel.  In this course (Part 1), you will: 1) learn how to effectively navigate around the Excel environment; 2) edit and format Excel worksheets; 3) implement basic to advanced Excel functions (including financial, logical, and text functions); 4) learn how to manage data sets (filter, remove duplicates, consolidate data, sort data, and validate data); and 5) learn how to effectively visualize data through scatterplots, column charts, and pie charts.\n\nNew to Excel?  That is entirely fine!  This course is meant to be fun, thought-provoking, and appeal to a wide audience.  No prior knowledge in programming nor advanced math skills are necessary.  The course is organized into 5 Weeks (modules). \n To pass each module, you'll need to pass a mastery quiz and complete a problem solving assignment.  This course is unique in that the weekly assignments are completed in-application (i.e., on your own computer in Excel), providing you with valuable hands-on training.\n\nSHOW ALL ABOUT EVERYDAY EXCEL, PART 1\nSHOW ALL"
    },
    {
       "Url":"/learn/everyday-excel-part-2?specialization=everyday-excel",
       "name":"Everyday Excel, Part 2",
       "Rating":"Everyday Excel, Part 2\n4.8\nstars\n216 ratings\n•\n80 reviews\n\n\"Everyday Excel, Part 2\" is a continuation of the popular \"Everyday Excel, Part 1\".  Building on concepts learned in the first course, you will continue to expand your knowledge of applications in Excel.  This course is aimed at intermediate users, but even advanced users will pick up new skills and tools in Excel.  By the end of this course, you will have the skills and tools to take on the project-based \"Everyday Excel, Part 3 (Projects)\".\n\nThis course is the second part of a three-part series and Specialization that focuses on teaching introductory through very advanced techniques and tools in Excel.  In this course (Part 2), you will: 1) learn advanced data management techniques; 2) learn how to implement financial calculations in Excel; 3) use advanced tools in Excel (Data Tables, Goal Seek, and Solver) to perform and solve \"what-if\" analyses; 4) learn how to create mathematical predictive regression models using the Regression tool in Excel.\n\nThis course is meant to be fun and thought-provoking.  I hope for you to at least several times in the course say to yourself, \"Wow, I hadn't thought of that before!\"  Given the wide range in experience and abilities of learners, the goal of the course is to appeal to a wide audience.  The course is organized into 5 Weeks (modules). \n\nTo pass each module, you'll need to pass a mastery quiz and complete a problem solving assignment.  This course is unique in that the weekly assignments are completed in-application (i.e., on your own computer in Excel), providing you with valuable hands-on training.\n\nSHOW ALL ABOUT EVERYDAY EXCEL, PART 2\nSHOW ALL"
    },
    {
       "Url":"/learn/everyday-excel-projects?specialization=everyday-excel",
       "name":"Everyday Excel, Part 3 (Projects)",
       "Rating":"Everyday Excel, Part 3 (Projects)\n5.0\nstars\n28 ratings\n•\n20 reviews\n\n\"Everyday Excel, Part 3 (Projects)\" is a continuation of \"Everyday Excel, Parts 1 and 2\".  It is a capstone, projects-based course in which you will apply what you've learned previously to more complex, somewhat open-ended projects (open-ended with respect to the fact that they can be solved in multiple ways).\n\nEach learner must complete 3\"warm-up\" projects (chosen from 3), 3 intermediate projects (chosen from 6), and 3 main (more difficult) projects (chosen from 5).  The projects have been created to span a wide range of interests and topic areas and are anticipated to appeal to diverse learner backgrounds.\n\nIt is hoped that this project-based courses will dramatically reinforce the application of Excel tools, techniques, and functions to real-world projects.\n\nSHOW ALL ABOUT EVERYDAY EXCEL, PART 3 (PROJECTS)\nSHOW ALL"
    },
    "/specializations/anatomy",
    {
       "Url":"/learn/anatomy403-1x?specialization=anatomy",
       "name":"Anatomy: Musculoskeletal and Integumentary Systems",
       "Rating":"Anatomy: Musculoskeletal and Integumentary Systems\n4.8\nstars\n1,649 ratings\n•\n382 reviews\n\nIn this anatomy course, part of the Anatomy Specialization, you will learn how the components of the integumentary system help protect our body (epidermis, dermis, hair, nails, and glands), and how the musculoskeletal system (bones, joints, and skeletal muscles) protects and allows the body to move.\n\nYou will engage with fascinating videos, lectures, and anatomical visual materials (illustrations and cadaveric images) to learn about these properties and functions.\n\nSHOW ALL ABOUT ANATOMY: MUSCULOSKELETAL AND INTEGUMENTARY SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/anatomy403-2x?specialization=anatomy",
       "name":"Anatomy: Cardiovascular, Respiratory and Urinary Systems",
       "Rating":"Anatomy: Cardiovascular, Respiratory and Urinary Systems\n4.8\nstars\n780 ratings\n•\n143 reviews\n\nIn this anatomy course, part of the Anatomy Specialization, you will explore the interactive relationships of the cardiovascular, respiratory and urinary systems, and the roles they play in your body.\n\nThis course is a primer for the cardiovascular, respiratory, and urinary systems in which students learn the pertinent details of the structures and functions through a combination of lectures, videos, labeling activities and quizzes.\n\nSHOW ALL ABOUT ANATOMY: CARDIOVASCULAR, RESPIRATORY AND URINARY SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/anatomy403-3x?specialization=anatomy",
       "name":"Anatomy: Human Neuroanatomy",
       "Rating":"Anatomy: Human Neuroanatomy\n4.9\nstars\n619 ratings\n•\n150 reviews\n\nIn this anatomy course, part of the Anatomy Specialization, you will be introduced to the central and peripheral nervous systems. You will learn about basic neuroanatomy, sensory pathways, motor pathways and the autonomic nervous system.\n\nThe course includes illustrated lecture videos and quizzes to help you expand and test your knowledge of the nervous system.\n\nBy the end of this course, you will have a better understanding of how the entire body influences, and is influenced, by the nervous system.\n\nSHOW ALL ABOUT ANATOMY: HUMAN NEUROANATOMY\nSHOW ALL"
    },
    {
       "Url":"/learn/anatomy403-4x?specialization=anatomy",
       "name":"Anatomy: Gastrointestinal, Reproductive and Endocrine Systems",
       "Rating":"Anatomy: Gastrointestinal, Reproductive and Endocrine Systems\n4.9\nstars\n449 ratings\n•\n70 reviews\n\nIn this anatomy course, part of the Anatomy Specialization, you’ll learn about the various digestive, endocrine, and reproductive organs, their functions, and pathways of nerves and blood vessels serving these organs. Clinical correlations and vignettes will be used to highlight the importance of these anatomical structures and their relationships. Images and videos from cadaveric and artistic materials will be used to illustrate these concepts.\n\nSHOW ALL ABOUT ANATOMY: GASTROINTESTINAL, REPRODUCTIVE AND ENDOCRINE SYSTEMS\nSHOW ALL"
    },
    "/specializations/business-statistics-analysis",
    {
       "Url":"/learn/excel-data-analysis?specialization=business-statistics-analysis",
       "name":"Introduction to Data Analysis Using Excel",
       "Rating":"Introduction to Data Analysis Using Excel\n4.7\nstars\n8,812 ratings\n•\n2,017 reviews\n\nThe use of Excel is widespread in the industry. It is a very powerful data analysis tool and almost all big and small businesses use Excel in their day to day functioning. This is an introductory course in the use of Excel and is designed to give you a working knowledge of Excel with the aim of getting to use it for more advance topics in Business Statistics later. The course is designed keeping in mind two kinds of learners -  those who have very little functional knowledge of Excel and those who use Excel regularly but at a peripheral level and wish to enhance their skills. The course takes you from basic operations such as reading data into excel using various data formats, organizing and manipulating data, to some of the more advanced functionality of Excel. All along, Excel functionality is introduced using easy to understand examples which are demonstrated in a way that learners can become comfortable in understanding and applying them.\n\nTo successfully complete course assignments, students must have access to a Windows version of Microsoft Excel 2010 or later. \n________________________________________\nWEEK 1\nModule 1: Introduction to Spreadsheets\nIn this module, you will be introduced to the use of Excel spreadsheets and various basic data functions of Excel.\n\nTopics covered include:\n•\tReading data into Excel using various formats\n•\tBasic functions in Excel, arithmetic as well as various logical functions\n•\tFormatting rows and columns\n•\tUsing formulas in Excel and their copy and paste using absolute and relative referencing\n________________________________________\nWEEK 2\nModule 2: Spreadsheet Functions to Organize Data\nThis module introduces various Excel functions to organize and query data. Learners are introduced to the IF, nested IF, VLOOKUP and the HLOOKUP functions of Excel. \n\nTopics covered include:\n•\tIF and the nested IF functions\n•\tVLOOKUP and HLOOKUP\n•\tThe RANDBETWEEN function\n________________________________________\nWEEK 3\nModule 3: Introduction to Filtering, Pivot Tables, and Charts\nThis module introduces various data filtering capabilities of Excel. You’ll learn how to set filters in data to selectively access data. A very powerful data summarizing tool, the Pivot Table, is also explained and we begin to introduce the charting feature of Excel.\n\nTopics covered include:\n•\tVLOOKUP across worksheets\n•\tData filtering in Excel\n•\tUse of Pivot tables with categorical as well as numerical data\n•\tIntroduction to the charting capability of Excel\n________________________________________\nWEEK 4\nModule 4: Advanced Graphing and Charting\nThis module explores various advanced graphing and charting techniques available in Excel. Starting with various line, bar and pie charts we introduce pivot charts, scatter plots and histograms. You will get to understand these various charts and get to build them on your own.\n\nTopics covered include\n•\tLine, Bar and Pie charts\n•\tPivot charts\n•\tScatter plots\n•\tHistograms\n\nSHOW ALL ABOUT INTRODUCTION TO DATA ANALYSIS USING EXCEL\nSHOW ALL"
    },
    {
       "Url":"/learn/descriptive-statistics-statistical-distributions-business-application?specialization=business-statistics-analysis",
       "name":"Basic Data Descriptors, Statistical Distributions, and Application to Business Decisions",
       "Rating":"Basic Data Descriptors, Statistical Distributions, and Application to Business Decisions\n4.7\nstars\n2,084 ratings\n•\n348 reviews\n\nThe ability to understand and apply Business Statistics is becoming increasingly important in the industry. A good understanding of Business Statistics is a requirement to make correct and relevant interpretations of data. Lack of knowledge could lead to erroneous decisions which could potentially have negative consequences for a firm. This course is designed to introduce you to Business Statistics. We begin with the notion of descriptive statistics, which is summarizing data using a few numbers. Different categories of descriptive measures are introduced and discussed along with the Excel functions to calculate them. The notion of probability or uncertainty is introduced along with the concept of a sample and population data using relevant business examples. This leads us to various statistical distributions along with their Excel functions which are then used to model or approximate business processes. You get to apply these descriptive measures of data and various statistical distributions using easy-to-follow Excel based examples which are demonstrated throughout the course.\n\nTo successfully complete course assignments, students must have access to Microsoft Excel. \n________________________________________\nWEEK 1\nModule 1: Basic Data Descriptors\nIn this module you will get to understand, calculate and interpret various descriptive or summary measures of data. These descriptive measures summarize and present data using a few numbers. Appropriate Excel functions to do these calculations are introduced and demonstrated.\n\nTopics covered include:\n•\tCategories of descriptive data\n•\tMeasures of central tendency, the mean, median, mode, and their interpretations and calculations\n•\tMeasures of spread-in-data, the range, interquartile-range, standard deviation and variance\n•\tBox plots\n•\tInterpreting the standard deviation measure using the rule-of-thumb and Chebyshev’s theorem\n________________________________________\nWEEK 2\nModule 2: Descriptive Measures of Association, Probability, and Statistical Distributions\nThis module presents the covariance and correlation measures and their respective Excel functions. You get to understand the notion of causation versus correlation. The module then introduces the notion of probability and random variables and starts introducing statistical distributions.\n\nTopics covered include:\n•\tMeasures of association, the covariance and correlation measures; causation versus correlation\n•\tProbability and random variables; discrete versus continuous data\n•\tIntroduction to statistical distributions\n________________________________________\nWEEK 3\nModule 3: The Normal Distribution\nThis module introduces the Normal distribution and the Excel function to calculate probabilities and various outcomes from the distribution. \n\nTopics covered include:\n•\tProbability density function and area under the curve as a measure of probability\n•\tThe Normal distribution (bell curve), NORM.DIST, NORM.INV functions in Excel\n________________________________________\nWEEK 4\nModule 4: Working with Distributions, Normal, Binomial, Poisson\nIn this module, you'll see various applications of the Normal distribution. You will also get introduced to the Binomial and Poisson distributions. The Central Limit Theorem is introduced and explained in the context of understanding sample data versus population data and the link between the two.\n\nTopics covered include:\n•\tVarious applications of the Normal distribution\n•\tThe Binomial and Poisson distributions\n•\tSample versus population data; the Central Limit Theorem\n\nSHOW ALL ABOUT BASIC DATA DESCRIPTORS, STATISTICAL DISTRIBUTIONS, AND APPLICATION TO BUSINESS DECISIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/hypothesis-testing-confidence-intervals?specialization=business-statistics-analysis",
       "name":"Business Applications of Hypothesis Testing and Confidence Interval Estimation",
       "Rating":"Business Applications of Hypothesis Testing and Confidence Interval Estimation\n4.8\nstars\n1,150 ratings\n•\n199 reviews\n\nConfidence intervals and Hypothesis tests are very important tools in the Business Statistics toolbox. A mastery over these topics will help enhance your business decision making and allow you to understand and measure the extent of ‘risk’ or ‘uncertainty’ in various business processes. \n\nThis is the third course in the specialization \"Business Statistics and Analysis\" and the course  advances your knowledge about Business Statistics by introducing you to Confidence Intervals and Hypothesis Testing. We first conceptually understand these tools and their business application. We then introduce various calculations to constructing confidence intervals and to conduct different kinds of Hypothesis Tests. These are done by easy to understand applications.\n\nTo successfully complete course assignments, students must have access to a Windows version of Microsoft Excel 2010 or later. Please note that earlier versions of Microsoft Excel (2007 and earlier) will not be compatible to some Excel functions covered in this course. \n\n\nWEEK 1\nModule 1: Confidence Interval - Introduction\nIn this module you will get to conceptually understand what a confidence interval is and how is its constructed. We will introduce the various building blocks for the confidence interval such as the t-distribution, the t-statistic, the z-statistic and their various excel formulas. We will then use these building blocks to construct confidence intervals.\n\nTopics covered include:\n•\tIntroducing the t-distribution, the T.DIST and T.INV excel functions\n•\tConceptual understanding of a Confidence Interval\n•\tThe z-statistic and the t-statistic\n•\tConstructing a Confidence Interval using z-statistic and t-statistic \n\n\nWEEK 2\nModule 2: Confidence Interval - Applications\nThis module presents various business applications of the confidence interval including an application where we use the confidence interval to calculate an appropriate sample size. We also introduce with an application, the confidence interval for a population proportion. Towards the close of module we start introducing the concept of Hypothesis Testing.\n\nTopics covered include:\n•\tApplications of Confidence Interval\n•\tConfidence Interval for a Population Proportion\n•\tSample Size Calculation\n•\tHypothesis Testing, An Introduction\n\n\nWEEK 3\nModule 3: Hypothesis Testing\nThis module introduces Hypothesis Testing. You get to understand the logic behind hypothesis tests. The four steps for conducting a hypothesis test are introduced and you get to apply them for hypothesis tests for a population mean as well as population proportion. You will understand the difference between single tail hypothesis tests and two tail hypothesis tests and also the Type I and Type II errors associated with hypothesis tests and ways to reduce such errors. \n\nTopics covered include:\n•\tThe Logic of Hypothesis Testing\n•\tThe Four Steps for conducting a Hypothesis Test\n•\tSingle Tail and Two Tail Hypothesis Tests\n•\tGuidelines, Formulas and an Application of Hypothesis Test\n•\tHypothesis Test for a Population Proportion\n•\tType I and Type II Errors in a Hypothesis \n\n\nWEEK 4\nModule 4: Hypothesis Test - Differences in Mean\nIn this module, you'll apply Hypothesis Tests to test the difference between two different data, such hypothesis tests are called difference in means tests. We will introduce the three kinds of difference in means test and apply them to various business applications. We will also introduce the Excel dialog box to conduct such hypothesis tests.\n\nTopics covered include:\n•\tIntroducing the Difference-In-Means Hypothesis Test\n•\tApplications of the Difference-In-Means Hypothesis Test\n•\tThe Equal & Unequal Variance Assumption and the Paired t-test for difference in means.\n•\tSome more applications\n\nSHOW ALL ABOUT BUSINESS APPLICATIONS OF HYPOTHESIS TESTING AND CONFIDENCE INTERVAL ESTIMATION \nSHOW ALL"
    },
    {
       "Url":"/learn/linear-regression-business-statistics?specialization=business-statistics-analysis",
       "name":"Linear Regression for Business Statistics",
       "Rating":"Linear Regression for Business Statistics\n4.8\nstars\n1,211 ratings\n•\n200 reviews\n\nRegression Analysis is perhaps the single most important Business Statistics tool used in the industry. Regression is the engine behind a multitude of data analytics applications used for many forms of forecasting and prediction.  \n\nThis is the fourth course in the specialization, \"Business Statistics and Analysis\". The course  introduces you to the very important tool known as Linear Regression. You will learn to apply various procedures such as dummy variable regressions, transforming variables, and interaction effects. All these are introduced and explained using easy to understand examples in Microsoft Excel.\nThe focus of the course is on understanding and application, rather than detailed mathematical derivations.\nNote: This course uses the ‘Data Analysis’ tool box which is standard with the Windows version of Microsoft Excel. It is also standard with the 2016 or later Mac version of Excel. However, it is not standard with earlier versions of Excel for Mac. \n\n\nWEEK 1\nModule 1: Regression Analysis: An Introduction\nIn this module you will get introduced to the Linear Regression Model. We will build a regression model and estimate it using Excel. We will use the estimated model to infer relationships between various variables and use the model to make predictions. The module also introduces the notion of errors, residuals and R-square in a regression model.\n\nTopics covered include:\n•\tIntroducing the Linear Regression\n•\tBuilding a Regression Model and estimating it using Excel\n•\tMaking inferences using the estimated model\n•\tUsing the Regression model to make predictions\n•\tErrors, Residuals and R-square\n \n\nWEEK 2\nModule 2: Regression Analysis: Hypothesis Testing and Goodness of Fit\nThis module presents different hypothesis tests you could do using the Regression output. These tests are an important part of inference and the module introduces them using Excel based examples. The p-values are introduced along with goodness of fit measures R-square and the adjusted R-square. Towards the end of module we introduce the ‘Dummy variable regression’ which is used to incorporate categorical variables in a regression. \n\nTopics covered include:\n•\tHypothesis testing in a Linear Regression\n•\t‘Goodness of Fit’ measures (R-square, adjusted R-square)\n•\tDummy variable Regression (using Categorical variables in a Regression)\n \n\nWEEK 3\nModule 3: Regression Analysis: Dummy Variables, Multicollinearity\nThis module continues with the application of Dummy variable Regression. You get to understand the interpretation of Regression output in the presence of categorical variables. Examples are worked out to re-inforce various concepts introduced. The module also explains what is Multicollinearity and how to deal with it. \n\nTopics covered include:\n•\tDummy variable Regression (using Categorical variables in a Regression)\n•\tInterpretation of coefficients and p-values in the presence of Dummy variables\n•\tMulticollinearity in Regression Models\n \n\nWEEK 4\nModule 4: Regression Analysis: Various Extensions\nThe module extends your understanding of the Linear Regression, introducing techniques such as mean-centering of variables and building confidence bounds for predictions using the Regression model. A powerful regression extension known as ‘Interaction variables’ is introduced and explained using examples. We also study the transformation of variables in a regression and in that context introduce the log-log and the semi-log regression models. \n\nTopics covered include:\n•\tMean centering of variables in a Regression model\n•\tBuilding confidence bounds for predictions using a Regression model\n•\tInteraction effects in a Regression\n•\tTransformation of variables\n•\tThe log-log and semi-log regression models\n\nSHOW ALL ABOUT LINEAR REGRESSION FOR BUSINESS STATISTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/business-statistics-analysis-capstone?specialization=business-statistics-analysis",
       "name":"Business Statistics and Analysis Capstone",
       "Rating":"Business Statistics and Analysis Capstone\n4.7\nstars\n369 ratings\n•\n70 reviews\n\nThe Business Statistics and Analysis Capstone is an opportunity to apply various skills developed across the four courses in the specialization to a real life data. The Capstone, in collaboration with an industry partner uses publicly available ‘Housing Data’ to pose various questions typically a client would pose to a data analyst.\n\nYour job is to do the relevant statistical analysis and report your findings in response to the questions in a way that anyone can understand.\nPlease remember that this is a Capstone, and has a degree of difficulty/ambiguity higher than the previous four courses. The aim being to mimic a real life application as close as possible.\n\nSHOW ALL ABOUT BUSINESS STATISTICS AND ANALYSIS CAPSTONE\nSHOW ALL"
    },
    "/specializations/effective-business-communication",
    {
       "Url":"/learn/writing-for-business?specialization=effective-business-communication",
       "name":"Business Writing",
       "Rating":"Business Writing\n4.8\nstars\n3,471 ratings\n•\n1,058 reviews\n\nWriting well is one of the most important skills you can develop to be successful in the business world. Over seventy companies and thirty thousand students--from professional writers to new employees to non-native English speakers to seasoned executives--have used the techniques in Business Writing to power their ability to communicate and launch their ideas. This course will teach you how to apply the top ten principles of good business writing to your work, how to deploy simple tools to  dramatically improve your writing, and how to execute organization, structure, and revision to communicate more masterfully than ever. From the very first lesson, you'll be able to apply your new learning immediately to your work and improve your writing today. Your ideas are powerful. Learn how to deliver them with the clarity and impact they deserve. \n\n\"Thank you for giving me the knowledge I need in life. [Business Writing] was helpful, life changing, and has made a huge     impact in my writing.\"  -- Message from a Business Writing student\n\nThe principles you'll learn in this course enable you to become a great business writer. They also provide the foundation for moving into Graphic Design and Successful Presentation, so that you can unleash your best professional self whenever--and however--you present your ideas in the workplace.\n\nSHOW ALL ABOUT BUSINESS WRITING\nSHOW ALL"
    },
    {
       "Url":"/learn/presentation-design?specialization=effective-business-communication",
       "name":"Graphic Design",
       "Rating":"Graphic Design\n4.8\nstars\n2,582 ratings\n•\n632 reviews\n\nWelcome to Graphic Design, the second course in the Effective Communications Specialization. Over 70 different companies have provided this specialization to their employees as a resource for internal professional development. Why? Because employers know that effective visual communication is the key to attracting an audience, building a relationship, and closing the sale.\n\nThis practical course gives you the tools to create professional looking PowerPoints, reports, resumes, and presentations. Using a set of best practices refined through years of experience, you’ll: \n\n• make your work look fresh and inspired.\n• apply simple design “tricks” to begin any project with confidence and professionalism.\n• receive and respond to criticism and revise your project from good to great.\n\n\"This course is fantastic. It teaches a great amount of starter graphic design information but it is broken down into easily understood videos and quizzes. The quality was top notch and the interaction was as good as you would get in a brick and mortar school. I did not feel like I was missing anything by taking it online.\" - a recent Graphic Design student\n\nAll of the course assignments can be completed with basic presentation software such as Microsoft PowerPoint, Google Slides, or Apple Keynote. You’ll also have opportunities to explore and apply more sophisticated tools, such as Adobe Photoshop, Illustrator, and InDesign.\n\nSHOW ALL ABOUT GRAPHIC DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/presentation-skills?specialization=effective-business-communication",
       "name":"Successful Presentation",
       "Rating":"Successful Presentation\n4.7\nstars\n2,936 ratings\n•\n502 reviews\n\nFew kinds of communication can have the effect of a powerful presentation.  Even a short speech can motivate people to change long-held beliefs or to take action, and a wonderfully delivered speech can transform a normal person into a leader.\n\nIn this course, Prof. William Kuskin provides a series of pragmatic videos and exercises for successful public speaking and presentations. The course develops through four themes—mastering fear, developing a creative formula, using verbal and body language, and anticipating the room—so that you can discover your personal power as a speaker and give excellent presentations.  \n\nSuccessful presentations do not rely on perfect teeth, a deep voice, or an army of scriptwriters.  They depend largely on the same skills as successful Business Writing and Graphic Design: clarity, structure, and revision. The goal of the course, therefore, is to enable you to discover your own internal power as a speaker and express it to the world.  After this course, with some practice, you will be able to go into any situation and command the room for as long as you like.\n\nSHOW ALL ABOUT SUCCESSFUL PRESENTATION\nSHOW ALL"
    },
    {
       "Url":"/learn/effective-communication-capstone?specialization=effective-business-communication",
       "name":"Effective Communication Capstone Project",
       "Rating":"Effective Communication Capstone Project\n4.7\nstars\n85 ratings\n•\n14 reviews\n\nIn the Effective Communication Capstone learners apply the lessons of Business Writing, Graphic Design, and Successful Presentation to create a portfolio of work that represents their mastery of writing, design, and speaking and that expresses their personal brand. The portfolio includes three individual elements—a written memo, a slide deck, and a presentation—integrated around a single topic. We provide the elements for a basic capstone, but we also invite our learners to create their own project if they so choose. This self-designed \"Challenge Capstone\" allows learners to engage meaningfully in their world by choosing a project relevant to their current job or by volunteering to write, design, and speak for a social organization of their choice.\n\nBy successfully undertaking the Capstone, learners will accomplish three main goals: 1. They will hone their writing, design, and speaking skills and build a portfolio for a job search and/or professional application; 2. They will shape these skills into a unique brand identity; and, if they choose, 3. They will undertake a transformative effect in the world around them. Ultimately, the importance of Capstone portfolio is greater than the sum of its individual parts. Its true goal lies in each student’s personal transformation and expression of their best selves. We invite you to unleash your skills and we can't wait to see the results!\n\nSHOW ALL ABOUT EFFECTIVE COMMUNICATION CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/web-applications",
    {
       "Url":"/learn/web-applications-php?specialization=web-applications",
       "name":"Building Web Applications in PHP",
       "Rating":"Building Web Applications in PHP\n4.7\nstars\n3,620 ratings\n•\n814 reviews\n\nIn this course, you'll explore the basic structure of a web application, and how a web browser interacts with a web server. You'll be introduced to the request/response cycle, including GET/POST/Redirect. You'll also gain an introductory understanding of Hypertext Markup Language (HTML), as well as the basic syntax and data structures of the PHP language, variables, logic, iteration, arrays, error handling, and superglobal variables, among other elements. An introduction to Cascading Style Sheets (CSS) will allow you to style markup for webpages. Lastly, you'll gain the skills and knowledge to install and use an integrated PHP/MySQL environment like XAMPP or MAMP.\n\nSHOW ALL ABOUT BUILDING WEB APPLICATIONS IN PHP\nSHOW ALL"
    },
    {
       "Url":"/learn/intro-sql?specialization=web-applications",
       "name":"Introduction to Structured Query Language (SQL)",
       "Rating":"Introduction to Structured Query Language (SQL)\n4.8\nstars\n4,080 ratings\n•\n901 reviews\n\nIn this course, you'll walk through installation steps for installing a text editor, installing MAMP or XAMPP (or equivalent) and creating a MySql Database. You'll learn about single table queries and the basic syntax of the SQL language, as well as database design with multiple tables, foreign keys, and the JOIN operation. Lastly, you'll learn to model many-to-many relationships like those needed to represent users, roles, and courses.\n\nSHOW ALL ABOUT INTRODUCTION TO STRUCTURED QUERY LANGUAGE (SQL)\nSHOW ALL"
    },
    {
       "Url":"/learn/database-applications-php?specialization=web-applications",
       "name":"Building Database Applications in PHP",
       "Rating":"Building Database Applications in PHP\n4.9\nstars\n943 ratings\n•\n206 reviews\n\nIn this course, we'll look at the object oriented patterns available in PHP. You'll learn how to connect to a MySQL using the Portable Data Objects (PDO) library and issue SQL commands in the the PHP language. We'll also look at how PHP uses cookies and manages session data. You'll learn how PHP avoids double posting data, how flash messages are implemented, and how to use a session to log in users in web applications. We'll then build the first 'complete' application that has multiple screens to Create, Read, Update and Delete (CRUD) our data. This brings all the previous concepts together and will form the basis for all later web applications.  It is assumed that learners have already taken the Building Web Applications course in this specialization.\n\nSHOW ALL ABOUT BUILDING DATABASE APPLICATIONS IN PHP\nSHOW ALL"
    },
    {
       "Url":"/learn/javascript-jquery-json?specialization=web-applications",
       "name":"JavaScript, jQuery, and JSON",
       "Rating":"JavaScript, jQuery, and JSON\n4.6\nstars\n716 ratings\n•\n147 reviews\n\nIn this course, we'll look at the JavaScript language, and how it supports the Object-Oriented pattern, with a focus on the unique aspect of how JavaScript approaches OO. We'll explore a brief introduction to the jQuery library, which is widely used to do in-browser manipulation of the Document Object Model (DOM) and event handling. You'll also learn more about JavaScript Object Notation (JSON), which is commonly used as a syntax to exchange data between code running on the server (i.e. in PHP) and code running in the browser (JavaScript/jQuery).\n\nIt is assumed that learners have already taken the Building Web Applications and Building Database Applications in PHP courses in this specialization.\n\nSHOW ALL ABOUT JAVASCRIPT, JQUERY, AND JSON\nSHOW ALL"
    },
    "/specializations/full-stack-mobile-app-development",
    {
       "Url":"/learn/bootstrap-4?specialization=full-stack-mobile-app-development",
       "name":"Front-End Web UI Frameworks and Tools: Bootstrap 4",
       "Rating":"Front-End Web UI Frameworks and Tools: Bootstrap 4\n4.8\nstars\n7,008 ratings\n•\n2,119 reviews\n\nThis course will give you an overview of client-side web UI frameworks, in particular Bootstrap 4. You will learn about grids and responsive design, Bootstrap CSS and JavaScript components. You will learn about CSS preprocessors, Less and Sass. You will also learn the basics of Node.js and NPM and task runners like Grunt and Gulp.\n\nAt the end of this course, you will be able to a)Set up, design and style a web page using Bootstrap 4 and its components, b) Create a responsive web page design, and c) Make use of web tools to setup and manage web sites.\nThis course also includes an honors track that enables you to work on your own project developing a website using Bootstrap 4.\nStudents enrolling in this course should have prior good working knowledge of HTML, CSS and JavaScript.\n\nSHOW ALL ABOUT FRONT-END WEB UI FRAMEWORKS AND TOOLS: BOOTSTRAP 4\nSHOW ALL"
    },
    {
       "Url":"/learn/angular?specialization=full-stack-mobile-app-development",
       "name":"Front-End JavaScript Frameworks: Angular",
       "Rating":"Front-End JavaScript Frameworks: Angular\n4.7\nstars\n1,951 ratings\n•\n591 reviews\n\nThis course concentrates mainly on Javascript based front-end frameworks, and in particular the Angular framework (Currently Ver. 6.x). This course will use Typescript for developing Angular application. Typescript features will be introduced in the context of Angular as part of the exercises. You will also get an introduction to the use of Angular Material and Angular Flex-Layout for responsive UI design. You will be introduced to various aspects of Angular including components, directives and services. You will learn about data binding, Angular router and its use for developing single-page applications. You will also learn about designing both template-driven forms and reactive forms. A quick introduction to Observables, reactive programming and RxJS in the context of Angular is included. You will then learn about Angular support for client-server communication through the HTTP client and the use of REST API on the server side. A quick tour through Angular animation support and Angular testing rounds off the course. You must have either completed the previous course in the specialization on Bootstrap 4, or have a working knowledge of front end web-UI frameworks to be able to navigate this course. Also a good working knowledge of JavaScript, especially ES 5 is strongly recommended.\n\nAt the end of this course you will:\n\n- Be familiar with client-side Javascript frameworks and the Angular framework\n- Be able to implement single page applications in Angular\n- Be able to use various Angular features including directives, components and services\n- Be able to implement a functional front-end web application using Angular\n- Be able to use Angular Material and Angular Flex-Layout for designing responsive Angular applications\n- Be able to use Observables and RxJS in the context of Angular applications\n\nSHOW ALL ABOUT FRONT-END JAVASCRIPT FRAMEWORKS: ANGULAR\nSHOW ALL"
    },
    {
       "Url":"/learn/server-side-nodejs?specialization=full-stack-mobile-app-development",
       "name":"Server-side Development with NodeJS, Express and MongoDB",
       "Rating":"Server-side Development with NodeJS, Express and MongoDB\n4.7\nstars\n2,277 ratings\n•\n616 reviews\n\nThis course deals with all things server-side. We base the entire course around the NodeJS platform. We start with a brief overview of the Web protocols: HTTP and HTTPS. We examine NodeJS and NodeJS modules: Express for building web servers. On the database side, we review basic CRUD operations, NoSQL databases, in particular MongoDB and Mongoose for accessing MongoDB from NodeJS. We examine the REST concepts and building a RESTful API. We touch upon authentication and security. Finally we review backend as a service (BaaS) approaches, including mobile BaaS, both open-source and commercial BaaS services.\n\nAt the end of this course, you will be able to:\n\n- Demonstrate an understanding of server-side concepts, CRUD and REST\n- Build and configure a backend server using NodeJS framework\n- Build a RESTful API for the front-end to access backend services\n\nSHOW ALL ABOUT SERVER-SIDE DEVELOPMENT WITH NODEJS, EXPRESS AND MONGODB\nSHOW ALL"
    },
    "/specializations/investment-management",
    {
       "Url":"/learn/understanding-financial-markets?specialization=investment-management",
       "name":"Understanding Financial Markets",
       "Rating":"Understanding Financial Markets\n4.8\nstars\n4,973 ratings\n•\n1,056 reviews\n\nIn this course, you will learn what the main financial markets and their characteristics are as well as how they are linked to the economy. \n\nOur very diversified team of experts will start by teaching you how the price of stocks and bonds are computed and why they move while you will become increasingly aware of the notion of risk and why it matters when measuring an investment's performance. The focus will then move to less popular markets such as gold, emerging markets, real estate, hedge funds and private markets. These will be analyzed with an emphasis on their particular risks and return opportunities as well as how they can help in building efficient portfolios. Finally, the policies of central banks and their impact on financial markets will be presented to you along with the link between the economy and the price of financial assets.\n\nAll along these different steps, experts from UBS, our corporate partner, will show you how the concepts you just acquired are effectively applied in a leading global bank. This focus on practicality means you will not only understand what is going on in global financial markets but also start to figure out how you can use them to achieve financial goals, be it a client's or your own.\n\nCourse Director and main teaching contributor: Dr. Michel Girardin, Lecturer in Macro-Finance, University of Geneva\n\nSHOW ALL ABOUT UNDERSTANDING FINANCIAL MARKETS\nSHOW ALL"
    },
    {
       "Url":"/learn/meeting-investors-goals?specialization=investment-management",
       "name":"Meeting Investors' Goals",
       "Rating":"Meeting Investors' Goals\n4.8\nstars\n1,648 ratings\n•\n268 reviews\n\nIn this course, you will dive into the concepts of rationality and irrationality and understand how they impact our investment decisions and what the consequences can be at the market level.\n\nYou will first explore the different biases that we, as humans, are subjected to when facing investment decisions and how they may impact the outcomes of these decisions. Moreover, you will see how emotions and ethical concerns such as honesty and trust influence market participants. When they are considered as a group rather than individually, you will discover how rationality and irrationality can drive asset prices to and away from their fair value. Finally, you will be presented with different portfolio construction methodologies and investment styles that make up the landscape of today's portfolio management industry. \n\nAt key points throughout the course, you will benefit from the practical knowledge of experts from our corporate partner, UBS, in how to build and manage clients' portfolios.\n\nSHOW ALL ABOUT MEETING INVESTORS' GOALS\nSHOW ALL"
    },
    {
       "Url":"/learn/portfolio-risk-management?specialization=investment-management",
       "name":"Portfolio and Risk Management",
       "Rating":"Portfolio and Risk Management\n4.7\nstars\n2,149 ratings\n•\n356 reviews\n\nIn this course, you will gain an understanding of the theory underlying optimal portfolio construction, the different ways portfolios are actually built in practice and how to measure and manage the risk of such portfolios.\n\nYou will start by studying how imperfect correlation between assets leads to diversified and optimal portfolios as well as the consequences in terms of asset pricing. Then, you will learn how to shape an investor's profile and build an adequate portfolio by combining strategic and tactical asset allocations. Finally, you will have a more in-depth look at risk: its different facets and the appropriate tools and techniques to measure it, manage it and hedge it.\n\nKey speakers from UBS, our corporate partner, will regularly add a practical perspective on these different topics as you progress through the course.\n\nSHOW ALL ABOUT PORTFOLIO AND RISK MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/investment-returns-long-run?specialization=investment-management",
       "name":"Securing Investment Returns in the Long Run",
       "Rating":"Securing Investment Returns in the Long Run\n4.8\nstars\n1,077 ratings\n•\n129 reviews\n\nIn this course, you will learn about the famous dichotomy between active and passive investing, how to appropriately measure and analyze investment performance and what the future trends in the investment management industry are.\n\nYou will first learn about absolute and relative performance, risk-adjusted returns and how to decompose investment performance. The focus will then shift to the two main categories of investment vehicles, active and passive funds, and what they entail in terms of expected performance. Finally, you will explore the worlds of sustainable finance, neurofinance and fintech, three areas of research that will shape the future of the investment management industry.\n\nYou will also benefit from the insights of experts from UBS, our corporate partner, on the practical implementation of the various concepts we will develop in this course.\n\nSHOW ALL ABOUT SECURING INVESTMENT RETURNS IN THE LONG RUN\nSHOW ALL"
    },
    {
       "Url":"/learn/wealth-planning-capstone?specialization=investment-management",
       "name":"Planning your Client's Wealth over a 5-year Horizon",
       "Rating":"Planning your Client's Wealth over a 5-year Horizon\n4.7\nstars\n351 ratings\n•\n74 reviews\n\nIn this Capstone project, you will have to choose between three different characters (each with a unique set of financial constraints and objectives) and design an appropriate wealth plan for them over the next 5 years.\n\nYou will have to use the knowledge you gained in each of the four preceding courses to reach that objective. Indeed, you will need to know which assets to consider and how to manage them depending on changes in the economic outlook (Course 1), how to evaluate and deal with your character's emotional biases in order to suggest them a wealth strategy they will be able to follow (Course 2), how to build an optimal portfolio and manage its risk once the strategy has been designed (Course 3) and how to adequately measure the performance of your plan while taking advantage of investment vehicles and future trends in the investment management industry to further your character's goals (Course 4).\n\nThis Capstone project was designed in collaboration with UBS, our corporate partner, who benefits from years of experience in guiding clients with their wealth planning.\n\nSHOW ALL ABOUT PLANNING YOUR CLIENT'S WEALTH OVER A 5-YEAR HORIZON\nSHOW ALL"
    },
    "/specializations/aml",
    {
       "Url":"/learn/intro-to-deep-learning?specialization=aml",
       "name":"Introduction to Deep Learning",
       "Rating":"Introduction to Deep Learning\n4.5\nstars\n1,806 ratings\n•\n421 reviews\n\nThe goal of this course is to give learners basic understanding of modern neural networks and their applications in computer vision and natural language understanding. The course starts with a recap of linear models and discussion of stochastic optimization methods that are crucial for training deep neural networks. Learners will study all popular building blocks of neural networks including fully connected layers, convolutional and recurrent layers. \n\nLearners will use these building blocks to define complex modern architectures in TensorFlow and Keras frameworks. In the course project learner will implement deep neural network for the task of image captioning which solves the problem of giving a text description for an input image.\n\nThe prerequisites for this course are: \n1) Basic knowledge of Python.\n2) Basic linear algebra and probability.\n\nPlease note that this is an advanced course and we assume basic knowledge of machine learning. You should understand:\n1) Linear regression: mean squared error, analytical solution.\n2) Logistic regression: model, cross-entropy loss, class probability estimation.\n3) Gradient descent for linear models. Derivatives of MSE and cross-entropy loss functions.\n4) The problem of overfitting.\n5) Regularization for linear models.\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT INTRODUCTION TO DEEP LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/competitive-data-science?specialization=aml",
       "name":"How to Win a Data Science Competition: Learn from Top Kagglers",
       "Rating":"How to Win a Data Science Competition: Learn from Top Kagglers\n4.7\nstars\n1,100 ratings\n•\n270 reviews\n\nIf you want to break into competitive data science, then this course is for you! Participating in predictive modelling competitions can help you gain practical experience, improve and harness your data modelling skills in various domains such as credit, insurance, marketing, natural language processing, sales’ forecasting and computer vision to name a few. At the same time you get to do it in a competitive context against thousands of participants where each one tries to build the most predictive algorithm. Pushing each other to the limit can result in better performance and smaller prediction errors. Being able to achieve high ranks consistently can help you accelerate your career in data science.\n\nIn this course, you will learn to analyse and solve competitively such predictive modelling tasks. \n\nWhen you finish this class, you will:\n\n- Understand how to solve predictive modelling competitions efficiently and learn which of the skills obtained can be applicable to real-world tasks.\n- Learn how to preprocess the data and generate new features from various sources such as text and images.\n- Be taught advanced feature engineering techniques like generating mean-encodings, using aggregated statistical measures or finding nearest neighbors as a means to improve your predictions.\n- Be able to form reliable cross validation methodologies that help you benchmark your solutions and avoid overfitting or underfitting when tested with unobserved (test) data. \n- Gain experience of analysing and interpreting the data. You will become aware of inconsistencies, high noise levels, errors and other data-related issues such as leakages and you will learn how to overcome them. \n- Acquire knowledge of different algorithms and learn how to efficiently tune their hyperparameters and achieve top performance. \n- Master the art of combining different machine learning models and learn how to ensemble. \n- Get exposed to past (winning) solutions and codes and learn how to read them.\n\nDisclaimer : This is not a machine learning course in the general sense. This course will teach you how to get high-rank solutions against thousands of competitors with focus on practical usage of machine learning methods rather than the theoretical underpinnings behind them.\n\nPrerequisites: \n- Python: work with DataFrames in pandas, plot figures in matplotlib, import and train models from scikit-learn, XGBoost, LightGBM.\n- Machine Learning: basic understanding of linear models, K-NN, random forest, gradient boosting and neural networks.\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT HOW TO WIN A DATA SCIENCE COMPETITION: LEARN FROM TOP KAGGLERS\nSHOW ALL"
    },
    {
       "Url":"/learn/bayesian-methods-in-machine-learning?specialization=aml",
       "name":"Bayesian Methods for Machine Learning",
       "Rating":"Bayesian Methods for Machine Learning\n4.5\nstars\n673 ratings\n•\n197 reviews\n\nPeople apply Bayesian methods in many areas: from game development to drug discovery. They give superpowers to many machine learning algorithms: handling missing data, extracting much more information from small datasets. Bayesian methods also allow us to estimate uncertainty in predictions, which is a desirable feature for fields like medicine. \n\nWhen applied to deep learning, Bayesian methods allow you to compress your models a hundred folds, and automatically tune hyperparameters, saving your time and money.\nIn six weeks we will discuss the basics of Bayesian methods: from how to define a probabilistic model to how to make predictions from it. We will see how one can automate this workflow and how to speed it up using some advanced techniques. \nWe will also see applications of Bayesian methods to deep learning and how to generate new images with it. We will see how new drugs that cure severe diseases be found with Bayesian methods.\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT BAYESIAN METHODS FOR MACHINE LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/practical-rl?specialization=aml",
       "name":"Practical Reinforcement Learning",
       "Rating":"Practical Reinforcement Learning\n4.2\nstars\n437 ratings\n•\n116 reviews\n\nWelcome to the Reinforcement Learning course. \n\nHere you will find out about:\n\n- foundations of RL methods: value/policy iteration, q-learning, policy gradient, etc.\n--- with math & batteries included\n\n- using deep neural networks for RL tasks\n--- also known as \"the hype train\"\n\n- state of the art RL algorithms\n--- and how to apply duct tape to them for practical problems.\n\n- and, of course, teaching your neural network to play games\n--- because that's what everyone thinks RL is about. We'll also use it for seq2seq and contextual bandits.\n\nJump in. It's gonna be fun!\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT PRACTICAL REINFORCEMENT LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/deep-learning-in-computer-vision?specialization=aml",
       "name":"Deep Learning in Computer Vision",
       "Rating":"Deep Learning in Computer Vision\n3.8\nstars\n313 ratings\n•\n78 reviews\n\nDeep learning added a huge boost to the already rapidly developing field of computer vision. With deep learning, a lot of new applications of computer vision techniques have been introduced and are now becoming parts of our everyday lives. These include face recognition and indexing, photo stylization or machine vision in self-driving cars. \n\nThe goal of this course is to introduce students to computer vision, starting from basics and then turning to more modern deep learning models. We will cover both image and video recognition, including image classification and annotation, object recognition and image search, various object detection techniques, motion estimation, object tracking in video, human action recognition, and finally image stylization, editing and new image generation. In course project, students will learn how to build face recognition and manipulation system to understand the internal mechanics of this technology, probably the most renown and often demonstrated in movies and TV-shows example of computer vision and AI.\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT DEEP LEARNING IN COMPUTER VISION\nSHOW ALL"
    },
    {
       "Url":"/learn/language-processing?specialization=aml",
       "name":"Natural Language Processing",
       "Rating":"Natural Language Processing\n4.4\nstars\n776 ratings\n•\n198 reviews\n\nThis course covers a wide range of tasks in Natural Language Processing from basic to advanced: sentiment analysis, summarization, dialogue state tracking, to name a few. Upon completing, you will be able to recognize NLP tasks in your day-to-day work, propose approaches, and judge what techniques are likely to work well.  The final project is devoted to one of the most hot topics in today’s NLP. You will build your own conversational chat-bot that will assist with search on StackOverflow website. The project will be based on practical assignments of the course, that will give you hands-on experience with such tasks as text classification, named entities recognition, and duplicates detection. \n\nThroughout the lectures, we will aim at finding a balance between traditional and deep learning techniques in NLP and cover them in parallel. For example, we will discuss word alignment models in machine translation and see how similar it is to attention mechanism in encoder-decoder neural networks. Core techniques are not treated as black boxes. On the contrary, you will get in-depth understanding of what’s happening inside. To succeed in that, we expect your familiarity with the basics of linear algebra and probability theory, machine learning setup, and deep neural networks. Some materials are based on one-month-old papers and introduce you to the very state-of-the-art in NLP research.\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT NATURAL LANGUAGE PROCESSING\nSHOW ALL"
    },
    {
       "Url":"/learn/hadron-collider-machine-learning?specialization=aml",
       "name":"Addressing Large Hadron Collider Challenges by Machine Learning",
       "Rating":"Addressing Large Hadron Collider Challenges by Machine Learning\n4.5\nstars\n101 ratings\n•\n16 reviews\n\nThe Large Hadron Collider (LHC) is the largest data generation machine for the time being. It doesn’t produce the big data, the data is gigantic. Just one of the four experiments generates thousands gigabytes per second. The intensity of data flow is only going to be increased over the time. So the data processing techniques have to be quite sophisticated and unique. In this course we’ll introduce students into the main concepts of the Physics behind those data flow so the main puzzles of the Universe Physicists are seeking answers for will be much more transparent. Of course we will scrutinize the major stages of the data processing pipelines, and focus on the role of the Machine Learning techniques for such tasks as track pattern recognition, particle identification, online real-time processing (triggers) and search for very rare decays. The assignments of this course will give you opportunity to apply your skills in the search for the New Physics using advanced data analysis techniques. Upon the completion of the course you will understand both the principles of the Experimental Physics and Machine Learning much better.\n\nDo you have technical problems? Write to us: coursera@hse.ru\n\nSHOW ALL ABOUT ADDRESSING LARGE HADRON COLLIDER CHALLENGES BY MACHINE LEARNING\nSHOW ALL"
    },
    "/specializations/big-data",
    {
       "Url":"/learn/big-data-introduction?specialization=big-data",
       "name":"Introduction to Big Data",
       "Rating":"Introduction to Big Data\n4.6\nstars\n9,931 ratings\n•\n2,345 reviews\n\nInterested in increasing your knowledge of the Big Data landscape?  This course is for those new to data science and interested in understanding why the Big Data Era has come to be.  It is for those who want to become conversant with the terminology and the core concepts behind big data problems, applications, and systems.  It is for those who want to start thinking about how Big Data might be useful in their business or career.  It provides an introduction to one of the most common frameworks, Hadoop, that has made big data analysis easier and more accessible -- increasing the potential for data to transform our world!\n\nAt the end of this course, you will be able to:\n\n* Describe the Big Data landscape including examples of real world big data problems including the three key sources of Big Data: people, organizations, and sensors. \n\n* Explain the V’s of Big Data (volume, velocity, variety, veracity, valence, and value) and why each impacts data collection, monitoring, storage, analysis and reporting.\n\n* Get value out of Big Data by using a 5-step process to structure your analysis. \n\n* Identify what are and what are not big data problems and be able to recast big data problems as data science questions.\n\n* Provide an explanation of the architectural components and programming models used for scalable big data analysis.\n\n* Summarize the features and value of core Hadoop stack components including the YARN resource and job management system, the HDFS file system and the MapReduce programming model.\n\n* Install and run a program using Hadoop!\n\nThis course is for those new to data science.  No prior programming experience is needed, although the ability to install applications and utilize a virtual machine is necessary to complete the hands-on assignments.  \n\nHardware Requirements:\n(A) Quad Core Processor (VT-x or AMD-V support recommended), 64-bit; (B) 8 GB RAM; (C) 20 GB disk free. How to find your hardware information: (Windows): Open System by clicking the Start button, right-clicking Computer, and then clicking Properties; (Mac): Open Overview by clicking on the Apple menu and clicking “About This Mac.” Most computers with 8 GB RAM purchased in the last 3 years will meet the minimum requirements.You will need a high speed internet connection because you will be downloading files up to 4 Gb in size.  \n\nSoftware Requirements:\nThis course relies on several open-source software tools, including Apache Hadoop. All required software can be downloaded and installed free of charge. Software requirements include: Windows 7+, Mac OS X 10.10+, Ubuntu 14.04+ or CentOS 6+ VirtualBox 5+.\n\nSHOW ALL ABOUT INTRODUCTION TO BIG DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/big-data-management?specialization=big-data",
       "name":"Big Data Modeling and Management Systems",
       "Rating":"Big Data Modeling and Management Systems\n4.4\nstars\n2,876 ratings\n•\n485 reviews\n\nOnce you’ve identified a big data issue to analyze, how do you collect, store and organize your data using Big Data solutions?  In this course, you will experience various data genres and management tools appropriate for each.  You will be able to describe the reasons behind the evolving plethora of new big data platforms from the perspective of big data management systems and analytical tools.  Through guided hands-on tutorials, you will become familiar with techniques using real-time and semi-structured data examples.  Systems and tools discussed include: AsterixDB, HP Vertica, Impala, Neo4j, Redis, SparkSQL. This course provides techniques to extract value from existing untapped data sources and discovering new data sources.\n\nAt the end of this course, you will be able to:\n * Recognize different data elements in your own work and in everyday life problems\n * Explain why your team needs to design a Big Data Infrastructure Plan and Information System Design\n * Identify the frequent data operations required for various types of data\n * Select a data model to suit the characteristics of your data \n * Apply techniques to handle streaming data\n * Differentiate between a traditional Database Management System and a Big Data Management System\n * Appreciate why there are so many data management systems\n * Design a big data information system for an online game company\n\nThis course is for those new to data science.  Completion of Intro to Big Data is recommended.  No prior programming experience is needed, although the ability to install applications and utilize a virtual machine is necessary to complete the hands-on assignments.  Refer to the specialization technical requirements for complete hardware and software specifications.\n\nHardware Requirements: \n(A) Quad Core Processor (VT-x or AMD-V support recommended), 64-bit; (B) 8 GB RAM; (C) 20 GB disk free. How to find your hardware information: (Windows): Open System by clicking the Start button, right-clicking Computer, and then clicking Properties; (Mac): Open Overview by clicking on the Apple menu and clicking “About This Mac.” Most computers with 8 GB RAM purchased in the last 3 years will meet the minimum requirements.You will need a high speed internet connection because you will be downloading files up to 4 Gb in size. \n\nSoftware Requirements: \nThis course relies on several open-source software tools, including Apache Hadoop. All required software can be downloaded and installed free of charge (except for data charges from your internet provider). Software requirements include: Windows 7+, Mac OS X 10.10+, Ubuntu 14.04+ or CentOS 6+ VirtualBox 5+.\n\nSHOW ALL ABOUT BIG DATA MODELING AND MANAGEMENT SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/big-data-integration-processing?specialization=big-data",
       "name":"Big Data Integration and Processing",
       "Rating":"Big Data Integration and Processing\n4.4\nstars\n2,280 ratings\n•\n490 reviews\n\nAt the end of the course, you will be able to:\n\n*Retrieve data from example database and big data management systems \n*Describe the connections between data management operations and the big data processing patterns needed to utilize them in large-scale analytical applications\n*Identify when a big data problem needs data integration\n*Execute simple big data integration and processing on Hadoop and Spark platforms\n\nThis course is for those new to data science.  Completion of Intro to Big Data is recommended.  No prior programming experience is needed, although the ability to install applications and utilize a virtual machine is necessary to complete the hands-on assignments.  Refer to the specialization technical requirements for complete hardware and software specifications.\n\nHardware Requirements: \n(A) Quad Core Processor (VT-x or AMD-V support recommended), 64-bit; (B) 8 GB RAM; (C) 20 GB disk free. How to find your hardware information: (Windows): Open System by clicking the Start button, right-clicking Computer, and then clicking Properties; (Mac): Open Overview by clicking on the Apple menu and clicking “About This Mac.” Most computers with 8 GB RAM purchased in the last 3 years will meet the minimum requirements.You will need a high speed internet connection because you will be downloading files up to 4 Gb in size. \n\nSoftware Requirements: \nThis course relies on several open-source software tools, including Apache Hadoop. All required software can be downloaded and installed free of charge (except for data charges from your internet provider). Software requirements include: Windows 7+, Mac OS X 10.10+, Ubuntu 14.04+ or CentOS 6+ VirtualBox 5+.\n\nSHOW ALL ABOUT BIG DATA INTEGRATION AND PROCESSING\nSHOW ALL"
    },
    {
       "Url":"/learn/big-data-machine-learning?specialization=big-data",
       "name":"Machine Learning With Big Data",
       "Rating":"Machine Learning With Big Data\n4.6\nstars\n2,345 ratings\n•\n497 reviews\n\nWant to make sense of the volumes of data you have collected?  Need to incorporate data-driven decisions into your process?  This course provides an overview of machine learning techniques to explore, analyze, and leverage data.  You will be introduced to tools and algorithms you can use to create machine learning models that learn from data, and to scale those models up to big data problems.\n\nAt the end of the course, you will be able to:\n•\tDesign an approach to leverage data using the steps in the machine learning process.\n•\tApply machine learning techniques to explore and prepare data for modeling.\n•\tIdentify the type of machine learning problem in order to apply the appropriate set of techniques.\n•\tConstruct models that learn from data using widely available open source tools.\n•\tAnalyze big data problems using scalable machine learning algorithms on Spark.\n\nSoftware Requirements: \nCloudera VM, KNIME, Spark\n\nSHOW ALL ABOUT MACHINE LEARNING WITH BIG DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/big-data-graph-analytics?specialization=big-data",
       "name":"Graph Analytics for Big Data",
       "Rating":"Graph Analytics for Big Data\n4.3\nstars\n1,177 ratings\n•\n224 reviews\n\nWant to understand your data network structure and how it changes under different conditions? Curious to know how to identify closely interacting clusters within a graph? Have you heard of the fast-growing area of graph analytics and want to learn more? This course gives you a broad overview of the field of graph analytics so you can learn new ways to model, store, retrieve and analyze graph-structured data.\n\nAfter completing this course, you will be able to model a problem into a graph database and perform analytical tasks over the graph in a scalable manner.  Better yet, you will be able to apply these techniques to understand the significance of your data sets for your own projects.\n\nSHOW ALL ABOUT GRAPH ANALYTICS FOR BIG DATA\nSHOW ALL"
    },
    {
       "Url":"/learn/big-data-project?specialization=big-data",
       "name":"Big Data - Capstone Project",
       "Rating":"Big Data - Capstone Project\n4.4\nstars\n379 ratings\n•\n97 reviews\n\nWelcome to the Capstone Project for Big Data! In this culminating project, you will build a big data ecosystem using tools and methods form the earlier courses in this specialization. You will analyze a data set simulating big data generated from a large number of users who are playing our imaginary game \"Catch the Pink Flamingo\". During the five week Capstone Project, you will walk through the typical big data science steps for acquiring, exploring, preparing, analyzing, and reporting. In the first two weeks, we will introduce you to the data set and guide you through some exploratory analysis using tools such as Splunk and Open Office. Then we will move into more challenging big data problems requiring the more advanced tools you have learned including KNIME, Spark's MLLib and Gephi. Finally, during the fifth and final week, we will show you how to bring it all together to create engaging and compelling reports and slide presentations. As a result of our collaboration with Splunk, a software company focus on analyzing machine-generated big data, learners with the top projects will be eligible to present to Splunk and meet Splunk recruiters and engineering leadership.\n\nSHOW ALL ABOUT BIG DATA - CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/engineering-project-management",
    {
       "Url":"/learn/initiating-planning?specialization=engineering-project-management",
       "name":"Engineering Project Management: Initiating and Planning",
       "Rating":"Engineering Project Management: Initiating and Planning\n4.8\nstars\n2,670 ratings\n•\n628 reviews\n\nThe goal of the course is to give you the tools to initiate a project plan, manage both stakeholders and relationships, organize their team, develop a project charter, and build a business case for a project. \n\nBy the end of this course you will be able to:\n \n-  Perform a project assessment using information from previous projects and lessons learned\n-  Identify key deliverables based on business requirements while managing customer expectations\n-  Perform a stakeholder analysis and create a management plan\n-  Analyze and develop a project organization\n-  Create a project charter\n-  Explain the business case for a project and calculate Net Present Value\n-  Inform stakeholders of the charter and ensure all parties know the deliverables and expectations\n \nAs part of the course, you will prepare organization charts, create a Stakeholder Register, and write a Project Charter based on an engineering project in a provided Case Study.  The Stakeholder Register will outline the key parties to the project, their concerns and how you will manage their expectations.  Your Project Charter will provide the key guidance your team needs to understand the scope, requirements and purpose for the project.\n \nAll of this will position you for initiating and planning your first project and/or understanding how you can maximize your contributions on your next project team.\n\nRice Center for Engineering Leadership is a Registered Education Provider through the Project Management Institute (PMI)®. Learners who complete this course on the Certificate track will be awarded 12 hours of Profession Development Units. These are recognized by PMI for continuing education or can be applied toward the 35 hours of education required for the Project Management Professional (PMP)® certification. \n\nPMI and PMP are registered marks of the Project Management Institute, Inc.\n\nSHOW ALL ABOUT ENGINEERING PROJECT MANAGEMENT: INITIATING AND PLANNING\nSHOW ALL"
    },
    {
       "Url":"/learn/scope-time-management-cost?specialization=engineering-project-management",
       "name":"Engineering Project Management: Scope, Time and Cost Management",
       "Rating":"Engineering Project Management: Scope, Time and Cost Management\n4.8\nstars\n1,055 ratings\n•\n215 reviews\n\nScope, time, and cost management are at the heart of successful project management. This course will give you the tools to develop a project scope, schedule and budget and then status them to predict project performance. Throughout the course, you will learn about change management and techniques to implement it. \n\nBy the end of this course  you will be able to:\n\n•\tCreate a requirements document\n•\tCreate a Project Scope Statement\n•\tIdentify ways to control the scope of the project\n•\tDecompose the work and develop work packages\n•\tCreate a Work Breakdown Structure\n•\tDevelop a Critical Path Schedule\n•\tReview types of cost estimates and identify whether they are “top down or bottom up”\n•\tReview budgets, contingencies and reserves\n•\tCalculate planned and earned values to compare with actual cost\n•\tPerform a cost and schedule analysis\n\nEach week you will prepare a key deliverable for the project plan based on a provided Case Study.  These deliverables include:\n\n•\tProject Scope Statement\n•\tProject Work Breakdown Structure (WBS) and WBS dictionary\n•\tCritical Path schedule sequence diagram\n•\tBar Chart Schedule (Gantt Chart)\n•\tProject Cost Estimate\n•\tProject Status using an Earned Value Calculation\n\nAll of this will position you to set up a plan to control your next assignment or your next project whether this is as the project manager or as an area leader.\n\nRice Center for Engineering Leadership is a Registered Education Provider through the Project Management Institute (PMI)®. Learners who complete this course on the Certificate track will be awarded 14 hours of Profession Development Units. These are recognized by PMI for continuing education or can be applied toward the 35 hours of education required for the Project Management Professional (PMP)® certification. \n\nPMI and PMP are registered marks of the Project Management Institute, Inc.\n\nSHOW ALL ABOUT ENGINEERING PROJECT MANAGEMENT: SCOPE, TIME AND COST MANAGEMENT\nSHOW ALL"
    },
    {
       "Url":"/learn/project-risk-quality-management?specialization=engineering-project-management",
       "name":"Engineering Project Management: Risk, Quality, Teams, and Procurement",
       "Rating":"Engineering Project Management: Risk, Quality, Teams, and Procurement\n4.8\nstars\n901 ratings\n•\n191 reviews\n\nMany Project Managers focus only on the scope, schedule and budget.  However, a successful project requires that you manage risk, control the quality of the deliverables, engage and manage people and procure goods and services. This course will focus on these key support functions that make the difference between a highly successful project and an average one.  During the course, you will prepare a Qualitative Risk Analysis and Evaluate the Cost of Quality for a provided Case Study.\n\nBy the end of this course you will be able to:\n\n•\tIdentify positive and negative risks\n•\tDevelop risk strategies\n•\tPerform a qualitative risk analysis\n•\tIdentify cost contingencies and reserves\n•\tDevelop a quality plan\n•\tIdentify quality standards\n•\tUtilize cause and effect tools \n•\tCreate a prioritization matrix\n•\tDevelop a team management plan that includes team development, identifying team members and clarifies roles and responsibilities\n•\tDevelop a procurement plan that includes contracts and incentives\n\nAll of this will position you to understand the more intangible aspects of project management to drive better overall performance.\n\nRice Center for Engineering Leadership is a Registered Education Provider through the Project Management Institute (PMI)®. Learners who complete this course on the Certificate track will be awarded 12 hours of Profession Development Units. These are recognized by PMI for continuing education or can be applied toward the 35 hours of education required for the Project Management Professional (PMP)® certification. \n\n*PMI and PMP are registered marks of the Project Management Institute, Inc.\n\nSHOW ALL ABOUT ENGINEERING PROJECT MANAGEMENT: RISK, QUALITY, TEAMS, AND PROCUREMENT\nSHOW ALL"
    },
    "/specializations/immunology",
    {
       "Url":"/learn/immunologyfundamentalsimmunitybcells?specialization=immunology",
       "name":"Fundamentals of Immunology: Innate Immunity and B-Cell Function",
       "Rating":"Fundamentals of Immunology: Innate Immunity and B-Cell Function\n4.7\nstars\n1,395 ratings\n•\n275 reviews\n\nCourse 1 of a three course specialization called Fundamentals of Immunology. Each course in the specialization presents material that builds on the previous course's material.\n\nThis is the first leg of a three-part journey through the defenses your body uses to keep you healthy. In this part we hope to give you the vocabulary and concepts you need to interact with the medical community and to provide them in a context that makes them memorable.\n\nFundamentals of Immunology introduces students to the basic functions of the adaptive and innate immune systems. The early lectures survey cells, tissues and organs using metaphors, cartoons and models to improve understanding and retention. After describing the form, function, origin and varieties of antibodies, subsequent lectures provide details on the mechanism of the generation of variation. The course provides animations of gene rearrangement and class switching and descriptions of affinity maturation correlated with detailed physical models of antibody structure. The final lecture reviews these concepts in anatomical context. Testing employs multiple choice questions testing facts, concepts, and application of principles. Questions may refer to diagrams, drawing and photographs used in lecture and reproduced in the outline.\n\nWhat You’ll Learn:\nThe difference between adaptive and innate immune systems, the characteristics of various pathogens that they protect you from and the overall strategies employed in this protection. The detailed structure of antibodies and related immunoglobulin receptors, the characteristics and function of the different antibody classes and the mechanism for producing both the recognition regions and stem regions.  Finally, how these structures are coded for in the DNA and expressed in the B cells.\n\nSHOW ALL ABOUT FUNDAMENTALS OF IMMUNOLOGY: INNATE IMMUNITY AND B-CELL FUNCTION\nSHOW ALL"
    },
    {
       "Url":"/learn/immunologyfundamentalstcellssignaling?specialization=immunology",
       "name":"Fundamentals of Immunology: T Cells and Signaling",
       "Rating":"Fundamentals of Immunology: T Cells and Signaling\n4.8\nstars\n403 ratings\n•\n63 reviews\n\nCourse 2 of a three course specialization called Fundamentals of Immunology. Each course in the specialization presents material that builds on the previous course's material.\n\nThis is the second half of the journey through the defenses your body uses to keep you healthy. In the first part we learned about innate immunity and B cell function. The second part covers T cell function and coordination of the immune response.\n\nFundamentals of Immunology: T cells and Signaling builds on the first course to describe the functions of Complement, MHC presentation to T cells, T cell development and signaling. The early lectures survey cells, tissues and organs using metaphors, cartoons and models to improve understanding and retention. This course includes the structure of both MHC proteins and T cell receptors and the sources of variation. The course provides animations of gene rearrangement, developmental processes and signal cascades. Testing employs multiple choice questions testing facts, concepts, and application of principles. Questions may refer to diagrams, drawing and photographs used in lecture and reproduced in the outline.\n\nWhat You’ll Learn:\nHow complement uses adaptive and innate triggers to target pathogens. The detailed structure and coding of MHC proteins and both alpha-beta and gamma delta receptors and how these proteins interact to initiate an adaptive immune response. The basics of signaling, and the varieties of external receipt and internal activation pathways. We bine the process of putting together how signals and crosstalk control the activity of the immune system.\n\nSHOW ALL ABOUT FUNDAMENTALS OF IMMUNOLOGY: T CELLS AND SIGNALING\nSHOW ALL"
    },
    {
       "Url":"/learn/immunology-friendlyfire?specialization=immunology",
       "name":"Fundamentals of Immunology: Death by Friendly Fire",
       "Rating":"Fundamentals of Immunology: Death by Friendly Fire\n4.8\nstars\n251 ratings\n•\n42 reviews\n\nCourse 3 of a three course specialization called Fundamentals of Immunology. Each course in the specialization presents material that builds on the previous course's material.\n\nThis is the third leg of the journey through the defenses your body uses to keep you healthy. In the first course we learned about innate immunity and B cell function. In the second course we studied T cell function and coordination of the immune response.\n\nFundamentals of Immunology: Death by Friendly Fire introduces students to the basic functions of the adaptive and innate immune systems. The early lectures survey cells, tissues and organs using metaphors, cartoons and models to improve understanding and retention. After describing the form, function, origin and varieties of antibodies, subsequent lectures provide details on the mechanism of the generation of variation. The course provides animations of gene rearrangement and class switching and descriptions of affinity maturation correlated with detailed physical models of antibody structure. The final lecture reviews these concepts in anatomical context. Testing employs multiple choice questions testing facts, concepts, and application of principles. Questions may refer to diagrams, drawing and photographs used in lecture and reproduced in the outline.\n\nWhat You’ll Learn: \nA survey of immune cells and how they attack pathogens, with emphasis on the mechanism of inducing apoptosis and details of Antibody Directed Cell-mediated Cytotoxicity. The inflammatory response and mechanisms of generating tolerance, presented in sequence to emphasize the decision making involved in controlling attacks. A survey of autoimmune disease, their characteristics, cause and treatment. Survey of hypersensitivity reactions, including allergy, anaphylaxis, anemias, granulomas, and a variety of skin responses. This is accompanied by identification, prevention and treatment. The final discussion of preventing transplant rejection is preceded by a detailed unit on antibody technology and the methods of testing for incompatibility.\n\nSHOW ALL ABOUT FUNDAMENTALS OF IMMUNOLOGY: DEATH BY FRIENDLY FIRE\nSHOW ALL"
    },
    {
       "Url":"/learn/fundamentals-of-immunology-four-dueling-with-the-dark-side?specialization=immunology",
       "name":"Fundamentals of Immunology: Dueling with the Dark Side",
       "Rating":"Fundamentals of Immunology: Dueling with the Dark Side\n4.8\nstars\n56 ratings\n•\n12 reviews\n\nFundamentals of Immunology, Course 4: Dueling with the Dark Side, covers the constant battle between your immune system and threats to your health. The first two lectures discuss viral and cellular pathogens, focusing on specific tactics they use to deflect immune attack. Next, a cheerier lecture describes other immune-based therapies, beginning with the use of engineered antibodies to treat specific diseases. This lecture continues with vaccine development (viral-engineered, killed, RNA-component vaccines and more) and adjuvant function and ends with vaccination strategies, including herd immunity and resisting the anti-vaccination movement. The last two lectures cover immune deficiencies and how cancer evades the immune system, concluding with advances in using immune therapies (antibodies and CAR T cells) to cure cancer.\n\nSHOW ALL ABOUT FUNDAMENTALS OF IMMUNOLOGY: DUELING WITH THE DARK SIDE\nSHOW ALL"
    },
    "/specializations/six-sigma-green-belt",
    {
       "Url":"/learn/six-sigma-organization-advanced?specialization=six-sigma-green-belt",
       "name":"Six Sigma and the Organization (Advanced)",
       "Rating":"Six Sigma and the Organization (Advanced)\n4.7\nstars\n2,654 ratings\n•\n559 reviews\n\nThis course is for you if you are looking to dive deeper into Six Sigma or strengthen and expand your knowledge of the basic components of green belt level of Six Sigma and Lean. Six Sigma skills are widely sought by employers both nationally and internationally. These skills have been proven to help improve business processes and performance. This course will introduce you to the purpose of Six Sigma and its value to an organization. You will learn about the basic principles of Six Sigma and Lean. Your instructors will introduce you to, and have you apply, some of the tools and metrics that are critical components of Six Sigma. This course will provide you with the basic knowledge of the principles, roles, and responsibilities of Six Sigma and Lean. \n\nEvery module will include readings, videos, and a quiz to help make sure you understand the material and concepts that are studied. You will also have the opportunity to participate in discussions and peer review exercises to give you the opportunity to apply the material to your daily life.\n\nRegistration includes online access to course content, projects, and resources but does not include the companion text The Certified Six Sigma Green Belt Handbook (2nd edition). The companion text is NOT required to complete the assignments. However, the text is a recognized handbook used by professionals in the field. Also, it is a highly-recommended text for those wishing to move forward in Six Sigma and eventually gain certification from professional agencies such as American Society for Quality (ASQ).\n\nSHOW ALL ABOUT SIX SIGMA AND THE ORGANIZATION (ADVANCED)\nSHOW ALL"
    },
    {
       "Url":"/learn/six-sigma-define-measure-advanced?specialization=six-sigma-green-belt",
       "name":"Six Sigma Advanced Define and Measure Phases",
       "Rating":"Six Sigma Advanced Define and Measure Phases\n4.8\nstars\n1,001 ratings\n•\n177 reviews\n\nThis course is for you if you are looking to dive deeper into Six Sigma or strengthen and expand your knowledge of the basic components of green belt level of Six Sigma and Lean. Six Sigma skills are widely sought by employers both nationally and internationally. These skills have been proven to help improve business processes and performance. This course will take you deeper into the principles and tools associated with the \"Define\" and \"Measure\" phases of the DMAIC structure of Six Sigma.\n\nIt is highly recommended that you complete the \"Yellow Belt Specialization\"  and the course \"Six Sigma and the Organization (Advanced)\" before beginning this course.\n\nIn this course, your instructors will introduce you to, and have you apply, some of the tools and metrics that are critical components of Six Sigma. This course will provide you with the advanced knowledge of team dynamics and performance, process analysis, probability, statistics,  statistical distributions, collecting and summarizing data, measurement systems analysis, process and performance capability, and exploratory data analysis associated with Six Sigma and Lean. \n\nEvery module will include readings, videos, and quizzes to help make sure you understand the material and concepts that are studied. \n\nRegistration includes online access to course content, projects, and resources but does not include the companion text The Certified Six Sigma Green Belt Handbook (2nd edition). The companion text is NOT required to complete the assignments. However, the text is a recognized handbook used by professionals in the field. Also, it is a highly-recommended text for those wishing to move forward in Six Sigma and eventually gain certification from professional agencies such as American Society for Quality (ASQ).\n\nSHOW ALL ABOUT SIX SIGMA ADVANCED DEFINE AND MEASURE PHASES\nSHOW ALL"
    },
    {
       "Url":"/learn/six-sigma-analyze-advanced?specialization=six-sigma-green-belt",
       "name":"Six Sigma Advanced Analyze Phase",
       "Rating":"Six Sigma Advanced Analyze Phase\n4.7\nstars\n775 ratings\n•\n125 reviews\n\nThis course is for you if you are looking to dive deeper into Six Sigma or strengthen and expand your knowledge of the basic components of green belt level of Six Sigma and Lean. Six Sigma skills are widely sought by employers both nationally and internationally. These skills have been proven to help improve business processes and performance. This course will take you deeper into the principles and tools associated with the \"Analyze\" phase of the DMAIC structure of Six Sigma.\n\nIt is highly recommended that you complete the \"Yellow Belt Specialization\"  and the courses \"Six Sigma and the Organization (Advanced)\" and \"Six Sigma Advanced Define and Measure Phase\" before beginning this course.\n\nIn this course, your instructors will introduce you to, and have you apply, some of the tools and metrics that are critical components of Six Sigma. This course will provide you with the advanced knowledge of hypothesis testing and design of experiments as they are associated with Six Sigma and Lean. \n\nEvery module will include readings, videos, and quizzes to help make sure you understand the material and concepts that are studied. \n\nRegistration includes online access to course content, projects, and resources but does not include the companion text The Certified Six Sigma Green Belt Handbook (2nd edition). The companion text is NOT required to complete the assignments. However, the text is a recognized handbook used by professionals in the field. Also, it is a highly-recommended text for those wishing to move forward in Six Sigma and eventually gain certification from professional agencies such as American Society for Quality (ASQ).\n\nSHOW ALL ABOUT SIX SIGMA ADVANCED ANALYZE PHASE\nSHOW ALL"
    },
    {
       "Url":"/learn/six-sigma-improve-control-advanced?specialization=six-sigma-green-belt",
       "name":"Six Sigma Advanced Improve and Control Phases",
       "Rating":"Six Sigma Advanced Improve and Control Phases\n4.8\nstars\n507 ratings\n•\n87 reviews\n\nThis course is for you if you are looking to dive deeper into Six Sigma or strengthen and expand your knowledge of the basic components of green belt level of Six Sigma and Lean. Six Sigma skills are widely sought by employers both nationally and internationally. These skills have been proven to help improve business processes and performance. This course will take you deeper into the principles and tools associated with the \"Improve\" and \"Control\" phases of the DMAIC structure of Six Sigma.\n\nIt is highly recommended that you complete the \"Yellow Belt Specialization\"  and the courses \"Six Sigma and the Organization (Advanced),\" \"Six Sigma Advanced Define and Measure Phase,\" and \"Six Sigma Advanced Analyze Phase\" before beginning this course.\n\nIn this course, your instructors will introduce you to, and have you apply, some of the tools and metrics that are critical components of Six Sigma. This course will provide you with the advanced knowledge of root cause analysis, lean tools, control plan, process control, and statistical process control (SPC) as they are associated with Six Sigma and Lean. \n\nEvery module will include readings, videos, and quizzes to help make sure you understand the material and concepts that are studied. \n\nRegistration includes online access to course content, projects, and resources but does not include the companion text The Certified Six Sigma Green Belt Handbook (2nd edition). The companion text is NOT required to complete the assignments. However, the text is a recognized handbook used by professionals in the field. Also, it is a highly-recommended text for those wishing to move forward in Six Sigma and eventually gain certification from professional agencies such as American Society for Quality (ASQ).\n\nSHOW ALL ABOUT SIX SIGMA ADVANCED IMPROVE AND CONTROL PHASES\nSHOW ALL"
    }
 ]