[
    "/specializations/health-informatics",
    {
       "Url":"/learn/the-socio-technical-health-informatics-context?specialization=health-informatics",
       "name":"The Social and Technical Context of Health Informatics",
       "Rating":"The Social and Technical Context of Health Informatics\n4.2\nstars\n322 ratings\n•\n101 reviews\n\nImproving health and healthcare institutions requires understanding of data and creation of interventions at the many levels at which health IT interact and affect the institution. These levels range from the external “world” in which the institution operates down to the specific technologies. Data scientists find that, when they aim at implementing their models in practice, it is the “socio” components that are both novel to them and mission critical to success. At the end of this course, students will be able to make a quick assessment of a health informatics problem—or a proposed solution—and to determine what is missing and what more needs to be learned.\n\nWho Is This Class For? \nPhysicians, nurses, pharmacists, social workers, and other allied health professionals interested in expanding their understanding of digital health, big data, health information systems, and the unintended consequences of disruptive innovation in the healthcare system. The course is also aimed at those with technical, engineering, or analytics backgrounds who want to understand the nuances of those topics when it comes to healthcare.\n\nSHOW ALL ABOUT THE SOCIAL AND TECHNICAL CONTEXT OF HEALTH INFORMATICS\nSHOW ALL"
    },
    {
       "Url":"/learn/leading-change-health-informatics?specialization=health-informatics",
       "name":"Leading Change in Health Informatics",
       "Rating":"Leading Change in Health Informatics\n4.8\nstars\n194 ratings\n•\n70 reviews\n\nDo you dream of being a CMIO or a Senior Director of Clinical Informatics? If you are aiming to rise up in the ranks in your health system or looking to pivot your career in the direction of big data and health IT, this course is made for you. You'll hear from experts at Johns Hopkins about their experiences harnessing the power of big data in healthcare, improving EHR adoption, and separating out the hope vs hype when it comes to digital medicine. \n\nWhether you're a nurse, pharmacist, physician, other allied health professional or come from a non-clinical background--you know that Health Informatics skills are in demand. This newly launched 5-course specialization by JohnsHopkins faculty members provides a solid foundation for anyone wanting to become a leader in  one of the hottest fields in healthcare. \n\nAs health informaticians, we need to be very clear in our understanding of the current state (as-is), the future state (to-be) and any unintended consequences that can result from our interventions. Prior to introducing large scale change, we need to assess whether a healthcare organization is truly ready for change. This involves taking into account an organization's current culture and values. Successfully leading change through health informatics also requires strategic planning and careful financial considerations. Proper workflow redesign and a clear change management strategy are of utmost importance when introducing new technologies and in ensuring their successful adoption and proper use. \n\nBy the end of this course, students will become familiar with examples of successful and failed attempts at change in health informatics, and the reasons for each. Students will be armed with tools to help optimize their chances for successfully leading change in their respective organizations.\n\nSHOW ALL ABOUT LEADING CHANGE IN HEALTH INFORMATICS\nSHOW ALL"
    },
    {
       "Url":"/learn/the-outcomes-and-interventions-of-health-informatics?specialization=health-informatics",
       "name":"The Outcomes and Interventions of Health Informatics",
       "Rating":"The Outcomes and Interventions of Health Informatics\n4.5\nstars\n67 ratings\n•\n10 reviews\n\nFor clinical data science to be effective in healthcare—to achieve the outcomes desired—it must translate into decision support of some sort, either at the patient, clinician, or manager level. By the end of this course, students will be able to articulate the need for an intervention, to right size it, to choose the appropriate technology, to describe how knowledge should be obtained, and to design a monitoring plan.\n\nSHOW ALL ABOUT THE OUTCOMES AND INTERVENTIONS OF HEALTH INFORMATICS\nSHOW ALL"
    },
    {
       "Url":"/learn/the-data-science-of-health-informatics?specialization=health-informatics",
       "name":"The Data Science of Health Informatics",
       "Rating":"The Data Science of Health Informatics\n4.7\nstars\n147 ratings\n•\n30 reviews\n\nHealth data are notable for how many types there are, how complex they are, and how serious it is to get them straight. These data are used for treatment of the patient from whom they derive, but also for other uses. Examples of such secondary use of health data include population health (e.g., who requires more attention), research (e.g., which drug is more effective in practice), quality (e.g., is the institution meeting benchmarks), and translational research (e.g., are new technologies being applied appropriately). By the end of this course, students will recognize the different types of health and healthcare data, will articulate a coherent and complete question, will interpret queries designed for secondary use of EHR data, and will interpret the results of those queries.\n\nSHOW ALL ABOUT THE DATA SCIENCE OF HEALTH INFORMATICS\nSHOW ALL"
    },
    {
       "Url":"/learn/culminating-project-course-in-health-informatics?specialization=health-informatics",
       "name":"Culminating Project in Health Informatics",
       "Rating":"Culminating Project in Health Informatics\n4.8\nstars\n38 ratings\n•\n7 reviews\n\nThis capstone course in the Health Informatics Specialization will allow learners to create a comprehensive plan for an informatics intervention of their choosing, and that will demonstrate to current or future employers the new skills obtained through the completion of this series of five courses in Health Informatics."
    },
    "/specializations/data-science-statistics-machine-learning",
    {
       "Url":"/learn/statistical-inference?specialization=data-science-statistics-machine-learning",
       "name":"Statistical Inference",
       "Rating":"Statistical Inference\n4.2\nstars\n4,279 ratings\n•\n863 reviews\n\nStatistical inference is the process of drawing conclusions about populations or scientific truths from data. There are many modes of performing inference including statistical modeling, data oriented strategies and explicit use of designs and randomization in analyses. Furthermore, there are broad theories (frequentists, Bayesian, likelihood, design based, …) and numerous complexities (missing data, observed and unobserved confounding, biases) for performing inference. A practitioner can often be left in a debilitating maze of techniques, philosophies and nuance. This course presents the fundamentals of inference in a practical approach for getting things done. After taking this course, students will understand the broad directions of statistical inference and use this information for making informed choices in analyzing data.\n\nSHOW ALL ABOUT STATISTICAL INFERENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/regression-models?specialization=data-science-statistics-machine-learning",
       "name":"Regression Models",
       "Rating":"Regression Models\n4.4\nstars\n3,262 ratings\n•\n561 reviews\n\nLinear models, as their name implies, relates an outcome to a set of predictors of interest using linear assumptions.  Regression models, a subset of linear models, are the most important statistical analysis tool in a data scientist’s toolkit. This course covers regression analysis, least squares and inference using regression models. Special cases of the regression model, ANOVA and ANCOVA will be covered as well. Analysis of residuals and variability will be investigated. The course will cover modern thinking on model selection and novel uses of regression models including scatterplot smoothing.\n\nSHOW ALL ABOUT REGRESSION MODELS\nSHOW ALL"
    },
    {
       "Url":"/learn/practical-machine-learning?specialization=data-science-statistics-machine-learning",
       "name":"Practical Machine Learning",
       "Rating":"Practical Machine Learning\n4.5\nstars\n3,154 ratings\n•\n604 reviews\n\nOne of the most common tasks performed by data scientists and data analysts are prediction and machine learning. This course will cover the basic components of building and applying prediction functions with an emphasis on practical applications. The course will provide basic grounding in concepts such as training and tests sets, overfitting, and error rates. The course will also introduce a range of model based and algorithmic machine learning methods including regression, classification trees, Naive Bayes, and random forests. The course will cover the complete process of building prediction functions including data collection, feature creation, algorithms, and evaluation.\n\nSHOW ALL ABOUT PRACTICAL MACHINE LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/data-products?specialization=data-science-statistics-machine-learning",
       "name":"Developing Data Products",
       "Rating":"Developing Data Products\n4.6\nstars\n2,208 ratings\n•\n410 reviews\n\nA data product is the production output from a statistical analysis. Data products automate complex analysis tasks or use technology to expand the utility of a data informed model, algorithm or inference. This course covers the basics of creating data products using Shiny, R packages, and interactive graphics. The course will focus on the statistical fundamentals of creating a data product that can be used to tell a story about data to a mass audience.\n\nSHOW ALL ABOUT DEVELOPING DATA PRODUCTS\nSHOW ALL"
    },
    {
       "Url":"/learn/data-science-project?specialization=data-science-statistics-machine-learning",
       "name":"Data Science Capstone",
       "Rating":"Data Science Capstone\n4.5\nstars\n1,183 ratings\n•\n314 reviews\n\nThe capstone project class will allow students to create a usable/public data product that can be used to show your skills to potential employers. Projects will be drawn from real-world problems and will be conducted with industry, government, and academic partners."
    },
    "/specializations/tensorflow2-deeplearning",
    {
       "Url":"/learn/getting-started-with-tensor-flow2?specialization=tensorflow2-deeplearning",
       "name":"Getting started with TensorFlow 2",
       "Rating":"Getting started with TensorFlow 2\n4.9\nstars\n370 ratings\n•\n131 reviews\n\nWelcome to this course on Getting started with TensorFlow 2!\n\nIn this course you will learn a complete end-to-end workflow for developing deep learning models with Tensorflow, from building, training, evaluating and predicting with models using the Sequential API, validating your models and including regularisation, implementing callbacks, and saving and loading models. \n\nYou will put concepts that you learn about into practice straight away in practical, hands-on coding tutorials, which you will be guided through by a graduate teaching assistant. In addition there is a series of automatically graded programming assignments for you to consolidate your skills.\n\nAt the end of the course, you will bring many of the concepts together in a Capstone Project, where you will develop an image classifier deep learning model from scratch.\n\nTensorflow is an open source machine library, and is one of the most widely used frameworks for deep learning. The release of Tensorflow 2 marks a step change in the product development, with a central focus on ease of use for all users, from beginner to advanced level. This course is intended for both users who are completely new to Tensorflow, as well as users with experience in Tensorflow 1.x.\n\nThe prerequisite knowledge required in order to be successful in this course is proficiency in the python programming language, (this course uses python 3), knowledge of general machine learning concepts (such as overfitting/underfitting, supervised learning tasks, validation, regularisation and model selection), and a working knowledge of the field of deep learning, including typical model architectures (MLP/feedforward and convolutional neural networks), activation functions, output layers, and optimisation.\n\nSHOW ALL ABOUT GETTING STARTED WITH TENSORFLOW 2\nSHOW ALL"
    },
    {
       "Url":"/learn/customising-models-tensorflow2?specialization=tensorflow2-deeplearning",
       "name":"Customising your models with TensorFlow 2",
       "Rating":"Customising your models with TensorFlow 2\n4.8\nstars\n117 ratings\n•\n48 reviews\n\nWelcome to this course on Customising your models with TensorFlow 2!\n\nIn this course you will deepen your knowledge and skills with TensorFlow, in order to develop fully customised deep learning models and workflows for any application. You will use lower level APIs in TensorFlow to develop complex model architectures, fully customised layers, and a flexible data workflow. You will also expand your knowledge of the TensorFlow APIs to include sequence models.\n\nYou will put concepts that you learn about into practice straight away in practical, hands-on coding tutorials, which you will be guided through by a graduate teaching assistant. In addition there is a series of automatically graded programming assignments for you to consolidate your skills.\n\nAt the end of the course, you will bring many of the concepts together in a Capstone Project, where you will develop a custom neural translation model from scratch.\n\nTensorFlow is an open source machine library, and is one of the most widely used frameworks for deep learning. The release of TensorFlow 2 marks a step change in the product development, with a central focus on ease of use for all users, from beginner to advanced level. \n\nThis course follows on directly from the previous course Getting Started with TensorFlow 2. The additional prerequisite knowledge required in order to be successful in this course is proficiency in the python programming language, (this course uses python 3), knowledge of general machine learning concepts (such as overfitting/underfitting, supervised learning tasks, validation, regularisation and model selection), and a working knowledge of the field of deep learning, including typical model architectures (MLP, CNN, RNN, ResNet), and concepts such as transfer learning, data augmentation and word embeddings.\n\nSHOW ALL ABOUT CUSTOMISING YOUR MODELS WITH TENSORFLOW 2\nSHOW ALL"
    },
    {
       "Url":"/learn/probabilistic-deep-learning-with-tensorflow2?specialization=tensorflow2-deeplearning",
       "name":"Probabilistic Deep Learning with TensorFlow 2",
       "Rating":"Probabilistic Deep Learning with TensorFlow 2\n4.7\nstars\n52 ratings\n•\n19 reviews\n\nWelcome to this course on Probabilistic Deep Learning with TensorFlow!\n\nThis course builds on the foundational concepts and skills for TensorFlow taught in the first two courses in this specialisation, and focuses on the  probabilistic approach to deep learning. This is an increasingly important area of deep learning that aims to quantify the noise and uncertainty that is often present in real world datasets. This is a crucial aspect when using deep learning models in applications such as autonomous vehicles or medical diagnoses; we need the model to know what it doesn't know.\n\nYou will learn how to develop probabilistic models with TensorFlow, making particular use of the TensorFlow Probability library, which is designed to make it easy to combine probabilistic models with deep learning. As such, this course can also be viewed as an introduction to the TensorFlow Probability library.\n\nYou will learn how probability distributions can be represented and incorporated into deep learning models in TensorFlow, including Bayesian neural networks, normalising flows and variational autoencoders. You will learn how to develop models for uncertainty quantification, as well as generative models that can create new samples similar to those in the dataset, such as images of celebrity faces.\n\nYou will put concepts that you learn about into practice straight away in practical, hands-on coding tutorials, which you will be guided through by a graduate teaching assistant. In addition there is a series of automatically graded programming assignments for you to consolidate your skills.\n\nAt the end of the course, you will bring many of the concepts together in a Capstone Project, where you will develop a variational autoencoder algorithm to produce a generative model of a synthetic image dataset that you will create yourself.\n\nThis course follows on from the previous two courses in the specialisation, Getting Started with TensorFlow 2 and Customising Your Models with TensorFlow 2. The additional prerequisite knowledge required in order to be successful in this course is a solid foundation in probability and statistics. In particular, it is assumed that you are familiar with standard probability distributions, probability density functions, and concepts such as maximum likelihood estimation, change of variables formula for random variables, and the evidence lower bound (ELBO) used in variational inference.\n\nSHOW ALL ABOUT PROBABILISTIC DEEP LEARNING WITH TENSORFLOW 2\nSHOW ALL"
    },
    "/specializations/content-strategy",
    {
       "Url":"/learn/engagement-strategy?specialization=content-strategy",
       "name":"Content Strategy for Professionals: Engaging Audiences",
       "Rating":"Content Strategy for Professionals: Engaging Audiences\n4.6\nstars\n587 ratings\n•\n157 reviews\n\nIn this course, professionals at all levels of an organization will learn the best ways to engage an audience they want and need by smartly implementing their important, strategic stories and information and by using proven tools and techniques to enhance an audience’s experiences and interest.\n\nContent Strategy is a conversation that provides thought-leadership. It starts a “conversation” with users and stakeholders inside and outside an organization.  Conversations are the natural way people think about complex issues. Conversations also enable people to develop “stories,” which lead to understanding and helpful mental pictures. Content Strategy practitioners are at all levels of the best enterprises – in all departments and sectors from the top leader to the newcomer in the ranks. \n\nIn this complex information age, forward-thinking employees know that if they and their organizations are to thrive, they need to go beyond their job descriptions. They must master the most demanding communications frontier – creating engaging, strategic, honest stories and information that is valued by their most important audiences. In turn that will make their enterprise stand out. \n\nRegardless of their area of work, position or expertise, Content Strategy practitioners know how to use words, pictures, video, and social and mobile media to interact with their most important constituents with trustable, actionable information that the audience values and will use. The strategic content they produce enhances the user’s lives and deepens their understanding and engagement with the organization.\n\nGuest lecturers in this course include:\n-- Rachel Davis Mersey, Associate Professor, Medill, Northwestern\n-- Ed Malthouse, Theodore R. and Annie Laurie Sills Professor of Integrated Marketing Communications, Medill, Northwestern\n-- Bobby Calder, Charles H. Kellstadt Professor of Marketing & Director of the Center for Cultural Marketing, Kellogg, Northwestern\n-- Steven Duke, Associate Professor, Medill, Northwestern\n-- Janice Castro, Assistant Professor Emerita, Medill, Nothwestern\n\nSHOW ALL ABOUT CONTENT STRATEGY FOR PROFESSIONALS: ENGAGING AUDIENCES\nSHOW ALL"
    },
    {
       "Url":"/learn/content-management-strategy?specialization=content-strategy",
       "name":"Content Strategy for Professionals: Managing Content",
       "Rating":"Content Strategy for Professionals: Managing Content\n4.5\nstars\n291 ratings\n•\n47 reviews\n\nIn the second course of the Content Strategy Specialization - \"Managing Content\" - you will dive deeper into Content Strategy by learning some great options for managing your important content once it's been created. You will look at media platforms and how best to tell an organization’s “content story” across those platforms using a human-centered design. Then, you'll take a close look at ways to best utilize social and mobile media, as well as some of the issues around insourcing/outsourcing content. Finally, you'll get an inside look at how legal issues associated with Content Strategy are handled in companies large and small around the globe.\n\nThis course serves professionals who want to learn to manage their trustable, engaging and often interactive content to advance their enterprise’s future and their own career in it. As a bonus, we've also included a toolkit to download and take back to work. Can’t remember the 3 truths that frame all communications in the digital age? Need to convince a co-worker that a human centered design approach is best for your project? Want to review how you create an engaging brand for your content? You will find answers to those questions and more in the toolkit.\n\nGuest lecturers in this course include:\n-- Emily Withrow, Assistant Professor, Medill, Northwestern\n-- Jeremy Gilbert, Director of Strategic Initiatives, The Washington Post\n-- Randy Hlavac, Lecturer, Medill, Northwestern (and lead professor of the Social Media Marketing Specialization also on Coursera)\n\nSHOW ALL ABOUT CONTENT STRATEGY FOR PROFESSIONALS: MANAGING CONTENT\nSHOW ALL"
    },
    {
       "Url":"/learn/increase-reach?specialization=content-strategy",
       "name":"Content Strategy for Professionals: Expanding Your Content’s Reach",
       "Rating":"Content Strategy for Professionals: Expanding Your Content’s Reach\n4.5\nstars\n189 ratings\n•\n37 reviews\n\nIn this, the third Content Strategy course, participants will learn actionable ways to grow internal and external audiences.  They will deepen their understanding about those target individuals and will use a host of known and emerging tools and social networks to meaningfully reach them. As its name makes clear, this course will expand your content's impact and reach. \n\nYou will begin by learning how to utilize content trends to jump-start your organization's influence. You'll also look at how to engage with multi-channel digital communities across all social media. Finally, you'll hear about some of the best ways to enhance your content with new interactivity tools and gamification.\n\nIn this information age, every organization depends on its employees and those it serves to understand where it is going and what advances the organization has made. Content Strategy will enable you to tell your important stories with far greater impact and to a large, more valuable audience.\n\nGuest lecturers in this course include:\n-- Randy Hlavac, Lecturer, Medill, Northwestern (and lead professor of the Social Media Marketing Specialization also on Coursera) \n-- Emily Withrow, Assistant Professor, Medill, Northwestern\n\nSHOW ALL ABOUT CONTENT STRATEGY FOR PROFESSIONALS: EXPANDING YOUR CONTENT’S REACH\nSHOW ALL"
    },
    {
       "Url":"/learn/effective-content-strategy?specialization=content-strategy",
       "name":"Content Strategy for Professionals: Ensuring Your Content's Impact",
       "Rating":"Content Strategy for Professionals: Ensuring Your Content's Impact\n4.6\nstars\n158 ratings\n•\n29 reviews\n\nIn the fourth course of the Content Strategy Specialization - Ensuring Your Content's Impact - you will look at visual communication and the ways you can be more effective with your font choices, photography, and video. You'll also dive deeper into social communities to help you understand how these communities form and what you can do to build your role within them. The last module is pivotal for Content Strategists. It will help you to understand how best to measure your content to maximize its effectiveness relative to the time you commit to it.\n\nWhile this MOOC does share the theoretical elements of Content Strategy, there is a much greater emphasis on its application. Creating trend-worthy headlines and blogs, social media plans, digital measurement templates, video and photography content are all skills you will have in your toolkit by the end of the MOOC, ready to apply at your organization. And speaking of toolkits, we have included one that you can download and take back to work which includes the practical tips from the learnings in this course as well as the previous one on Expanding Your Content's Reach.\n\nGuest lecturers in this course include:\n-- Zach Wise, Associate Professor, Medill Northwestern\n-- Rich Gordon, Professor & Director of Digital Innovation, Medill, Northwestern\n-- Randy Hlavac, Lecturer, Medill, Northwestern (and lead professor of the Social Media Marketing Specialization also on Coursera)\n\nSHOW ALL ABOUT CONTENT STRATEGY FOR PROFESSIONALS: ENSURING YOUR CONTENT'S IMPACT\nSHOW ALL"
    },
    {
       "Url":"/learn/content-strategy-project?specialization=content-strategy",
       "name":"Content Strategy for Professionals: Capstone Project",
       "Rating":"Content Strategy for Professionals: Capstone Project\n4.7\nstars\n51 ratings\n•\n14 reviews\n\nThe Capstone Project will let you demonstrate all that you have learned throughout the Content Strategy Specialization. It is an exciting learning experience that takes you through developing an effective Content Strategy package to meaningfully understand its scope and impact.\n\nThe Capstone is centered on a fictional web startup, Wish I Was There, which aims to be the go-to travel guide for anywhere in the world using recommendations crowdsourced from local experts.  While it is not a real company, the assignment you are asked to complete is similar to the work you would do in the real-world. By the time you’ve finished developing your response to this case, you will see how it directly relates to what confronts you in your own work. For the Capstone assignment, assume you have been selected to develop a Content Strategy for the section of Wish I Was There’s website for the region, people and culture where you live and work. You will need to create a visual mock-up of a webpage that appeals to the audiences you want to reach as well as a comprehensive plan to engage with them.\n\nSHOW ALL ABOUT CONTENT STRATEGY FOR PROFESSIONALS: CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/sustainable-business-change-agent",
    {
       "Url":"/learn/sustainable-business?specialization=sustainable-business-change-agent",
       "name":"First Steps in Making the Business Case for Sustainability",
       "Rating":"First Steps in Making the Business Case for Sustainability\n4.7\nstars\n110 ratings\n•\n47 reviews\n\nThe Business School at the University of Colorado Denver wants to help you become a change agent for sustainable business. We hope that with the skills and concepts you gain from this specialization that you will help your business reduce its social and environmental impact.  Being a change agent is hard.  It takes courage and passion and knowledge.  To implement change also requires being able to make the case for that change in terms that people in your company or organization respond to and understand. \n\nAfter completing the specialization, you will be able to: \n      *  Discuss the threats and opportunities that major global trends such as climate change present to businesses;\n      *  Identify ways a company can improve its environmental and social performance;\n      *  Evaluate and compare companies’ sustainability activities and products;\n      *  Develop a business case for implementing sustainability investments;\n      *  Identify key criteria of green businesses and product design;\n      *  Be a change agent in your organization;\n      *  Understand emerging topics in sustainable business, including those in the public policy space.\n\nWe're very excited about offering this MOOC specialization and hope it gives you the first step toward learning about and taking action to make the places you work and the products you buy more sustainable.\n \nSustainable business changes daily with new products, innovations and ideas, so you will be important in keeping the class current.  We look forward to learning from you as you take this green journey!\n______\n\nSHOW ALL ABOUT FIRST STEPS IN MAKING THE BUSINESS CASE FOR SUSTAINABILITY\nSHOW ALL"
    },
    {
       "Url":"/learn/business-case-sustainability?specialization=sustainable-business-change-agent",
       "name":"More on Change and Sustainability",
       "Rating":"More on Change and Sustainability\n4.8\nstars\n44 ratings\n•\n16 reviews\n\nThis is Class 2 of the MOOC Specialization, Become a Sustainable Business Change Agent.\n\nIn this class you will learn more change agent skills and hear from people who have made changes in their organizations.\n\nYou will also learn more about green design and sustainability reporting.\n\nThe skills from this class will help improve products and services in your company or help the company issue its first, or an improved sustainability report.\n\nSHOW ALL ABOUT MORE ON CHANGE AND SUSTAINABILITY\nSHOW ALL"
    },
    {
       "Url":"/learn/sustainable-business-changes?specialization=sustainable-business-change-agent",
       "name":"Sustainable Business: Big Issues, Big Changes",
       "Rating":"Sustainable Business: Big Issues, Big Changes\n4.7\nstars\n60 ratings\n•\n13 reviews\n\nThis is class 3 in the MOOC specialization, Become a Sustainable Business Change Agent.\n\nThis class looks at the big issues companies are fixing - climate change, water, worker satisfaction and supply chain issues.\nYou will learn tools to help your company address these issues intelligently.\n\nThe class ends with an assignment to set a science-based carbon reduction target for a small company.  Tis is absolutely cutting edge material.  Only about 300 companies in the whole world are doing this as of July 2017.  You could put your company in the elite group!\n\nWith the knowledge and tools you have acquired from the 3 classes in this specialization you are well on your way to making a difference in your company, and making the future brighter for everyone.\n\nThank you for being part of this program!\n\nSHOW ALL ABOUT SUSTAINABLE BUSINESS: BIG ISSUES, BIG CHANGES\nSHOW ALL"
    },
    {
       "Url":"/learn/sustainability-proposal?specialization=sustainable-business-change-agent",
       "name":"Capstone: Creating A Sustainability Proposal",
       "Rating":"Capstone: Creating A Sustainability Proposal\n4.9\nstars\n23 ratings\n•\n9 reviews\n\nCongratulations on reaching the Capstone Class of the Become a Sustainable Business Change Agent specialization.  The class will help you apply material from the previous three classes.  We have developed a case about a hypothetical ski resort that offers lots of opportunities to develop sustainability recommendations.  A second option is do develop a proposal for a change in your company or organization.  Or you can do both the case and your own proposal.  \n\nThe goal of the class is to have you practice the entire process from identifying a problem, finding a possible solution, doing analysis to determine the proposed change's financial and sustainability impacts, figure out who to present the proposal and what they need to see to say 'Yes' and develop a budget and implementation plan.\n\nIt is big assignment, but if you have gone through the material in the first three classes you should be well-equipped for the challenge.\n\nWe hope that the concepts and tools we have introduced will start you on your way to making positive changes in your company, organization, community and the world.  We have provided just the most basic tolls.  As you progress you will enhance your skills and become more effective.  Best of luck on all you change endeavors.\n\nSHOW ALL ABOUT CAPSTONE: CREATING A SUSTAINABILITY PROPOSAL\nSHOW ALL"
    },
    "/specializations/bioinformatics",
    {
       "Url":"/learn/dna-analysis?specialization=bioinformatics",
       "name":"Finding Hidden Messages in DNA (Bioinformatics I)",
       "Rating":"Finding Hidden Messages in DNA (Bioinformatics I)\n4.4\nstars\n870 ratings\n•\n209 reviews\n\nNamed a top 50 MOOC of all time by Class Central!\n\nThis course begins a series of classes illustrating the power of computing in modern biology. Please join us on the frontier of bioinformatics to look for hidden messages in DNA without ever needing to put on a lab coat.\n\nIn the first half of the course, we investigate DNA replication, and ask the question, where in the genome does DNA replication begin?  We will see that we can answer this question for many bacteria using only some straightforward algorithms to look for hidden messages in the genome.\n\nIn the second half of the course, we examine a different biological question, when we ask which DNA patterns play the role of molecular clocks.  The cells in your body manage to maintain a circadian rhythm, but how is this achieved on the level of DNA?  Once again, we will see that by knowing which hidden messages to look for, we can start to understand the amazingly complex language of DNA.  Perhaps surprisingly, we will apply randomized algorithms, which roll dice and flip coins in order to solve problems.\n\nFinally, you will get your hands dirty and apply existing software tools to find recurring biological motifs within genes that are responsible for helping Mycobacterium tuberculosis go \"dormant\" within a host for many years before causing an active infection.\n\nSHOW ALL ABOUT FINDING HIDDEN MESSAGES IN DNA (BIOINFORMATICS I)\nSHOW ALL"
    },
    {
       "Url":"/learn/genome-sequencing?specialization=bioinformatics",
       "name":"Genome Sequencing (Bioinformatics II)",
       "Rating":"Genome Sequencing (Bioinformatics II)\n4.6\nstars\n282 ratings\n•\n60 reviews\n\nYou may have heard a lot about genome sequencing and its potential to usher in an era of personalized medicine, but what does it mean to sequence a genome?\n\nBiologists still cannot read the nucleotides of an entire genome as you would read a book from beginning to end. However, they can read short pieces of DNA. In this course, we will see how graph theory can be used to assemble genomes from these short pieces. We will further learn about brute force algorithms and apply them to sequencing mini-proteins called antibiotics. \n\nIn the first half of the course, we will see that biologists cannot read the 3 billion nucleotides of a human genome as you would read a book from beginning to end.  However, they can read shorter fragments of DNA. In this course, we will see how graph theory can be used to assemble genomes from these short pieces in what amounts to the largest jigsaw puzzle ever put together.\n\nIn the second half of the course, we will discuss antibiotics, a topic of great relevance as antimicrobial-resistant bacteria like MRSA are on the rise.  You know antibiotics as drugs, but on the molecular level they are short mini-proteins that have been engineered by bacteria to kill their enemies.  Determining the sequence of amino acids making up one of these antibiotics is an important research problem, and one that is similar to that of sequencing a genome by assembling tiny fragments of DNA.  We will see how brute force algorithms that try every possible solution are able to identify naturally occurring antibiotics so that they can be synthesized in a lab.\n\nFinally, you will learn how to apply popular bioinformatics software tools to sequence the genome of a deadly Staphylococcus bacterium that has acquired antibiotics resistance.\n\nSHOW ALL ABOUT GENOME SEQUENCING (BIOINFORMATICS II)\nSHOW ALL"
    },
    {
       "Url":"/learn/comparing-genomes?specialization=bioinformatics",
       "name":"Comparing Genes, Proteins, and Genomes (Bioinformatics III)",
       "Rating":"Comparing Genes, Proteins, and Genomes (Bioinformatics III)\n4.7\nstars\n118 ratings\n•\n22 reviews\n\nOnce we have sequenced genomes in the previous course, we would like to compare them to determine how species have evolved and what makes them different.\n\nIn the first half of the course, we will compare two short biological sequences, such as genes (i.e., short sequences of DNA) or proteins.  We will encounter a powerful algorithmic tool called dynamic programming that will help us determine the number of mutations that have separated the two genes/proteins.\n\nIn the second half of the course, we will \"zoom out\" to compare entire genomes, where we see large scale mutations called genome rearrangements, seismic events that have heaved around large blocks of DNA over millions of years of evolution.  Looking at the human and mouse genomes, we will ask ourselves: just as earthquakes are much more likely to occur along fault lines, are there locations in our genome that are \"fragile\" and more susceptible to be broken as part of genome rearrangements?  We will see how combinatorial algorithms will help us answer this question.\n\nFinally, you will learn how to apply popular bioinformatics software tools to solve problems in sequence alignment, including BLAST.\n\nSHOW ALL ABOUT COMPARING GENES, PROTEINS, AND GENOMES (BIOINFORMATICS III)\nSHOW ALL"
    },
    {
       "Url":"/learn/molecular-evolution?specialization=bioinformatics",
       "name":"Molecular Evolution (Bioinformatics IV)",
       "Rating":"Molecular Evolution (Bioinformatics IV)\n4.6\nstars\n70 ratings\n•\n19 reviews\n\nIn the previous course in the Specialization, we learned how to compare genes, proteins, and genomes.  One way we can use these methods is in order to construct a \"Tree of Life\" showing how a large collection of related organisms have evolved over time.\n\nIn the first half of the course, we will discuss approaches for evolutionary tree construction that have been the subject of some of the most cited scientific papers of all time, and show how they can resolve quandaries from finding the origin of a deadly virus to locating the birthplace of modern humans.\n\nIn the second half of the course, we will shift gears and examine the old claim that birds evolved from dinosaurs.  How can we prove this?  In particular, we will examine a result that claimed that peptides harvested from a T. rex fossil closely matched peptides found in chickens. In particular, we will use methods from computational proteomics to ask how we could assess whether this result is valid or due to some form of contamination.\n\nFinally, you will learn how to apply popular bioinformatics software tools to reconstruct an evolutionary tree of ebolaviruses and identify the source of the recent Ebola epidemic that caused global headlines.\n\nSHOW ALL ABOUT MOLECULAR EVOLUTION (BIOINFORMATICS IV)\nSHOW ALL"
    },
    {
       "Url":"/learn/genomic-data?specialization=bioinformatics",
       "name":"Genomic Data Science and Clustering (Bioinformatics V)",
       "Rating":"Genomic Data Science and Clustering (Bioinformatics V)\n4.2\nstars\n83 ratings\n•\n20 reviews\n\nHow do we infer which genes orchestrate various processes in the cell?  How did humans migrate out of Africa and spread around the world? In this class, we will see that these two seemingly different questions can be addressed using similar algorithmic and machine learning techniques arising from the general problem of dividing data points into distinct clusters.\n\nIn the first half of the course, we will introduce algorithms for clustering a group of objects into a collection of clusters based on their similarity, a classic problem in data science, and see how these algorithms can be applied to gene expression data.\n\nIn the second half of the course, we will introduce another classic tool in data science called principal components analysis that can be used to preprocess multidimensional data before clustering in an effort to greatly reduce the number dimensions without losing much of the \"signal\" in the data.\n\nFinally, you will learn how to apply popular bioinformatics software tools to solve a real problem in clustering.\n\nSHOW ALL ABOUT GENOMIC DATA SCIENCE AND CLUSTERING (BIOINFORMATICS V)\nSHOW ALL"
    },
    {
       "Url":"/learn/dna-mutations?specialization=bioinformatics",
       "name":"Finding Mutations in DNA and Proteins (Bioinformatics VI)",
       "Rating":"Finding Mutations in DNA and Proteins (Bioinformatics VI)\n4.7\nstars\n54 ratings\n•\n12 reviews\n\nIn previous courses in the Specialization, we have discussed how to sequence and compare genomes. This course will cover advanced topics in finding mutations lurking within DNA and proteins.\n\nIn the first half of the course, we would like to ask how an individual's genome differs from the \"reference genome\" of the species. Our goal is to take small fragments of DNA from the individual and \"map\" them to the reference genome.  We will see that the combinatorial pattern matching algorithms solving this problem are elegant and extremely efficient, requiring a surprisingly small amount of runtime and memory.\n\nIn the second half of the course, we will learn how to identify the function of a protein even if it has been bombarded by so many mutations compared to similar proteins with known functions that it has become barely recognizable.  This is the case, for example, in HIV studies, since the virus often mutates so quickly that researchers can struggle to study it.  The approach we will use is based on a powerful machine learning tool called a hidden Markov model.\n\nFinally, you will learn how to apply popular bioinformatics software tools applying hidden Markov models to compare a protein against a related family of proteins.\n\nSHOW ALL ABOUT FINDING MUTATIONS IN DNA AND PROTEINS (BIOINFORMATICS VI)\nSHOW ALL"
    },
    {
       "Url":"/learn/bioinformatics-project?specialization=bioinformatics",
       "name":"Bioinformatics Capstone: Big Data in Biology",
       "Rating":"Bioinformatics Capstone: Big Data in Biology\n4.1\nstars\n19 ratings\n•\n6 reviews\n\nIn this course, you will learn how to use the BaseSpace cloud platform developed by Illumina (our industry partner) to apply several standard bioinformatics software approaches to real biological data.\n\nIn particular, in a series of Application Challenges will see how genome assembly can be used to track the source of a food poisoning outbreak, how RNA-Sequencing can help us analyze gene expression data on the tissue level, and compare the pros and cons of whole genome vs. whole exome sequencing for finding potentially harmful mutations in a human sample.\n\nPlus, hacker track students will have the option to build their own genome assembler and apply it to real data!\n\nSHOW ALL ABOUT BIOINFORMATICS CAPSTONE: BIG DATA IN BIOLOGY\nSHOW ALL"
    },
    "/specializations/marketing-redes-sociales",
    {
       "Url":"/learn/intro-redes-sociales?specialization=marketing-redes-sociales",
       "name":"Introducción a las redes sociales. Sus objetivos y métricas.",
       "Rating":"Introducción a las redes sociales. Sus objetivos y métricas.\n4.4\nstars\n2,387 ratings\n•\n1,044 reviews\n\nEn este programa se hará, de manera holística, una revisión del uso e implementación de redes sociales. Se provee de un conocimiento sólido en el desarrollo de estrategias requeridas en una organización para involucrar a los consumidores y miembros de la misma en un ambiente de social listening. \n\nLos participantes obtendrán un panorama sólido de principios de herramientas digitales y de habilidades críticas y analíticas para seleccionar la plataforma de redes sociales más adecuada a sus necesidades y comprender el social listening con el fin de administrar un proyecto digital exitoso.\n\nEs importante mencionar que este curso es introductorio al tema del social listening, por lo que solo es necesario que se tengan conocimientos básicos sobre Mercadotecnia o temas relacionados.\n\nSHOW ALL ABOUT INTRODUCCIÓN A LAS REDES SOCIALES. SUS OBJETIVOS Y MÉTRICAS. \nSHOW ALL"
    },
    {
       "Url":"/learn/redes-sociales-caracteristicas?specialization=marketing-redes-sociales",
       "name":"Beneficios y características de las redes sociales más significativas",
       "Rating":"Beneficios y características de las redes sociales más significativas\n4.4\nstars\n865 ratings\n•\n296 reviews\n\nEn este curso se explicarán los aspectos más generales del ámbito de las redes sociales con el objetivo de que el participante distinga, clasifique e identifique las cualidades particulares de la evolución de las redes sociales, su aplicación general en el ámbito de negocios y comercial, así como reconocer las redes sociales de más auge en nuestros tiempos y las tendencias de empleo.\n\nSHOW ALL ABOUT BENEFICIOS Y CARACTERÍSTICAS DE LAS REDES SOCIALES MÁS SIGNIFICATIVAS\nSHOW ALL"
    },
    {
       "Url":"/learn/mercadotecnia-sociales?specialization=marketing-redes-sociales",
       "name":"Requerimientos, planeación, ejecución y medición de estrategias para redes sociales",
       "Rating":"Requerimientos, planeación, ejecución y medición de estrategias para redes sociales\n4.5\nstars\n493 ratings\n•\n171 reviews\n\n¿Te has preguntado cómo se manejan las campañas a través de las redes sociales? ¿Cómo es el proceso que se realiza? ¿Cómo puedo sacar provecho de ellas para posicionar mi producto o mi servicio? \n\nÉstas y muchas más preguntas nos hacemos al ser parte de los consumidores que adquirimos un producto o servicio y que el medio por el cual nos enganchamos a él, fue una red social, pero también y principalmente como proveedor, nos interesa cómo sacar provecho de ellas para favorecer nuestro negocio.\n\nEn este curso podrás conocer cuáles son los elementos que necesitas considerar para realizar tu estrategia de redes sociales. El pilar de todo esto es tener una técnica apropiada que te ayude paso a paso a llevar a cabo cada etapa, en donde todo comienza con una buena planeación. Es preciso, así mismo, contar con una estructura que permita pasar de la planeación a la ejecución y finalmente saber qué y cómo medir de los resultados. Una estrategia debe de ser realista y medible, por ello, este curso está diseñado para que aumentes las posibilidades de éxito utilizando la metodología que sugerimos.\n\nSHOW ALL ABOUT REQUERIMIENTOS, PLANEACIÓN, EJECUCIÓN Y MEDICIÓN DE ESTRATEGIAS PARA REDES SOCIALES\nSHOW ALL"
    },
    {
       "Url":"/learn/red-social?specialization=marketing-redes-sociales",
       "name":"Las redes sociales en acción",
       "Rating":"Las redes sociales en acción\n4.6\nstars\n658 ratings\n•\n260 reviews\n\nComo un mercadólogo, tenemos claro que nuestra función principal en las empresas es identificar las necesidades del mercado y con base en ellas establecer estrategias de compra – venta que causen impacto y satisfagan las necesidades de los consumidores. Éste es un reto importante, pero además de ser creativos en la definición de estas estrategias, tenemos que tener en cuenta el desarrollo que a través de los últimos años ha tenido el Internet y atrás de él las redes sociales. Es por ello que hay que estar conscientes de la importancia que las redes van teniendo y cómo pueden ayudar a la promoción de los productos y servicios que como proveedor estamos ofreciendo. \n\nEn este curso podrás conocer cómo se ejecuta una estrategia de redes sociales y las consideraciones que debes de tener para controlar y medir el desempeño de tu estrategia. Podrás identificar cómo evaluar si es posible gestionar la estrategia con recursos propios, si es necesario utilizar una agencia o si es apropiado hacerlo con un esquema mixto; también reconocerás la importancia de realizar una escucha activa y las herramientas que te permitirán desarrollar esta actividad, las plataformas más convenientes y la frecuencia más apropiada para tu negocio, los indicadores clave de medir y cómo hacerlo y finalmente las técnicas para optimizar el desempeño de tu estrategia de redes sociales y lograr tus objetivos.\n\nSeguramente te serán de gran utilidad dentro del ámbito de la mercadotecnia.\n\nSHOW ALL ABOUT LAS REDES SOCIALES EN ACCIÓN\nSHOW ALL"
    },
    {
       "Url":"/learn/redes-sociales-proyecto?specialization=marketing-redes-sociales",
       "name":"Marketing en Redes Sociales Proyecto Final",
       "Rating":"Marketing en Redes Sociales Proyecto Final\n4.6\nstars\n86 ratings\n•\n40 reviews\n\nPor medio de este proyecto podrás poner en práctica los conocimientos adquiridos durante la realización de los 4 cursos complementarios al programa de la especialidad. Estos conocimientos te llevarán a realizar una estrategia de mercado por medio de las redes sociales, esto con un enfoque comercial B2B. \n\nDurante el desarrollo del proyecto contarás con el apoyo de expertos, así como el apoyo de los alumnos inscritos al curso, este trabajo colaborativo te ayudará a cumplir con éxito los requisitos básicos para que tu estrategia de mercado puedas llevarla a la vida real.\n\nSHOW ALL ABOUT MARKETING EN REDES SOCIALES PROYECTO FINAL\nSHOW ALL"
    },
    "/specializations/website-development",
    {
       "Url":"/learn/website-coding?specialization=website-development",
       "name":"Responsive Website Basics: Code with HTML, CSS, and JavaScript",
       "Rating":"Responsive Website Basics: Code with HTML, CSS, and JavaScript\n4.6\nstars\n5,713 ratings\n•\n1,554 reviews\n\nIn this course you will learn three key website programming and design languages: HTML, CSS and JavaScript. You will create a web page using basic elements to control layout and style.  Additionally, your web page will support interactivity. \n\nAt the end of the course, you will be able to:\n\n1. Define the purpose of HTML, CSS and JavaScript\n2. Make a simple web page using HTML\n3. Use CSS to control text styles and layout\n4. Use CSS libraries such as Bootstrap to create responsive layouts\n5. Use JavaScript variables and functions\n6. Manipulate web page content using JavaScript\n7. Respond to user input using JavaScript\n\nIn this course, you will complete: \n2 assignments writing HTML, CSS and JavaScript, each taking ~1 hour to complete\n4 quizzes, each taking ~20 minutes to complete\n1 programming exercise~30 minutes to complete\nmultiple practice quizzes, each taking ~5 minutes to complete\n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes.\n\nSHOW ALL ABOUT RESPONSIVE WEBSITE BASICS: CODE WITH HTML, CSS, AND JAVASCRIPT \nSHOW ALL"
    },
    {
       "Url":"/learn/responsive-web-design?specialization=website-development",
       "name":"Responsive Web Design",
       "Rating":"Responsive Web Design\n4.6\nstars\n1,865 ratings\n•\n402 reviews\n\nIn this course you will learn how to apply concepts from interaction design and human computer interaction in order to design and build an interactive, professional looking website. You will learn how to make your web page designs adapt to different screen sizes using responsive grid layouts. You will learn how to add navigation and other design elements, and you will learn how to separate data and display using JavaScript objects and templates. \n\nAt the end of the course, you will be able to:\n1. Explain why users need to know where they are, where they can go and what is on a web page\n2. Create wireframe mockups of web pages \n3. Identify the key functional elements of web pages\n4. Use Bootstrap components to realise page designs\n5. Use JavaScript data structures such as arrays and objects to define the data used in a web page\n6. Use the Handlebars template library to convert data to HTML \n7. Add interactivity to templates using JavaScript event listeners\n\nIn this course, you will complete:\n1 website design assignment taking ~1 hour to complete\n1 programming assignment taking ~1 hour to complete\n4 quizzes, each taking ~20 minutes to complete\nmultiple practice quizzes, each taking ~5 minutes to complete\n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes.\n\nSHOW ALL ABOUT RESPONSIVE WEB DESIGN\nSHOW ALL"
    },
    {
       "Url":"/learn/meteor-development?specialization=website-development",
       "name":"Introduction to Meteor.js Development",
       "Rating":"Introduction to Meteor.js Development\n4.6\nstars\n1,141 ratings\n•\n300 reviews\n\nIn this course, you will learn how to create a complete, multi-user web site using the Meteor.js framework and MongoDB. You will implement user authentication, security features, reactive templates and routing using iron router. You will carry out key database operations such as inserting, removing and updating data as well as sorting and filtering. You will see how a complete application can be built, line by line. \n\nAt the end of the course, you will be able to:\n1. Install the Meteor.js system and create a web application\n2. Work with the Meteor.js packaging system\n3. Write Meteor.js templates that can reactively display data\n4. Use insert, remove and update operations on MongoDB\n5. Write MongoDB data filters to search for and sort data\n6 .Add  user authentication functionality to a website\n7. Control what is displayed on the page using iron:router \n8. Implement basic security features \n\nIn this course, you will complete:\n1 server install assignment taking ~1 hour to complete\n1 programming assignment taking ~8 hours to complete\n4 quizzes, each taking ~20 minutes to complete\nmultiple practice quizzes, each taking ~5 minutes to complete\n\nPrerequisites\n\nThis course is designed to build on top of the material delivered in the previous two courses in this specialisation. Therefore, we recommend that if you find this course too technically challenging that you first complete the previous courses before re-commencing this one. Specifically, we expect you to be able to code basic HTML, CSS and Javascript before you take this course. \n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes.\n\nSHOW ALL ABOUT INTRODUCTION TO METEOR.JS DEVELOPMENT  \nSHOW ALL"
    },
    {
       "Url":"/learn/web-application-development?specialization=website-development",
       "name":"Web Application Development with JavaScript and MongoDB",
       "Rating":"Web Application Development with JavaScript and MongoDB\n4.6\nstars\n587 ratings\n•\n126 reviews\n\nIn this course, you will develop more advanced web application programming skills. You will learn how to control data read and write access using methods, publish and subscribe. You will learn how to access your database and server shells using command line tools. You will use the SimpleSchema system to validate data and generate input forms automatically. You will see a complete collaborative code editing environment, TextCircle, being built from scratch. \n\nAt the end of this course, you will be able to:\n- use Meteor methods to control data write access\n- use publish and subscribe to control data read access\n- install and use advanced Meteor packages\n- add user accounts to your applications\n- implement complex MongoDB filters\n- use the MongoDB and meteor server shells\n- define data validations schemas using SimpleSchema\n- generate data input forms automatically using SimpleSchema\n\nIn this course, you will complete:\n2 programming assignments taking ~4 hours each to complete\n4 quizzes, each taking ~20 minutes to complete\nmultiple practice quizzes, each taking ~5 minutes to complete\n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes\n\nSHOW ALL ABOUT WEB APPLICATION DEVELOPMENT WITH JAVASCRIPT AND MONGODB\nSHOW ALL"
    },
    {
       "Url":"/learn/responsive-website-examples?specialization=website-development",
       "name":"Responsive Website Tutorial and Examples",
       "Rating":"Responsive Website Tutorial and Examples\n4.2\nstars\n276 ratings\n•\n64 reviews\n\nIn this course, we will show you exciting examples of collaborative, interactive web applications that use various types of media including sound, images and big data. \n\nWe will show you how to build sites that provide precisely this functionality, using Meteor. We will also provide fully working example application code that you can use for your own commercial web projects. \n\nThe course also provides a range of advice and suggestions about how to develop bespoke web applications which match the requirements of clients, where clients are people who commission the product or people who use the product.  \n\nWe will take you through the development of the following applications:\n\n1.\tA portfolio website with collaborative blogging functionality.\n2.\tAn interactive, realtime, multi user music remixing system.\n3.\tAn interactive, online graffiti wall where users can collaborate to create graphics.\n4.\tAn interactive data visualisation platform for exploring and plotting big data in exciting ways.\n\nAt the end of this course, you will be able to:\n\n•\tImplement animated data visualisations and graphics using advanced user interface libraries such as vis.js \n•\tWork with external data sources \n•\tCreate multi user, realtime, collaborative environments\n•\tUse media APIs such as the Web Audio API\n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes.\n\nSHOW ALL ABOUT RESPONSIVE WEBSITE TUTORIAL AND EXAMPLES\nSHOW ALL"
    },
    {
       "Url":"/learn/responsive-web-design-capstone?specialization=website-development",
       "name":"Responsive Website Development and Design Capstone",
       "Rating":"Responsive Website Development and Design Capstone\n4.6\nstars\n56 ratings\n•\n15 reviews\n\nFor your Responsive Website Development and Design Specialization Capstone Project, you will create a complete, responsive, multi-user, data-driven website which aims to solve a particular problem. We encourage you to create a website addressing a problem that you are interested in!  However, if you don’t have an idea of your own, we have several that we will suggest in the course.  \n\nIn the capstone project, you will:\n1. Develop a complete website using the full range of skills learned during the specialisation\n2. Work through a structured process from idea generation to product delivery\n3. Document and receive feedback on the development of your project from an idea to a fully functional piece of software in a series of structured assignments including peer interactions\n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes.\n\nSHOW ALL ABOUT RESPONSIVE WEBSITE DEVELOPMENT AND DESIGN CAPSTONE \nSHOW ALL"
    },
    "/specializations/big-data-introduccion",
    {
       "Url":"/learn/impacto-datos-masivos?specialization=big-data-introduccion",
       "name":"Big Data: el impacto de los datos masivos en la sociedad actual",
       "Rating":"Big Data: el impacto de los datos masivos en la sociedad actual\n4.7\nstars\n1,916 ratings\n•\n722 reviews\n\nLa digitalización, la informática e Internet han producido lo que se puede denominar una revolución en la acumulación y utilización de datos. Podemos almacenar y conservar más datos que nunca antes en la historia. Podemos estudiarlos y analizarlos para tomar decisiones y mejorar procesos. Esta nueva capacidad tiene un enorme impacto en todos los ámbitos de la vida social.\n\nA lo largo de este curso:\n\n•\tConoceremos qué es el Big Data y cuáles son sus características fundamentales\n•\tExploraremos el crecimiento continuo de datos, analizaremos el impacto potencial en muchos campos de la actividad humana y nos preguntaremos por los retos y desafíos que suponen en todos los órdenes de la vida social. \n•\tConoceremos las características de cada una de las fases del procesamiento Big Data, adquiriendo un lenguaje adecuado para la descripción de los procesos. Dispondremos así de una visión de conjunto sobre sistema de tratamiento de grandes datos en la actualidad.\n•\tConoceremos las principales áreas de aplicación de los datos masivos. Qué tipos de transformaciones están imponiendo en la organización del trabajo y en la gestión. Qué desafíos imponen en la gobernanza, la economía y el trabajo. Qué mejoras introducen y qué riesgos representan.\n•\tEstudiaremos las principales tecnologías e infraestructuras para el almacenamiento y procesado de grandes volúmenes de datos.\n\nSHOW ALL ABOUT BIG DATA: EL IMPACTO DE LOS DATOS MASIVOS EN LA SOCIEDAD ACTUAL\nSHOW ALL"
    },
    {
       "Url":"/learn/adquisicion-almacenamiento-de-datos?specialization=big-data-introduccion",
       "name":"Big Data: adquisición y almacenamiento de datos",
       "Rating":"Big Data: adquisición y almacenamiento de datos\n4.4\nstars\n580 ratings\n•\n257 reviews\n\n¿Estás interesado en tener un conocimiento más detallado sobre las herramientas y aplicaciones Big Data?\n\nEn este curso aprenderás los principios para comprender la terminología, conceptos básicos y herramientas más importantes para resolver problemas de análisis de datos enfocándonos en los problemas y las aplicaciones. El objetivo es proporcionar una visión de sistema para entender los retos más importantes que nos encontramos cuando trabajamos en entornos con grandes volúmenes de datos.\n\nEn el curso se plantea una introducción a diversas herramientas utilizadas de forma común en la comunidad como Hadoop, Spark o Hive y tendrás que resolver diferentes retos de análisis de datos mediante su uso.\n\nAl terminar el curso habrás adquirido conocimientos sobre el ecosistema de herramientas Big Data incluyendo ejemplos de uso con problemas industriales y científicos. Tendrás una serie de recursos sobre cómo un análisis a realizar se traduce en  una serie de operaciones de recolección de datos, monitorización, almacenamiento, análisis y creación de informes sobre los resultados obtenidos. También adquirirás un criterio para elegir cuál es la herramienta más adecuada para resolver un cierto problema de análisis de datos a partir de los requerimientos de uso de las herramientas. \n\nEl curso está orientado tanto a estudiantes universitarios de primeros cursos de estudios universitarios relacionados con la informática, la ingeniería o las matemáticas, como a otros estudiantes con conocimientos de programación, interesados en aprender cómo utilizar de análisis de datos con herramientas de código abierto.  Para realizar los ejercicios es necesario utilizar una máquina virtual que deberá ser instalada en tu ordenador.\n\nSHOW ALL ABOUT BIG DATA: ADQUISICIÓN Y ALMACENAMIENTO DE DATOS\nSHOW ALL"
    },
    {
       "Url":"/learn/big-data-procesamiento-analisis?specialization=big-data-introduccion",
       "name":"Big Data: procesamiento y análisis",
       "Rating":"Big Data: procesamiento y análisis\n4.2\nstars\n228 ratings\n•\n89 reviews\n\nEl presente curso tiene como objetivo presentar los métodos y técnicas básicos para el procesamiento y análisis de datos en el contexto de Big Data. No prentende ser un curso exhaustivo sobre Machine Learning ni sobre métodos Estadísticos, simplemente se pretenden mostrar las características principales de estas técnicas para que el alumno pueda tener una visión general de las opciones que ofrece el análisis de datos para poder explorar, confirmar indicios y en definitiva, extraer conclusiones.\n\nEl curso está dirigido a estudiantes y profesionales que deseen aproximarse al procesamiento y análisis de datos en Big Data. Aunque no es un requisito indispensable tener experiencia en análisis de datos o en entornos Big Data, el curso puede resultar especialmente interesante  a estudiantes con ciertos conocimientos de análisis de datos que deseen introducirse en el entorno Big Data, por otro lado, también resultará interesante a aquellos estudiantes con cierta experiencia en entornos Big Data que deseen adquirir una mayor visión analítica. \n\nEn este sentido el curso pretende ofrecer recursos realistas en el contexto Big Data y por este motivo se trabajará des de una máquina virtual con la aplicación Jupyter como enlace para desarrollar los modelos y técnicas con PySpark.\n\nEl curso está dividido en 4 módulos más o menos independientes aunque se recomienda realizarlos de forma secuencial. \n\nEn el Módulo 1 se presentan los diferentes problemas y técnicas más habitules para analizar datos desde una perspectiva general. También se introduce el caso de estudio y las herramientas de trabajo que se emplearán. El resto de módulo está dedicado a la tarea de Exploración y Pre-Proceso de los datos, incluyendo consultas, tareas de gestión, resúmenes numéricos y gráficos. Los siguientes módulos se focalizan en las técnicas de análisis.\n\nEl Módulo 2 se centra en técnicas de modelización básicas, en particular regresión y regresión logística. Además de repasar las etapas de calibración del modelo, también se incluyen las etapas de validación y simplificación.\n\nEl módulo 3 está plenamente dedicado a la técnica de Árboles de Regresión y Clasificación. También se incluyen los bosques aleatorios.  \n\nEl módulo final contiene la técnica de Redes Neuronales para clasificación y también una introducción a las técnicas No Supervisadas, en particular, reducción de dimensión a través del análisis de componentes principales y la clasificación automática a través del análisis de clústers.\n\nSHOW ALL ABOUT BIG DATA: PROCESAMIENTO Y ANÁLISIS\nSHOW ALL"
    },
    {
       "Url":"/learn/big-data-visualizacion-datos?specialization=big-data-introduccion",
       "name":"Big Data: visualización de datos",
       "Rating":"Big Data: visualización de datos\n4.6\nstars\n149 ratings\n•\n60 reviews\n\n“Visualización de datos” es el cuarto curso de la especialización “Biga Data- Uso práctico de datos masivos. Organizado en cuatro semanas, tiene por objetivo motivar e introducir los conceptos clave de la visualización de datos así como mostrar ejemplos en diferentes contextos. Además, se proporcionan criterios para formular el problema y elegir las herramientas más adecuadas para obtener una correcta visualización. Este debe ser un curso introductorio, motivador e inspirador para la narración de historias a través de la visualización de sus datos.\n\nLos cuatro módulos en los que se estructura el curso son los siguientes:\nMÓDULO 1: Contexto para la visualización de datos hoy\nMÓDULO 2: Herramientas de análisis y visualización de datos\nMÓDULO 3: El proceso de creación de una visualización de datos\nMÓDULO 4: Otros aspectos de la visualización de datos\n\nSHOW ALL ABOUT BIG DATA: VISUALIZACIÓN DE DATOS\nSHOW ALL"
    },
    {
       "Url":"/learn/big-data-proyecto?specialization=big-data-introduccion",
       "name":"Big Data: capstone project",
       "Rating":"Big Data: capstone project\n4.7\nstars\n48 ratings\n•\n22 reviews\n\nEn este último curso de la Especialización Big Data el estudiante tendrá la oportunidad de aplicar algunas de las herramientas y métodos aprendidos en los cursos anteriores en un caso práctico.\n\nEl objetivo de este Capstone Project es mostrar un ejemplo del trabajo que se realiza diariamente en el departamento de Cosmología del Port d’Informació Científica, en Barcelona. Se trata de crear un clasificador para imágenes de galaxias, a partir de datos del proyecto GalaxyZoo e imágenes y datos del telescopio Sloan Digital Sky Survey. Los trabajos y ejercicios guiados llevarán al estudiante a la exploración y analisis de estos datos, hasta realizar una herramienta automática de Machine Learning.\n\nEl proceso seguido por los estudiantes en este curso se podría aplicar en cualquier otra disciplina, por ejemplo en las ciencias sociales, en un estudio de mercado o en cualquier ámbito que comporte toma de decisiones a partir de un gran volumen de datos.\n\nSHOW ALL ABOUT BIG DATA: CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/machine-learning-for-everyone",
    {
       "Url":"/learn/the-power-of-machine-learning?specialization=machine-learning-for-everyone",
       "name":"The Power of Machine Learning: Boost Business, Accumulate Clicks, Fight Fraud, and Deny Deadbeats",
       "Rating":"The Power of Machine Learning: Boost Business, Accumulate Clicks, Fight Fraud, and Deny Deadbeats\n4.8\nstars\n123 ratings\n•\n53 reviews\n\nIt's the age of machine learning. Companies are seizing upon the power of this technology to combat risk, boost sales, cut costs, block fraud, streamline manufacturing, conquer spam, toughen crime fighting, and win elections.\n\nWant to tap that potential? It's best to start with a holistic, business-oriented course on machine learning – no matter whether you’re more on the tech or the business side. After all, successfully deploying machine learning relies on savvy business leadership just as much as it relies on technical skill. And for that reason, data scientists aren't the only ones who need to learn the fundamentals. Executives, decision makers, and line of business managers must also ramp up on how machine learning works and how it delivers business value.\n\nAnd the reverse is true as well: Techies need to look beyond the number crunching itself and become deeply familiar with the business demands of machine learning. This way, both sides speak the same language and can collaborate effectively.\n\nThis course will prepare you to participate in the deployment of machine learning – whether you'll do so in the role of enterprise leader or quant. In order to serve both types, this course goes further than typical machine learning courses, which cover only the technical foundations and core quantitative techniques. This curriculum uniquely integrates both sides – both the business and tech know-how – that are essential for deploying machine learning. It covers:\n\n– How launching machine learning – aka predictive analytics – improves marketing, financial services, fraud detection, and many other business operations\n\n– A concrete yet accessible guide to predictive modeling methods, delving most deeply into decision trees\n\n– Reporting on the predictive performance of machine learning and the profit it generates\n\n– What your data needs to look like before applying machine learning\n\n– Avoiding the hype and false promises of “artificial intelligence”\n\n– AI ethics: social justice concerns, such as when predictive models blatantly discriminate by protected class\n\nNO HANDS-ON AND NO HEAVY MATH. This concentrated entry-level program is totally accessible to business leaders – and yet totally vital to data scientists who want to secure their business relevance. It's for anyone who wishes to participate in the commercial deployment of machine learning, no matter whether you'll play a role on the business side or the technical side. This includes business professionals and decision makers of all kinds, such as executives, directors, line of business managers, and consultants – as well as data scientists.\n\nBUT TECHNICAL LEARNERS SHOULD TAKE ANOTHER LOOK. Before jumping straight into the hands-on, as quants are inclined to do, consider one thing: This curriculum provides complementary know-how that all great techies also need to master. It contextualizes the core technology, guiding you on the end-to-end process required to successfully deploy a predictive model so that it delivers a business impact.\n\nLIKE A UNIVERSITY COURSE. This course is also a good fit for college students, or for those planning for or currently enrolled in an MBA program. The breadth and depth of the overall three-course specialization is equivalent to one full-semester MBA or graduate-level course.\n\nIN-DEPTH YET ACCESSIBLE. Brought to you by industry leader Eric Siegel – a winner of teaching awards when he was a professor at Columbia University – this curriculum stands out as one of the most thorough, engaging, and surprisingly accessible on the subject of machine learning.\n\nVENDOR-NEUTRAL. This course includes illuminating software demos of machine learning in action using SAS products. However, the curriculum is vendor-neutral and universally-applicable. The contents and learning objectives apply, regardless of which machine learning software tools you end up choosing to work with.\n\nSHOW ALL ABOUT THE POWER OF MACHINE LEARNING: BOOST BUSINESS, ACCUMULATE CLICKS, FIGHT FRAUD, AND DENY DEADBEATS\nSHOW ALL"
    },
    {
       "Url":"/learn/launching-machine-learning-leadership?specialization=machine-learning-for-everyone",
       "name":"Launching Machine Learning: Delivering Operational Success with Gold Standard ML Leadership",
       "Rating":"Launching Machine Learning: Delivering Operational Success with Gold Standard ML Leadership\n4.9\nstars\n64 ratings\n•\n23 reviews\n\nMachine learning runs the world. It generates predictions for each individual customer, employee, voter, and suspect, and these predictions drive millions of business decisions more effectively, determining whom to call, mail, approve, test, diagnose, warn, investigate, incarcerate, set up on a date, or medicate. \n\nBut, to make this work, you've got to bridge what is a prevalent gap between business leadership and technical know-how. Launching machine learning is as much a management endeavor as a technical one. Its success relies on a very particular business leadership practice. This means that two different species must cooperate in harmony: the business leader and the quant. \n\nThis course will guide you to lead or participate in the end-to-end implementation of machine learning (aka predictive analytics). Unlike most machine learning courses, it prepares you to avoid the most common management mistake that derails machine learning projects: jumping straight into the number crunching before establishing and planning for a path to operational deployment.\n\nWhether you'll participate on the business or tech side of a machine learning project, this course delivers essential, pertinent know-how. You'll learn the business-level fundamentals needed to ensure the core technology works within - and successfully produces value for - business operations. If you're more a quant than a business leader, you'll find this is a rare opportunity to ramp up on the business side, since technical ML trainings don't usually go there. But know this: The soft skills are often the hard ones.\n\nAfter this course, you will be able to:\n\n- Apply ML: Identify the opportunities where machine learning can improve marketing, sales, financial credit scoring, insurance, fraud detection, and much more.\n\n- Plan ML: Determine the way in which machine learning will be operationally integrated and deployed, and the staffing and data requirements to get there. \n\n- Greenlight ML: Forecast the effectiveness of a machine learning project and then internally sell it, gaining buy-in from your colleagues.\n\n- Lead ML: Manage a machine learning project, from the generation of predictive models to their launch.\n\n- Prep data for ML: Oversee the data preparation, which is directly informed by business priorities.\n\n- Evaluate ML: Report on the performance of predictive models in business terms, such as profit and ROI.\n\n- Regulate ML: Manage ethical pitfalls, such as when predictive models reveal sensitive information about individuals, including whether they're pregnant, will quit their job, or may be arrested - aka AI ethics.\n\nNO HANDS-ON AND NO HEAVY MATH. Rather than a hands-on training, this course serves both business leaders and burgeoning data scientists alike by contextualizing the core technology, guiding you on the end-to-end process required to successfully deploy a predictive model so that it delivers a business impact. There are no exercises involving coding or the use of machine learning software.\n\nWHO IT'S FOR. This concentrated entry-level program is for anyone who wishes to participate in the commercial deployment of machine learning, no matter whether you'll do so in the role of enterprise leader or quant. This includes business professionals and decision makers of all kinds, such as executives, directors, line of business managers, and consultants - as well as data scientists.\n\nLIKE A UNIVERSITY COURSE. This course is also a good fit for college students, or for those planning for or currently enrolled in an MBA program. The breadth and depth of the overall three-course specialization is equivalent to one full-semester MBA or graduate-level course.\n\nIN-DEPTH YET ACCESSIBLE. Brought to you by industry leader Eric Siegel - a winner of teaching awards when he was a professor at Columbia University - this curriculum stands out as one of the most thorough, engaging, and surprisingly accessible on the subject of machine learning. \n\nVENDOR-NEUTRAL. This specialization includes illuminating software demos of machine learning in action using SAS products. However, the curriculum is vendor-neutral and universally-applicable. The contents and learning objectives apply, regardless of which machine learning software tools you end up choosing to work with. \n\nPREREQUISITES. Before this course, learners should take the first of this specialization's three courses, \"The Power of Machine Learning: Boost Business, Accumulate Clicks, Fight Fraud, and Deny Deadbeats.\"\n\nSHOW ALL ABOUT LAUNCHING MACHINE LEARNING: DELIVERING OPERATIONAL SUCCESS WITH GOLD STANDARD ML LEADERSHIP\nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-under-the-hood?specialization=machine-learning-for-everyone",
       "name":"Machine Learning Under the Hood: The Technical Tips, Tricks, and Pitfalls",
       "Rating":"Machine Learning Under the Hood: The Technical Tips, Tricks, and Pitfalls\n4.8\nstars\n52 ratings\n•\n23 reviews\n\nMachine learning. Your team needs it, your boss demands it, and your career loves it. After all, LinkedIn places it as one of the top few \"Skills Companies Need Most\" and as the very top emerging job in the U.S.\n\nIf you want to participate in the deployment of machine learning (aka predictive analytics), you've got to learn how it works. Even if you work as a business leader rather than a hands-on practitioner – even if you won't crunch the numbers yourself – you need to grasp the underlying mechanics in order to help navigate the overall project. Whether you're an executive, decision maker, or operational manager overseeing how predictive models integrate to drive decisions, the more you know, the better.\n\nAnd yet, looking under the hood will delight you. The science behind machine learning intrigues and surprises, and an intuitive understanding is not hard to come by. With its impact on the world growing so quickly, it's time to demystify the predictive power of data – and how to scientifically tap it.\n\nThis course will show you how machine learning works. It covers the foundational underpinnings, the way insights are gleaned from data, how we can trust these insights are reliable, and how well predictive models perform – which can be established with pretty straightforward arithmetic. These are things every business professional needs to know, in addition to the quants.\n\nAnd this course continues beyond machine learning standards to also cover cutting-edge, advanced methods, as well as preparing you to circumvent prevalent pitfalls that seldom receive the attention they deserve. The course dives deeply into these topics, and yet remains accessible to non-technical learners and newcomers.\n\nWith this course, you'll learn what works and what doesn't – the good, the bad, and the fuzzy: \n\n– How predictive modeling algorithms work, including decision trees, logistic regression, and neural networks\n\n– Treacherous pitfalls such as overfitting, p-hacking, and presuming causation from correlations\n\n– How to interpret a predictive model in detail and explain how it works\n\n– Advanced methods such as ensembles and uplift modeling (aka persuasion modeling)\n\n– How to pick a tool, selecting from the many machine learning software options\n\n– How to evaluate a predictive model, reporting on its performance in business terms\n\n– How to screen a predictive model for potential bias against protected classes – aka AI ethics\n\nIN-DEPTH YET ACCESSIBLE. Brought to you by industry leader Eric Siegel – a winner of teaching awards when he was a professor at Columbia University – this curriculum stands out as one of the most thorough, engaging, and surprisingly accessible on the subject of machine learning.\n\nNO HANDS-ON AND NO HEAVY MATH. Rather than a hands-on training, this course serves both business leaders and burgeoning data scientists alike with expansive coverage of the state-of-the-art techniques and the most pernicious pitfalls. There are no exercises involving coding or the use of machine learning software. However, for one of the assessments, you'll perform a hands-on exercise, creating a predictive model by hand in Excel or Google Sheets and visualizing how it improves before your eyes.\n\nBUT TECHNICAL LEARNERS SHOULD TAKE ANOTHER LOOK. Before jumping straight into the hands-on, as quants are inclined to do, consider one thing: This curriculum provides complementary know-how that all great techies also need to master. It contextualizes the core technology with a strong conceptual framework and covers topics that are generally omitted from even the most technical of courses, including uplift modeling (aka persuasion modeling) and some particularly treacherous pitfalls.\n\nVENDOR-NEUTRAL. This course includes illuminating software demos of machine learning in action using SAS products. However, the curriculum is vendor-neutral and universally-applicable. The contents and learning objectives apply, regardless of which machine learning software tools you end up choosing to work with.\n\nPREREQUISITES. Before this course, learners should take the first two of this specialization's three courses, \"The Power of Machine Learning\" and \"Launching Machine Learning.\"\n\nSHOW ALL ABOUT MACHINE LEARNING UNDER THE HOOD: THE TECHNICAL TIPS, TRICKS, AND PITFALLS\nSHOW ALL"
    },
    "/specializations/social-media-marketing-practice",
    {
       "Url":"/learn/social-media-digital-marketing-fundamentals?specialization=social-media-marketing-practice",
       "name":"Social Media and Digital Marketing Fundamentals",
       "Rating":"Social Media and Digital Marketing Fundamentals\n4.8\nstars\n20 ratings\n•\n6 reviews\n\nDigital Marketing Institute is the global standard in Digital Marketing Certification. Our mission is to give our students the confidence and knowledge they need to advance in their careers through this specialization.\n\nDigital and mobile technology coupled with the explosive adoption of social media globally has fundamentally disrupted consumer expectations, and how businesses must operate to support their customers. If you want to understand the forces driving and transforming businesses today and how cutting-edge digital and social strategies can help businesses thrive in a dynamic environment, this course will help you do so.\n\nYou will learn the core principles and foundations of digital marketing before diving deeper into the disciplines of social media marketing and content marketing. After completing the course you will: -\n•\tUnderstand how digital and social media have disrupted the way businesses sell to consumers\n•\tRecognize how marketers use the customer journey model to influence purchase decisions on digital platforms using digital content and tools\n•\tAppreciate the benefits of integrating traditional and digital marketing with the advantages of inbound and outbound marketing strategies\n•\tRecognize how to use the principles of effective content marketing to create content that engages an audience\n\nThis course also explains how to choose the right content for consumers – and how to ensure it gets seen by them. It outlines the different content formats available on social media and which platform best suits specific needs. This is the first course in the Digital Marketing Institute's Social Media Marketing specialization.\n\nOn completion of all courses in your Specialization, you will also be awarded a Digital Marketing Institute Certified Digital Marketing Associate certification, along with three months of free Power Membership, allowing you to boost your career and unlock your next opportunity. 92% of DMI members have said their courses have had a positive impact on their careers, while 88% are now working at senior or manager level.\n\nSHOW ALL ABOUT SOCIAL MEDIA AND DIGITAL MARKETING FUNDAMENTALS\nSHOW ALL"
    },
    {
       "Url":"/learn/social-media-social-content-strategy?specialization=social-media-marketing-practice",
       "name":"Social Media and Social Content Strategy",
       "Rating":"Social Media and Social Content Strategy\n\nDigital Marketing Institute is the global standard in Digital Marketing Certification. Our mission is to give our students the confidence and knowledge they need to advance in their careers through this specialization.\n\nMore than 3.6 billion people globally are using social media in 2021 so social is certainly popular. But with advertising spend on social expected to surpass $100 billion in 2021, clearly social media is as much about big business, competition, and profit as it is about connecting people. If you want to understand the forces transforming businesses today and, in particular, the key challenges facing social media marketers as they attempt to cut through the noise, engage their audiences, and demonstrate tangible business value, this course will help you do so.\n\nYou will learn the core principles of social media marketing before drilling deeper into engaging, nurturing, and building a loyal social community. After completing this course, you will be able to: -\n•\tIdentify the benefits and advantages to a business of using social media to engage an audience\n•\tDifferentiate between the social platforms used by businesses and their relative advantages for targeting consumers\n•\tSet up a social media account for a business\n•\tBuild, manage, and sustain an active social media community\n\nThis course also introduces social content strategy and explains how to balance the advantages of organic social content seeding against the immediacy of paid social content promotion. It covers how to implement a content strategy and the basics of measuring its effectiveness. This is the second course in the Digital Marketing Institute’s Social Media Marketing specialization.\n\nOn completion of all courses in your Specialization, you will also be awarded a Digital Marketing Institute Certified Digital Marketing Associate certification, along with three months of free Power Membership, allowing you to boost your career and unlock your next opportunity. 92% of DMI members have said their courses have had a positive impact on their careers, while 88% are now working at senior or manager level.\n\nSHOW ALL ABOUT SOCIAL MEDIA AND SOCIAL CONTENT STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/facebook-instagram-snapchat-marketing?specialization=social-media-marketing-practice",
       "name":"Facebook, Instagram, and Snapchat Marketing",
       "Rating":"Facebook, Instagram, and Snapchat Marketing\n\nDigital Marketing Institute is the global standard in Digital Marketing Certification. Our mission is to give our students the confidence and knowledge they need to advance in their careers through this specialization.\n\nFacebook is the oldest of the social networks, and the biggest, with approximately 2.7 billion monthly active users in 2021. Instagram has become a key platform for businesses striving to engage women aged 18 – 24 when shopping online. If teenagers and young adults are an important target audience, should businesses also include Snapchat in their social marketing mix? If you want to better understand the ever-changing social media landscape and the challenges marketers face to make their brand stand out from the crowd, this course will help you do so.\n\nYou will learn how to get started with marketing on Facebook, Instagram, and Snapchat. After completing this course, you will be able to: -\n•\tSet up and optimize a Facebook Page to promote a business\n•\tUse Facebook Ads Manager to build effective advertising campaigns\n•\tDifferentiate between the advantages of including Instagram and Snapchat in advertising campaigns\n•\tUse best practices to help build a business’s brand with Facebook, Instagram, and Snapchat\n\nThis course also introduces how to measure the performance of Facebook, Instagram, and Snapchat advertising campaigns using analytics. It covers the key metrics to track and how to derive insights using native platform tools. This is the third course in the Digital Marketing Institute’s Social Media Marketing specialization.\n\nOn completion of all courses in your Specialization, you will also be awarded a Digital Marketing Institute Certified Digital Marketing Associate certification, along with three months of free Power Membership, allowing you to boost your career and unlock your next opportunity. 92% of DMI members have said their courses have had a positive impact on their careers, while 88% are now working at senior or manager level.\n\nSHOW ALL ABOUT FACEBOOK, INSTAGRAM, AND SNAPCHAT MARKETING\nSHOW ALL"
    },
    {
       "Url":"/learn/twitter-linkedin-youtube-marketing?specialization=social-media-marketing-practice",
       "name":"Twitter, LinkedIn, and YouTube Marketing",
       "Rating":"Twitter, LinkedIn, and YouTube Marketing\n\nDigital Marketing Institute is the global standard in Digital Marketing Certification. Our mission is to give our students the confidence and knowledge they need to advance in their careers through this specialization.\n\nYouTube is second only to Facebook in popularity as a social network in 2021, with almost 2.3 billion active users. Twitter has introduced new fact-checking tools in response to recent controversies and remains a key platform for businesses striving to serve and engage audiences in real-time. LinkedIn is critical for B2B marketing, both for organic and paid social content distribution. If you want to better understand the ever-shifting landscape and challenges marketers face to grow and sustain brands on social, this course will help you do so.\n\nYou will learn the basic principles of advertising on Twitter, LinkedIn, and YouTube. After completing this course, you will be able to: -\n•\tApply best practices for publishing tweets and using hashtags on Twitter\n•\tManage and optimize the performance of Twitter advertising campaigns\n•\tBuild a company’s presence on LinkedIn\n•\tMeasure the performance of LinkedIn advertising campaigns\n•\tRecognize the key role of social video and YouTube for online marketing\n•\tCreate engaging advertising campaigns to run on YouTube\n\nThis course also introduces the concepts of social selling and personal branding for B2B sales and marketing. It covers the differences between traditional and social selling and why businesses are adopting social selling tactics to engage with buyers. This is the final course in the Digital Marketing Institute’s Social Media Marketing specialization.\n\nOn completion of all courses in your Specialization, you will also be awarded a Digital Marketing Institute Certified Digital Marketing Associate certification, along with three months of free Power Membership, allowing you to boost your career and unlock your next opportunity. 92% of DMI members have said their courses have had a positive impact on their careers, while 88% are now working at senior or manager level.\n\nSHOW ALL ABOUT TWITTER, LINKEDIN, AND YOUTUBE MARKETING\nSHOW ALL"
    },
    "/specializations/jhu-data-visualization-dashboarding-with-r",
    {
       "Url":"/learn/jhu-getting-started-data-viz-r?specialization=jhu-data-visualization-dashboarding-with-r",
       "name":"Getting Started with Data Visualization in R",
       "Rating":"Getting Started with Data Visualization in R\n4.8\nstars\n108 ratings\n•\n33 reviews\n\nData visualization is a critical skill for anyone that routinely using quantitative data in his or her work - which is to say that data visualization is a tool that almost every worker needs today. One of the critical tools for data visualization today is the R statistical programming language. Especially in conjunction with the tidyverse software packages, R has become an extremely powerful and flexible platform for making figures, tables, and reproducible reports. However, R can be intimidating for first time users, and there are so many resources online that it can be difficult to sort through without guidance.\n\nTo fill that need, this course is intended for learners who have little or no experience with R but who are looking for an introduction to this tool. By the end of this course, students will be able to import data into R, manipulate that data using tools from the popular tidyverse package, and make simple reports using R Markdown. The course is designed for students with good basic computing skills, but limited if any experience with programming.\n\nSHOW ALL ABOUT GETTING STARTED WITH DATA VISUALIZATION IN R\nSHOW ALL"
    },
    {
       "Url":"/learn/jhu-data-visualization-r?specialization=jhu-data-visualization-dashboarding-with-r",
       "name":"Data Visualization in R with ggplot2",
       "Rating":"Data Visualization in R with ggplot2\n5.0\nstars\n52 ratings\n•\n11 reviews\n\nData visualization is a critical skill for anyone that routinely using quantitative data in his or her work - which is to say that data visualization is a tool that almost every worker needs today. One of the critical tools for data visualization today is the R statistical programming language. Especially in conjunction with the tidyverse software packages, R has become an extremely powerful and flexible platform for making figures, tables, and reproducible reports. However, R can be intimidating for first time users, and there are so many resources online that it can be difficult to sort through without guidance.\n\nThis course is the second in a specialization in Data Visualization offered by Johns Hopkins. It is intended for learners who have either have some experience with R and data wrangling in the tidyverse or have taken the previous course in the specialization. The focus in this course learning to use ggplot2 to make a variety of visualizations and to polish those visualizations using tools within ggplot as well as vector graphics editing software. The course will not go into detail about how the data management works behind the scenes.\n\nSHOW ALL ABOUT DATA VISUALIZATION IN R WITH GGPLOT2\nSHOW ALL"
    },
    {
       "Url":"/learn/jhu-advanced-data-visualization-r?specialization=jhu-data-visualization-dashboarding-with-r",
       "name":"Advanced Data Visualization with R",
       "Rating":"Advanced Data Visualization with R\n4.8\nstars\n30 ratings\n•\n10 reviews\n\nData visualization is a critical skill for anyone that routinely using quantitative data in his or her work - which is to say that data visualization is a tool that almost every worker needs today. One of the critical tools for data visualization today is the R statistical programming language. Especially in conjunction with the tidyverse software packages, R has become an extremely powerful and flexible platform for making figures, tables, and reproducible reports. However, R can be intimidating for first time users, and there are so many resources online that it can be difficult to sort through without guidance.\n\nThis course is the third in the Specialization \"Data Visualization and Dashboarding in R.\"  Learners come into this course with a foundation using R to make many basic kinds of visualization, primarily with the ggplot2 package. Accordingly, this course focuses on expanding the learners' inventory of data visualization options. Drawing on additional packages to supplement ggplot2, learners will made more variants of traditional figures, as well as venture into spatial data. The course ends make interactive and animated figures.\n\nTo fill that need, this course is intended for learners who have little or no experience with R but who are looking for an introduction to this tool. By the end of this course, students will be able to import data into R, manipulate that data using tools from the popular tidyverse package, and make simple reports using R Markdown. The course is designed for students with good basic computing skills, but limited if any experience with programming.\n\nSHOW ALL ABOUT ADVANCED DATA VISUALIZATION WITH R\nSHOW ALL"
    },
    {
       "Url":"/learn/data-viz-shiny-dashboards?specialization=jhu-data-visualization-dashboarding-with-r",
       "name":"Publishing Visualizations in R with Shiny and flexdashboard",
       "Rating":"Publishing Visualizations in R with Shiny and flexdashboard\n4.9\nstars\n21 ratings\n•\n7 reviews\n\nData visualization is a critical skill for anyone that routinely using quantitative data in his or her work - which is to say that data visualization is a tool that almost every worker needs today. One of the critical tools for data visualization today is the R statistical programming language. Especially in conjunction with the tidyverse software packages, R has become an extremely powerful and flexible platform for making figures, tables, and reproducible reports. However, R can be intimidating for first time users, and there are so many resources online that it can be difficult to sort through without guidance.\n\nThis course is the fourth in the Specialization \"Data Visualization and Dashboarding in R.\" Learners will come to this course with a strong background in making visualization in R using ggplot2. To build on those skills, this course covers creating interactive visualization using Shiny, as well as combining different kinds of figures made in R into interactive dashboards.\n\nSHOW ALL ABOUT PUBLISHING VISUALIZATIONS IN R WITH SHINY AND FLEXDASHBOARD\nSHOW ALL"
    },
    {
       "Url":"/learn/data-visualization-capstone?specialization=jhu-data-visualization-dashboarding-with-r",
       "name":"Data Visualization Capstone",
       "Rating":"Data Visualization Capstone\n4.9\nstars\n14 ratings\n•\n5 reviews\n\nData visualization is a critical skill for anyone that routinely using quantitative data in his or her work - which is to say that data visualization is a tool that almost every worker needs today. One of the critical tools for data visualization today is the R statistical programming language. Especially in conjunction with the tidyverse software packages, R has become an extremely powerful and flexible platform for making figures, tables, and reproducible reports. However, R can be intimidating for first time users, and there are so many resources online that it can be difficult to sort through without guidance.\n\nThis is the final course in the Specialization \"Data Visualization and Dashboarding in R.\" Learners in this course will enter with a well-developed set of skills making a wide variety of visualizations in R. The focus on this course will applying those skills to a unique project, drawing on publicly available data to tell a compelling story using the data visualization toolkit assembled in the previous courses.\n\nSHOW ALL ABOUT DATA VISUALIZATION CAPSTONE\nSHOW ALL"
    },
    "/specializations/graphic-design-elements-non-designers",
    {
       "Url":"/learn/basic-elements-design?specialization=graphic-design-elements-non-designers",
       "name":"Basic Elements of Design: Design Principles and Software Overview",
       "Rating":"Basic Elements of Design: Design Principles and Software Overview\n4.7\nstars\n729 ratings\n•\n163 reviews\n\nDesigning for an organization, while requiring technical skill, is not just about knowing how to use a pagination program such as InDesign or manipulate photos using Photoshop. A designer is a visual storyteller, a person who pairs words with images and typography to best convey information to an audience. Good design evokes emotion and presents the news of the day with clarity and the proper tone. A business card, brochure, or website that has good design provides content that is more inviting, more easily comprehensible and is faster to process. Design isn’t about “making it look pretty,” it’s also about content, layout and audience analysis.\n\nSHOW ALL ABOUT BASIC ELEMENTS OF DESIGN: DESIGN PRINCIPLES AND SOFTWARE OVERVIEW\nSHOW ALL"
    },
    {
       "Url":"/learn/graphic-elements-design?specialization=graphic-design-elements-non-designers",
       "name":"Graphic Elements of Design: Color Theory and Image Formats",
       "Rating":"Graphic Elements of Design: Color Theory and Image Formats\n4.7\nstars\n430 ratings\n•\n119 reviews\n\nExamining and exploring the various types of images and graphic elements will be the focus of this course. We will start with color theory to distinguish between CMYK, Pantone and RGB color options and their usages. Then we will review the various types of images used in both print and digital design projects. Finally we will look at logo designs to determine what makes for the best images and graphic elements for corporate branding and imaging.\n\nSHOW ALL ABOUT GRAPHIC ELEMENTS OF DESIGN: COLOR THEORY AND IMAGE FORMATS\nSHOW ALL"
    },
    {
       "Url":"/learn/fonts-typography-spacing?specialization=graphic-design-elements-non-designers",
       "name":"Textual Elements of Design: Fonts, Typography, and Spacing",
       "Rating":"Textual Elements of Design: Fonts, Typography, and Spacing\n4.7\nstars\n191 ratings\n•\n42 reviews\n\nGraphic design is telling a story by using both images and text. With that definition in mind, this course will focus on the textual elements of graphic design. From the history of typography, the difference between type, fonts and text as well as exposure to typography spacing, students will learn the value of selecting the best kind of type and combinations of fonts to get their message across in a visually pleasing manner.\n\nSHOW ALL ABOUT TEXTUAL ELEMENTS OF DESIGN: FONTS, TYPOGRAPHY, AND SPACING\nSHOW ALL"
    },
    {
       "Url":"/learn/designing-print-digital-media?specialization=graphic-design-elements-non-designers",
       "name":"Print and Digital Elements of Design: Branding and User Experience",
       "Rating":"Print and Digital Elements of Design: Branding and User Experience\n4.8\nstars\n210 ratings\n•\n40 reviews\n\nGraphic design projects can be delivered in either a printed format or a digital format, or both. This course will look at how to work with creative professionals to get the ideal usage out of a design to use in print medium such as logos, brochures and larger printed projects that will also carry over as seamlessly as possible into the digital realm of websites and social media. We will also cover the user experience and how to keep the end result in mind when working on creative endeavors.\n\nSHOW ALL ABOUT PRINT AND DIGITAL ELEMENTS OF DESIGN: BRANDING AND USER EXPERIENCE\nSHOW ALL"
    },
    "/specializations/hands-on-python",
    {
       "Url":"/learn/codio-python-basics?specialization=hands-on-python",
       "name":"Python Basics: Selection and Iteration",
       "Rating":"Python Basics: Selection and Iteration\n4.7\nstars\n45 ratings\n•\n16 reviews\n\nCode and run your first python program in minutes without installing anything!\n\nThis course is designed for learners with no coding experience, providing a solid foundation of not just python, but core Computer Science topics that can be transferred to other languages. The modules in this course cover printing, operators, iteration (i.e., loops), and selection (i.e., conditionals).\n\nTo allow for a truly hands-on, self-paced learning experience, this course is video-free. Assignments contain short explanations with images and runnable code examples with suggested edits to explore code examples further, building a deeper understanding by doing. You'll benefit from instant feedback from a variety of assessment items along the way, gently progressing from quick understanding checks (multiple choice, fill in the blank, and un-scrambling code blocks) to small, approachable coding exercises that take minutes instead of hours.\n\nSHOW ALL ABOUT PYTHON BASICS: SELECTION AND ITERATION\nSHOW ALL"
    },
    {
       "Url":"/learn/python-basic-structures-lists-strings-and-files?specialization=hands-on-python",
       "name":"Python Basic Structures: Lists, Strings, and Files",
       "Rating":"Python Basic Structures: Lists, Strings, and Files\n4.7\nstars\n10 ratings\n•\n3 reviews\n\nCode and run your first python program in minutes without installing anything!\n\nThis course is designed for learners with limited coding experience, providing a solid foundation of not just python, but core Computer Science topics that can be transferred to other languages. The modules in this course cover lists, strings, and files. Completion of Python Basics: Selection and Iteration before taking this course is recommended.\n\nTo allow for a truly hands-on, self-paced learning experience, this course is video-free. Assignments contain short explanations with images and runnable code examples with suggested edits to explore code examples further, building a deeper understanding by doing. You'll benefit from instant feedback from a variety of assessment items along the way, gently progressing from quick understanding checks (multiple choice, fill in the blank, and un-scrambling code blocks) to small, approachable coding exercises that take minutes instead of hours.\n\nSHOW ALL ABOUT PYTHON BASIC STRUCTURES: LISTS, STRINGS, AND FILES\nSHOW ALL"
    },
    {
       "Url":"/learn/python-object-basics?specialization=hands-on-python",
       "name":"Python Object Basics: Functions, Recursion, and Objects",
       "Rating":"Python Object Basics: Functions, Recursion, and Objects\n\nCode and run your first python program in minutes without installing anything!\n\nThis course is designed for learners with limited coding experience, providing a solid foundation of not just python, but core Computer Science topics that can be transferred to other languages. The modules in this course cover functions, recursion, objects, and mutability. Completion of the prior 2 courses in this specialization are recommended.\n\nTo allow for a truly hands-on, self-paced learning experience, this course is video-free. Assignments contain short explanations with images and runnable code examples with suggested edits to explore code examples further, building a deeper understanding by doing. You'll benefit from instant feedback from a variety of assessment items along the way, gently progressing from quick understanding checks (multiple choice, fill in the blank, and un-scrambling code blocks) to small, approachable coding exercises that take minutes instead of hours.\n\nSHOW ALL ABOUT PYTHON OBJECT BASICS: FUNCTIONS, RECURSION, AND OBJECTS\nSHOW ALL"
    },
    {
       "Url":"/learn/object-oriented-python?specialization=hands-on-python",
       "name":"Object-Oriented Python: Inheritance and Encapsulation",
       "Rating":"Object-Oriented Python: Inheritance and Encapsulation\n4.4\nstars\n19 ratings\n•\n8 reviews\n\nCode and run your first python program in minutes without installing anything!\n\nThis course is designed for learners with limited coding experience, providing a solid foundation of not just python, but core Computer Science topics that can be transferred to other languages. The modules in this course cover inheritance, encapsulation, polymorphism, and other object-related topics. Completion of the prior 3 courses in this specialization is recommended.\n\nTo allow for a truly hands-on, self-paced learning experience, this course is video-free. Assignments contain short explanations with images and runnable code examples with suggested edits to explore code examples further, building a deeper understanding by doing. You'll benefit from instant feedback from a variety of assessment items along the way, gently progressing from quick understanding checks (multiple choice, fill in the blank, and un-scrambling code blocks) to small, approachable coding exercises that take minutes instead of hours.\n\nSHOW ALL ABOUT OBJECT-ORIENTED PYTHON: INHERITANCE AND ENCAPSULATION\nSHOW ALL"
    },
    "/specializations/digital-advertising-strategy",
    {
       "Url":"/learn/digital-advertising-landscape?specialization=digital-advertising-strategy",
       "name":"Introduction to the Digital Advertising Landscape",
       "Rating":"Introduction to the Digital Advertising Landscape\n4.5\nstars\n298 ratings\n•\n79 reviews\n\nThe digital advertising landscape is complex. There are many different types of ads, including: display, video, audio, sponsored, native, social media and search. Consumer data and the ad tech that action on that data are both ubiquitous and complicated. As a result the sheer number of options available to digital marketers is hard to comprehend and manage. This course covers the major forms of digital advertising, from basic display ads to search to cutting-edge programmatic advertising concepts. The Trade Desk, the leading programmatic advertising provider, joins us as our programmatic experts and offers an actionable roadmap on how small businesses can leverage state of the art advertising technologies to accomplish business objectives. In all, this course leaves students with an understanding of digital advertising in its various forms, and how to strategically identify digital advertising opportunities.\n\nSHOW ALL ABOUT INTRODUCTION TO THE DIGITAL ADVERTISING LANDSCAPE\nSHOW ALL"
    },
    {
       "Url":"/learn/search-advertising?specialization=digital-advertising-strategy",
       "name":"Search Advertising",
       "Rating":"Search Advertising\n4.5\nstars\n73 ratings\n•\n18 reviews\n\nConsumers search for virtually everything. This includes the things that small businesses do, from restaurants to bespoke products. When consumers search they get organic results along with paid results. Paid search ads are systematically designed to be relevant. As a result, they’re often useful at getting consumers where they want to go. Consumers don’t tune out paid search like other types of digital ads. \n\nSearch ads can be a small business opportunity. While larger advertisers pay massive amounts to place their ads via search, we highlight smart ways small businesses can create their own tailored search campaigns on small budgets. \n\nThis course shows small businesses how to create and execute search campaigns on Google Ads Search (formally AdWords). Through an introductory overview, students are guided through the official Google Ads Search training materials where they will ultimately earn an official Google Ads Search Certification. Beyond Google materials, practical campaign creation and optimization best practices and exercises are provided by real experts.\n\nSHOW ALL ABOUT SEARCH ADVERTISING\nSHOW ALL"
    },
    {
       "Url":"/learn/social-media-advertising?specialization=digital-advertising-strategy",
       "name":"Social Media Advertising",
       "Rating":"Social Media Advertising\n4.7\nstars\n269 ratings\n•\n78 reviews\n\nSocial media platforms are driven by digital advertising. As a result, social media advertising is affordable and can be purchased at almost any budget. Targeting options in social media advertising are also sophisticated. It is possible to tailor ads around a user’s behaviors (e.g., likes, posts and clicks). This course unpacks small business use cases of Facebook, Instagram and Twitter advertising. From basic campaigns, to advanced techniques including lookalike modeling and audience retargeting, this course shows how to effectively advertise on three major social media platforms.\n\nSHOW ALL ABOUT SOCIAL MEDIA ADVERTISING\nSHOW ALL"
    },
    {
       "Url":"/learn/native-advertising?specialization=digital-advertising-strategy",
       "name":"Native Advertising",
       "Rating":"Native Advertising\n4.5\nstars\n40 ratings\n•\n9 reviews\n\nNative advertising is a niche form of advertising that leverages the design and format of news and entertainment content. Native advertising is less about selling products and more about producing useful content for consumers who are in the ‘consideration’ phase of the advertising purchase funnel. Often in the form of news-like stories, native advertising has been shown to persuade consumers. Native advertising is affordable, and doesn’t require graphic design to get started. For these reasons, it’s a compelling advertising technique for small businesses. This course outlines a case study where a small travel startup used native advertising to drive hotel sales. Execution strategies for a successful, no-creative native campaign are laid out, including: gathering existing news coverage, ethical content seeding, and content generation.\n\nSHOW ALL ABOUT NATIVE ADVERTISING\nSHOW ALL"
    },
    "/specializations/digital-marketing-strategy-planning",
    {
       "Url":"/learn/digital-strategy-business-opportunity?specialization=digital-marketing-strategy-planning",
       "name":"Digital Strategy and Business Opportunity",
       "Rating":"Digital Strategy and Business Opportunity\n4.3\nstars\n18 ratings\n•\n4 reviews\n\nDigital Marketing Institute is the global standard in Digital Marketing Certification. Our mission is to give our students the confidence and knowledge they need to advance in their careers through this specialization.\n\nDigital and mobile technology coupled with the explosive adoption of social media globally has fundamentally disrupted consumer expectations, and how businesses must operate to support their customers. If you want to understand the forces driving and transforming businesses today and how cutting-edge digital strategies can help businesses grow and thrive in this dynamic environment, this course will help you do so.\n\nYou will learn the core principles of digital marketing before diving deeper into the basics of digital strategy, audience and competitive research, and how to connect with the customer. After completing this course, you will be able to: -\n• Understand how digital and social media have disrupted the way businesses sell to consumers\n• Use digital research and social listening to gain insights into your audience, competitors, and industry\n• Recognize the core components of an effective digital marketing strategy\n• Recognize how marketers use the Buyer’s Journey model to influence purchase decisions over digital platforms using digital content and tools\n• Use the principles of content marketing to create effective content that engages an audience\n\nThis course also explains how to choose the right content for your customers – and how to develop a creative strategy to deliver on key business goals. This is the first course in the Digital Marketing Institute’s Digital Strategy specialization.\n\nOn completion of all courses in your Specialization, you will also be awarded a Digital Marketing Institute Certified Digital Marketing Associate certification, along with three months of free Power Membership, allowing you to boost your career and unlock your next opportunity. 92% of DMI members have said their courses have had a positive impact on their careers, while 88% are now working at senior or manager level.\n\nSHOW ALL ABOUT DIGITAL STRATEGY AND BUSINESS OPPORTUNITY\nSHOW ALL"
    },
    {
       "Url":"/learn/digital-channel-planning-ecommerce-strategy?specialization=digital-marketing-strategy-planning",
       "name":"Digital Channel Planning and E-Commerce Strategy",
       "Rating":"Digital Channel Planning and E-Commerce Strategy\n4.7\nstars\n11 ratings\n•\n3 reviews\n\nDigital Marketing Institute is the global standard in Digital Marketing Certification. Our mission is to give our students the confidence and knowledge they need to advance in their careers through this specialization.\n\nResearch shows that retail customers switch channels during their purchase-decision journey. Many of us research products online at home, or on-the-go using a mobile device, while checking online reviews and comparing prices. The final decision to purchase may happen online, or in a traditional brick-and-mortar store. Omnichannel marketing is a response to modern buying habits, providing consumers with a consistent brand experience across all touchpoints, whether traditional or digital. If you want to understand how marketers plan campaigns to reach consumers at every possible point of contact and how effective digital strategies can help businesses grow and thrive today, this course will help you do so.\n\nYou will learn about cross-media planning and the digital channel mix before diving deeper into topics including digital channel planning, and inbound and outbound channel strategy. After completing this course, you will be able to: -\n• Use best practices to create an omnichannel marketing strategy with a unified message, voice, and brand and a seamless customer experience\n• Demonstrate an understanding of the key tactics and strategies associated with inbound channels including social media marketing, content marketing, search engine marketing, and email marketing\n• Demonstrate an understanding of the key tactics and strategies associated with outbound channels including digital display, video, and YouTube advertising\n\nThis course also covers the critical topic of e-commerce and how to develop an effective e-commerce and social customer service strategy that delivers real value for customers. This is the second course in the Digital Marketing Institute’s Digital Strategy specialization.\n\nOn completion of all courses in your Specialization, you will also be awarded a Digital Marketing Institute Certified Digital Marketing Associate certification, along with three months of free Power Membership, allowing you to boost your career and unlock your next opportunity. 92% of DMI members have said their courses have had a positive impact on their careers, while 88% are now working at senior or manager level.\n\nSHOW ALL ABOUT DIGITAL CHANNEL PLANNING AND E-COMMERCE STRATEGY\nSHOW ALL"
    },
    {
       "Url":"/learn/digital-leadership-digital-strategy-execution?specialization=digital-marketing-strategy-planning",
       "name":"Digital Leadership and Digital Strategy Execution",
       "Rating":"Digital Leadership and Digital Strategy Execution\n\nDigital Marketing Institute is the global standard in Digital Marketing Certification. Our mission is to give our students the confidence and knowledge they need to advance in their careers through this specialization.\n\nThe ability and willingness to strategically adopt digital initiatives to support business goals has never been more critical to an organization’s survival than it is today. If you want to better understand the knowledge, skills, and behaviors demanded of digital leaders as well as the forces driving and transforming businesses today, this course will help you do so.\n\nYou will learn to use techniques to develop and hone your strategic thinking skills and develop skills to help you transition smoothly from a senior or management role to a leadership role. After completing this course, you will be able to: -\n• Demonstrate an understanding of how an iterative approach to Customer Experience (CX) design can improve an organization’s performance\n• Use best practices for recruiting, training, and developing digital marketing personnel\n• Demonstrate an understanding of how to combine an optimal channel and budget mix, supported by a paid media and campaign action plan, to execute a digital marketing strategy\n• Recognize the types of risks associated with digital and why businesses need to protect against them\n\nThis course also covers the key concepts, actions, and behaviors that underpin effective digital leadership in business. You will learn about the key international data protection and data privacy laws applicable to digital campaigns and the risks associated with digital, as well as effective strategies to mitigate the risks. This is the final course in the Digital Marketing Institute’s Digital Strategy specialization.\n\nOn completion of all courses in your Specialization, you will also be awarded a Digital Marketing Institute Certified Digital Marketing Associate certification, along with three months of free Power Membership, allowing you to boost your career and unlock your next opportunity. 92% of members have said their courses have had a positive impact on their careers, while 88% are now working at senior or manager level.\n\nSHOW ALL ABOUT DIGITAL LEADERSHIP AND DIGITAL STRATEGY EXECUTION\nSHOW ALL"
    },
    "/specializations/machine-learning-supply-chain",
    {
       "Url":"/learn/machine-learning-for-supply-chain-fundamentals?specialization=machine-learning-supply-chain",
       "name":"Fundamentals of Machine Learning for Supply Chain",
       "Rating":"Fundamentals of Machine Learning for Supply Chain\n\nThis course will teach you how to leverage the power of Python to understand complicated supply chain datasets. Even if you are not familiar with supply chain fundamentals, the rich data sets that we will use as a canvas will help orient you with several Pythonic tools and best practices for exploratory data analysis (EDA). As such, though all datasets are geared towards supply chain minded professionals, the lessons are easily generalizable to other use cases.\n\nSHOW ALL ABOUT FUNDAMENTALS OF MACHINE LEARNING FOR SUPPLY CHAIN\nSHOW ALL"
    },
    {
       "Url":"/learn/demand-prediction-using-time-series?specialization=machine-learning-supply-chain",
       "name":"Demand Forecasting Using Time Series",
       "Rating":"Demand Forecasting Using Time Series\n\nThis course is the second in a specialization for Machine Learning for Supply Chain Fundamentals. In this course, we explore all aspects of time series, especially for demand prediction. We'll start by gaining a foothold in the basic concepts surrounding time series, including stationarity, trend (drift), cyclicality, and seasonality. Then, we'll spend some time analyzing correlation methods in relation to time series (autocorrelation). In the 2nd half of the course, we'll focus on methods for demand prediction using time series, such as autoregressive models. Finally, we'll conclude with a project, predicting demand using ARIMA models in Python.\n\nSHOW ALL ABOUT DEMAND FORECASTING USING TIME SERIES\nSHOW ALL"
    },
    {
       "Url":"/learn/advanced-ai-techniques-for-the-supply-chain?specialization=machine-learning-supply-chain",
       "name":"Advanced AI Techniques for the Supply Chain",
       "Rating":"Advanced AI Techniques for the Supply Chain\n\nIn this course, we’ll learn about more advanced machine learning methods that are used to tackle problems in the supply chain. We’ll start with an overview of the different ML paradigms (regression/classification) and where the latest models fit into these breakdowns. Then, we’ll dive deeper into some of the specific techniques and use cases such as using neural networks to predict product demand and random forests to classify products. An important part to using these models is understanding their assumptions and required preprocessing steps. We’ll end with a project incorporating advanced techniques with an image classification problem to find faulty products coming out of a machine.\n\nSHOW ALL ABOUT ADVANCED AI TECHNIQUES FOR THE SUPPLY CHAIN\nSHOW ALL"
    },
    {
       "Url":"/learn/ml-safety-stock?specialization=machine-learning-supply-chain",
       "name":"Capstone Project: Predicting Safety Stock",
       "Rating":"Capstone Project: Predicting Safety Stock\n\nIn this course, we'll make predictions on product usage and calculate optimal safety stock storage. We'll start with a time series of shoe sales across multiple stores on three different continents. To begin, we'll look for unique insights and other interesting things we can find in the data by performing groupings and comparing products within each store. Then, we'll use a seasonal autoregressive integrated moving average (SARIMA) model to make predictions on future sales. In addition to making predictions, we'll analyze the provided statistics (such as p-score) to judge the viability of using the SARIMA model to make predictions. Then, we'll tune the hyper-parameters of the model to garner better results and higher statistical significance. Finally, we'll make predictions on safety stock by looking to the data for monthly usage predictions and calculating safety stock from the formula involving lead times.\n\nSHOW ALL ABOUT CAPSTONE PROJECT: PREDICTING SAFETY STOCK \nSHOW ALL"
    },
    "/specializations/excel-skills-for-business-forecasting",
    {
       "Url":"/learn/excel-business-forecasting-time-series?specialization=excel-skills-for-business-forecasting",
       "name":"Excel Time Series Models for Business Forecasting",
       "Rating":"Excel Time Series Models for Business Forecasting\n4.9\nstars\n33 ratings\n•\n14 reviews\n\nThis course explores different time series business forecasting methods. The course covers a variety of business forecasting methods for different types of components present in time series data — level, trending, and seasonal. We will learn about the theoretical methods and apply these methods to business data using Microsoft Excel. These forecasting methods will be programmed into Microsoft Excel, displayed graphically, and we will optimise these models to produce accurate forecasts. We will compare different models and their forecasts to decide which model best suits our business' needs.\n\nSHOW ALL ABOUT EXCEL TIME SERIES MODELS FOR BUSINESS FORECASTING\nSHOW ALL"
    },
    {
       "Url":"/learn/excel-business-forecasting-regression?specialization=excel-skills-for-business-forecasting",
       "name":"Excel Regression Models for Business Forecasting",
       "Rating":"Excel Regression Models for Business Forecasting\n\nThis course allows learners to explore Regression Models in order to utilise these models for business forecasting. Unlike Time Series Models, Regression Models are causal models, where we identify certain variables in our business that influence other variables. Regressions model this causality, and then we can use these models in order to forecast, and then plan for our business' needs. We will explore simple regression models, multiple regression models, dummy variable regressions, seasonal variable regressions, as well as autoregressions. Each of these are different forms of regression models, tailored to unique business scenarios, in order to forecast and generate business intelligence for organisations.\n\nSHOW ALL ABOUT EXCEL REGRESSION MODELS FOR BUSINESS FORECASTING\nSHOW ALL"
    },
    {
       "Url":"/learn/judgmental-business-forecasting-in-excel?specialization=excel-skills-for-business-forecasting",
       "name":"Judgmental Business Forecasting in Excel",
       "Rating":"Judgmental Business Forecasting in Excel\n\nIn this course, we extend your business forecasting expertise from the first two courses of our Business Forecasting Specialisation on Time Series Models and Regression Models. We will explore the role of judgmental forecasting, when more quantitative forecasting methods have limitations, and we need to generate further business insights. We will be exploring some structured methodologies to create judgmental business forecasts using Business Indicators, Subjective Assessment Methods, and Exploratory Methods. For each of these methods, we will look at how we can use Excel to help us in achieving these judgmental forecasts and how Excel can help us visualising our forecast findings. Being judgmental forecasting methods, we will also look at the role of biases in Business Forecasting,\n\nSHOW ALL ABOUT JUDGMENTAL BUSINESS FORECASTING IN EXCEL\nSHOW ALL"
    },
    "/specializations/clinical-data-science",
    {
       "Url":"/learn/introduction-clinical-data-science?specialization=clinical-data-science",
       "name":"Introduction to Clinical Data Science",
       "Rating":"Introduction to Clinical Data Science\n4.6\nstars\n297 ratings\n•\n88 reviews\n\nThis course will prepare you to complete all parts of the Clinical Data Science Specialization. In this course you will learn how clinical data are generated, the format of these data, and the ethical and legal restrictions on these data. You will also learn enough SQL and R programming skills to be able to complete the entire Specialization - even if you are a beginner programmer. While you are taking this course you will have access to an actual clinical data set and a free, online computational environment for data science hosted by our Industry Partner Google Cloud. \n\nAt the end of this course you will be prepared to embark on your clinical data science education journey, learning how to take data created by the healthcare system and improve the health of tomorrow's patients.\n\nSHOW ALL ABOUT INTRODUCTION TO CLINICAL DATA SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/clinical-data-models-and-data-quality-assessments?specialization=clinical-data-science",
       "name":"Clinical Data Models and Data Quality Assessments",
       "Rating":"Clinical Data Models and Data Quality Assessments\n4.2\nstars\n52 ratings\n•\n16 reviews\n\nThis course aims to teach the concepts of clinical data models and common data models. Upon completion of this course, learners will be able to interpret and evaluate data model designs using Entity-Relationship Diagrams (ERDs), differentiate between data models and articulate how each are used to support clinical care and data science, and create SQL statements in Google BigQuery to query the MIMIC3 clinical data model and the OMOP common data model.\n\nSHOW ALL ABOUT CLINICAL DATA MODELS AND DATA QUALITY ASSESSMENTS\nSHOW ALL"
    },
    {
       "Url":"/learn/computational-phenotyping?specialization=clinical-data-science",
       "name":"Identifying Patient Populations",
       "Rating":"Identifying Patient Populations\n4.5\nstars\n31 ratings\n•\n10 reviews\n\nThis course teaches you the fundamentals of computational phenotyping, a biomedical informatics method for identifying patient populations. In this course you will learn how different clinical data types perform when trying to identify patients with a particular disease or trait. You will also learn how to program different data manipulations and combinations to increase the complexity and improve the performance of your algorithms. Finally, you will have a chance to put your skills to the test with a real-world practical application where you develop a computational phenotyping algorithm to identify patients who have hypertension. You will complete this work using a real clinical data set while using a free, online computational environment for data science hosted by our Industry Partner Google Cloud.\n\nSHOW ALL ABOUT IDENTIFYING PATIENT POPULATIONS\nSHOW ALL"
    },
    {
       "Url":"/learn/clinical-natural-language-processing?specialization=clinical-data-science",
       "name":"Clinical Natural Language Processing",
       "Rating":"Clinical Natural Language Processing\n3.4\nstars\n18 ratings\n•\n9 reviews\n\nThis course teaches you the fundamentals of clinical natural language processing (NLP). In this course you will learn the basic linguistic principals underlying NLP, as well as how to write regular expressions and handle text data in R. You will also learn practical techniques for text processing to be able to extract information from clinical notes.  Finally, you will have a chance to put your skills to the test with a real-world practical application where you develop text processing algorithms to identify diabetic complications from clinical notes. You will complete this work using a free, online computational environment for data science hosted by our Industry Partner Google Cloud.\n\nSHOW ALL ABOUT CLINICAL NATURAL LANGUAGE PROCESSING\nSHOW ALL"
    },
    {
       "Url":"/learn/clinical-predictive-modeling?specialization=clinical-data-science",
       "name":"Predictive Modeling and Transforming Clinical Practice",
       "Rating":"Predictive Modeling and Transforming Clinical Practice\n\nThis course teaches you the fundamentals of transforming clinical practice using predictive models. This course examines specific challenges and methods of clinical implementation, that clinical data scientists must be aware of when developing their predictive models."
    },
    {
       "Url":"/learn/advanced-clinical-data-science?specialization=clinical-data-science",
       "name":"Advanced Clinical Data Science",
       "Rating":"Advanced Clinical Data Science\n\nThis course prepares you to deal with advanced clinical data science topics and techniques including temporal and research quality analysis."
    },
    "/specializations/artificial-intelligence-scientific-research",
    {
       "Url":"/learn/data-science-and-scikit-learn-in-python?specialization=artificial-intelligence-scientific-research",
       "name":"Introduction to Data Science and scikit-learn in Python",
       "Rating":"Introduction to Data Science and scikit-learn in Python\n\nThis course will teach you how to leverage the power of Python and artificial intelligence to create and test hypothesis. We'll start for the ground up, learning some basic Python for data science before diving into some of its richer applications to test our created hypothesis. We'll learn some of the most important libraries for exploratory data analysis (EDA) and machine learning such as Numpy, Pandas, and Sci-kit learn. After learning some of the theory (and math) behind linear regression, we'll go through and full pipeline of reading data, cleaning it, and applying a regression model to estimate the progression of diabetes. By the end of the course, you'll apply a classification model to predict the presence/absence of heart disease from a patient's health data.\n\nSHOW ALL ABOUT INTRODUCTION TO DATA SCIENCE AND SCIKIT-LEARN IN PYTHON\nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-models-in-science?specialization=artificial-intelligence-scientific-research",
       "name":"Machine Learning Models in Science",
       "Rating":"Machine Learning Models in Science\n\nThis course is aimed at anyone interested in applying machine learning techniques to scientific problems. In this course, we'll learn about the complete machine learning pipeline, from reading in, cleaning, and transforming data to running basic and advanced machine learning algorithms. We'll start with data preprocessing techniques, such as PCA and LDA. Then, we'll dive into the fundamental AI algorithms: SVMs and K-means clustering. Along the way, we'll build our mathematical and programming toolbox to prepare ourselves to work with more complicated models. Finally, we'll explored advanced methods such as random forests and neural networks. Throughout the way, we'll be using medical and astronomical datasets. In the final project, we'll apply our skills to compare different machine learning models in Python.\n\nSHOW ALL ABOUT MACHINE LEARNING MODELS IN SCIENCE\nSHOW ALL"
    },
    {
       "Url":"/learn/neural-networks-random-forests?specialization=artificial-intelligence-scientific-research",
       "name":"Neural Networks and Random Forests",
       "Rating":"Neural Networks and Random Forests\n\nIn this course, we will build on our knowledge of basic models and explore advanced AI techniques. We’ll start with a deep dive into neural networks, building our knowledge from the ground up by examining the structure and properties. Then we’ll code some simple neural network models and learn to avoid overfitting, regularization, and other hyper-parameter tricks. After a project predicting likelihood of heart disease given health characteristics, we’ll move to random forests. We’ll describe the differences between the two techniques and explore their differing origins in detail. Finally, we’ll complete a project predicting similarity between health patients using random forests.\n\nSHOW ALL ABOUT NEURAL NETWORKS AND RANDOM FORESTS\nSHOW ALL"
    },
    {
       "Url":"/learn/ai-for-drug-discovery?specialization=artificial-intelligence-scientific-research",
       "name":"Capstone Project: Advanced AI for Drug Discovery",
       "Rating":"Capstone Project: Advanced AI for Drug Discovery\n\nIn this capstone project course, we'll compare genome sequences of COVID-19 mutations to identify potential areas a drug therapy can look to target. The first step in drug discovery involves identifying target subsequences of theirs genome to target. We'll start by comparing the genomes of virus mutations to look for similarities. Then, we'll perform PCA to cut down our number of dimensions and identify the most common features. Next, we'll use K-means clustering in Python to find the optimal number of groups and trace the lineage of the virus. Finally, we'll predict similarity between the sequences and use this to pick a target subsequence. Throughout the course, each section will consist of a programming assignment coupled with a guide video and helpful hints. By the end, you'll be well on your way to discovering ways to combat disease with genome sequencing.\n\nSHOW ALL ABOUT CAPSTONE PROJECT: ADVANCED AI FOR DRUG DISCOVERY\nSHOW ALL"
    },
    "/specializations/compstats",
    {
       "Url":"/learn/compstatsintro?specialization=compstats",
       "name":"Introduction to Bayesian Statistics",
       "Rating":"Introduction to Bayesian Statistics\n\nThe objective of this course is to introduce Computational Statistics to aspiring or new data scientists. The attendees will start off by learning the basics of probability, Bayesian modeling and inference. This will be the first course in a specialization of three courses .Python and Jupyter notebooks will be used throughout this course to illustrate and perform Bayesian modeling. The course website is located at https://sjster.github.io/introduction_to_computational_statistics/docs/index.html. The course notebooks can be downloaded from this website by following the instructions on page https://sjster.github.io/introduction_to_computational_statistics/docs/getting_started.html.\n\nThe instructors for this course will be Dr. Srijith Rajamohan and Dr. Robert Settlage.\n\nSHOW ALL ABOUT INTRODUCTION TO BAYESIAN STATISTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/mcmc?specialization=compstats",
       "name":"Bayesian Inference with MCMC",
       "Rating":"Bayesian Inference with MCMC\n\nThe objective of this course is to introduce Markov Chain Monte Carlo Methods for Bayesian modeling and inference,  The attendees will start off by learning the the basics of Monte Carlo methods. This will be augmented by hands-on examples in Python that will be used to illustrate how these algorithms work. This will be the second course in a specialization of three courses .Python and Jupyter notebooks will be used throughout this course to illustrate and perform Bayesian modeling with PyMC3. The course website is located at https://sjster.github.io/introduction_to_computational_statistics/docs/index.html. The course notebooks can be downloaded from this website by following the instructions on page https://sjster.github.io/introduction_to_computational_statistics/docs/getting_started.html.\n\nThe instructor for this course will be Dr. Srijith Rajamohan.\n\nSHOW ALL ABOUT BAYESIAN INFERENCE WITH MCMC\nSHOW ALL"
    },
    {
       "Url":"/learn/introduction-to-pymc3?specialization=compstats",
       "name":"Introduction to PyMC3 for Bayesian Modeling and Inference",
       "Rating":"Introduction to PyMC3 for Bayesian Modeling and Inference\n\nThe objective of this course is to introduce PyMC3 for Bayesian Modeling and Inference,  The attendees will start off by learning the the basics of PyMC3 and learn how to perform scalable inference for a variety of problems. This will be the final course in a specialization of three courses .Python and Jupyter notebooks will be used throughout this course to illustrate and perform Bayesian modeling with PyMC3.. The course website is located at https://sjster.github.io/introduction_to_computational_statistics/docs/index.html. The course notebooks can be downloaded from this website by following the instructions on page https://sjster.github.io/introduction_to_computational_statistics/docs/getting_started.html.\n\nThe instructor for this course will be Dr. Srijith Rajamohan.\n\nSHOW ALL ABOUT INTRODUCTION TO PYMC3 FOR BAYESIAN MODELING AND INFERENCE\nSHOW ALL"
    },
    "/specializations/fullstack-web-development-espanol",
    {
       "Url":"/learn/disenando-paginas-bootstrap4?specialization=fullstack-web-development-espanol",
       "name":"Diseñando páginas web con Bootstrap 4",
       "Rating":"Diseñando páginas web con Bootstrap 4\n4.5\nstars\n578 ratings\n•\n369 reviews\n\nEste curso te enseñará conceptos generales de desarrollo web del lado cliente, metodologías de trabajo y herramientas. Aprenderás sobre diseño responsive, grillas, y componentes CSS y Javascript de Bootstrap. Practicarás con preprocesadores de CSS, Less y Sass. También aplicarás conceptos básicos de Node.js y NPM para gestionar tus sitios web.\n\nAl finalizar este curso, habrás practicado con todas esas herramientas y serás capaz de diseñar una página web e implementar ese diseño con Bootstrap, crear un diseño responsive y preparar tu sitio web para salir a producción.\n\nSHOW ALL ABOUT DISEÑANDO PÁGINAS WEB CON BOOTSTRAP 4\nSHOW ALL"
    },
    {
       "Url":"/learn/desarrollar-paginas-web-con-angular?specialization=fullstack-web-development-espanol",
       "name":"Desarrollo de páginas con Angular",
       "Rating":"Desarrollo de páginas con Angular\n3.1\nstars\n123 ratings\n•\n85 reviews\n\nEn la actualidad las páginas web se han transformado en aplicaciones en sí mismas, con más cantidad de componentes que nunca antes, y con más exigencia de parte de sus consumidores y clientes.\n\nEn este curso aprenderás a utilizar Angular, uno de los frameworks líderes del mercado para desarrollo de aplicaciones de una única página, o conocidas como SPA por la sigla en inglés de 'Single Page Application'.\nAdemás, se hará una introducción gradual al lenguaje NodeJS y al desarrollo de interfaces para aplicaciones (API por su sigla en inglés de Application Program Interface), con el objetivo de desarrollar servicios web básicos para darle comportamiento a la aplicación Angular.\n\nSHOW ALL ABOUT DESARROLLO DE PÁGINAS CON ANGULAR\nSHOW ALL"
    },
    {
       "Url":"/learn/aplicaciones-mobile-multiplataforma-nativescript-angular-redux?specialization=fullstack-web-development-espanol",
       "name":"Desarrollo de Aplicaciones Mobile Multiplataforma con Nativescript, Angular y Redux",
       "Rating":"Desarrollo de Aplicaciones Mobile Multiplataforma con Nativescript, Angular y Redux\n3.7\nstars\n18 ratings\n•\n7 reviews\n\nEste curso se centra en el desarrollo de aplicaciones nativas multiplataforma, y nativas de iOS y Android, utilizando NativeScript (versión 4.x). El framework utiliza Angular, TypeScript o JavaScript, para obtener una interfaz de usuario y rendimiento verdaderamente nativos. El código, además de ser multiplataforma mobile, también compartirá estructura en un mismo proyecto con la web. Aprenderás sobre el desarrollo de la interfaz de usuario con NativeScript UI y cómo ese diseño puede adaptarse según sea la plataforma o web. Utilizaremos la plataforma móvil nativa desde Javascript.\n\nSHOW ALL ABOUT DESARROLLO DE APLICACIONES MOBILE MULTIPLATAFORMA CON NATIVESCRIPT, ANGULAR Y REDUX\nSHOW ALL"
    },
    {
       "Url":"/learn/desarrollo-lado-servidor-nodejs-express-mongodb?specialization=fullstack-web-development-espanol",
       "name":"Desarrollo del lado servidor: NodeJS, Express y MongoDB",
       "Rating":"Desarrollo del lado servidor: NodeJS, Express y MongoDB\n4.1\nstars\n96 ratings\n•\n56 reviews\n\nEn este curso trabajarás del lado servidor, en el backend, desarrollando el soporte que toda aplicación necesita para lidiar con la persistencia de la información, el setup de un servidor web, la creación de una API REST, autenticación y autorización, y la integración de librerías de terceros. Utilizarás Express para el servidor web, y una base de datos NoSQL orientada a documentos: MongoDB. Aprenderás de ODM con Mongoose y harás las típicas tareas CRUD sobre Mongo. Finalmente pondrás productivo tu sitio en Heroku.\n\nSHOW ALL ABOUT DESARROLLO DEL LADO SERVIDOR: NODEJS, EXPRESS Y MONGODB\nSHOW ALL"
    },
    "/specializations/database-systems",
    {
       "Url":"/learn/relational-database?specialization=database-systems",
       "name":"Relational database systems",
       "Rating":"Relational database systems\n4.1\nstars\n192 ratings\n•\n49 reviews\n\nWelcome to the specialization course Relational Database Systems. This course will be completed on six weeks, it will be supported with videos and various documents that will allow you to learn in a very simple way how several types of information systems and databases are available to solve different problems and needs of the companies. \n\nObjective:\n\nA learner will be able to design, test, and implement analytical, transactional or NoSQL database systems according to business requirements by programming reliable, scalable and maintainable applications and resources using SQL and Hadoop ecosystem.\n\nProgramming languages:\n\nFor course 1 you will use the MYSQL language.\n\nSoftware to download:\nMySQL\nWorkbench \n\nIn case you have a Mac / IOS operating system you will need to use a virtual Machine (VirtualBox, Vmware).\n\nSHOW ALL ABOUT RELATIONAL DATABASE SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/business-intelligence-data-warehousing?specialization=database-systems",
       "name":"Business intelligence and data warehousing",
       "Rating":"Business intelligence and data warehousing\n3.9\nstars\n87 ratings\n•\n22 reviews\n\nWelcome to the specialization course Business Intelligence and Data Warehousing. This course will be completed on six weeks, it will be supported with videos and various documents that will allow you to learn in a very simple way how to identify, design and develop analytical information systems, such as Business Intelligence with a descriptive analysis on data warehouses. You will be able to understand the problem of integration and predictive analysis of high volume of unstructured data (big data) with data mining and the Hadoop framework.\n\nAfter completing this course, a learner will be able to\n●\tCreate a Star o Snowflake data model Diagram through the Multidimensional Design from analytical business requirements and OLTP system\n●\tCreate a physical database system \n●\tExtract, Transform and load data to a data-warehouse.\n●\tProgram analytical queries with SQL using MySQL\n●\tPredictive analysis with RapidMiner\n●\tLoad relational or unstructured data to Hortonworks HDFS\n●\tExecute Map-Reduce jobs to query data on HDFS for analytical purposes\n\n\nProgramming languages:\nFor course 2 you will use the MYSQL language.\n\nSoftware to download:\nRapidminer\nMYSQL\nExcel\nHortonworks Hadoop framework\n\nIn case you have a Mac / IOS operating system you will need to use a virtual Machine (VirtualBox, Vmware).\n\nSHOW ALL ABOUT BUSINESS INTELLIGENCE AND DATA WAREHOUSING\nSHOW ALL"
    },
    {
       "Url":"/learn/nosql-databases?specialization=database-systems",
       "name":"NoSQL systems",
       "Rating":"NoSQL systems\n4.2\nstars\n115 ratings\n•\n26 reviews\n\nWelcome to the specialization course of NoSQL Systems. \n\nThis course will be completed on six weeks, it will be supported with videos and exercises that will allow you to identify the differences between the relational and NoSQL databases. \nAs part of these alternative technologies the student will learn the main characteristics and how to implement the typical NoSQL databases, such as Key-value, columnar, document and graph. \nLet's start!\n\nAfter completing this course, a learner will be able to\n●\tIdentify what type of NoSQL database to implement based on business requirements (key-value, document, full text, graph, etc.)\n●\tApply NoSQL data modeling from application specific queries\n●\tUse Atomic Aggregates and denormalization as data modelling techniques to optimize query processing\n\nSoftware to download:\nMongoDB\nNeo4j\nSAPIQ\nCassandra\n\nIn case you have a Mac / IOS operating system you will need to use a virtual Machine (VirtualBox, Vmware).\n\nSHOW ALL ABOUT NOSQL SYSTEMS\nSHOW ALL"
    },
    {
       "Url":"/learn/data-intensive-applications?specialization=database-systems",
       "name":"Designing data-intensive applications",
       "Rating":"Designing data-intensive applications\n4.5\nstars\n30 ratings\n•\n3 reviews\n\nWelcome to the specialization course of Designing data-intensive applications. \n\nThis course will be completed on four weeks, it will be supported with videos and exercises.\n\nBy the end of this specialization, learners will be able to propose, design, justify and develop high reliable information systems according to type of data and volume of information, response time, type of processing and queries in order to support scalability, maintainability, security and reliability considering the last information technologies.\n\nSoftware to download:\nMySQL Workbench \nRapidminer\nHadoop framework Hortonworks\nMongoDB\n\nIn case you have a Mac / IOS operating system you need to perform an action called VirtualBox.\n\nSHOW ALL ABOUT DESIGNING DATA-INTENSIVE APPLICATIONS\nSHOW ALL"
    },
    "/specializations/machine-learning-algorithms-real-world",
    {
       "Url":"/learn/machine-learning-applied?specialization=machine-learning-algorithms-real-world",
       "name":"Introduction to Applied Machine Learning",
       "Rating":"Introduction to Applied Machine Learning\n4.7\nstars\n611 ratings\n•\n147 reviews\n\nThis course is for professionals who have heard the buzz around machine learning and want to apply machine learning to data analysis and automation. Whether finance, medicine, engineering, business or other domains, this course will introduce you to problem definition and data preparation in a machine learning project.\n\nBy the end of the course, you will be able to clearly define a machine learning problem using two approaches. You will learn to survey available data resources and identify potential ML applications. You will learn to take a business need and turn it into a machine learning application. You will prepare data for effective machine learning applications.\n\nThis is the first course of the Applied Machine Learning Specialization brought to you by Coursera and the Alberta Machine Intelligence Institute.\n\nSHOW ALL ABOUT INTRODUCTION TO APPLIED MACHINE LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/machine-learning-classification-algorithms?specialization=machine-learning-algorithms-real-world",
       "name":"Machine Learning Algorithms: Supervised Learning Tip to Tail",
       "Rating":"Machine Learning Algorithms: Supervised Learning Tip to Tail\n4.7\nstars\n364 ratings\n•\n60 reviews\n\nThis course takes you from understanding the fundamentals of a machine learning project. Learners will understand and implement supervised learning techniques on real case studies to analyze business case scenarios where decision trees, k-nearest neighbours and support vector machines are optimally used. Learners will also gain skills to contrast the practical consequences of different data preparation steps and describe common production issues in applied ML.\n\nTo be successful, you should have at least beginner-level background in Python programming (e.g., be able to read and code trace existing code, be comfortable with conditionals, loops, variables, lists, dictionaries and arrays). You should have a basic understanding of linear algebra (vector notation) and statistics (probability distributions and mean/median/mode).\n\nThis is the second course of the Applied Machine Learning Specialization brought to you by Coursera and the Alberta Machine Intelligence Institute.\n\nSHOW ALL ABOUT MACHINE LEARNING ALGORITHMS: SUPERVISED LEARNING TIP TO TAIL\nSHOW ALL"
    },
    {
       "Url":"/learn/data-machine-learning?specialization=machine-learning-algorithms-real-world",
       "name":"Data for Machine Learning",
       "Rating":"Data for Machine Learning\n4.4\nstars\n86 ratings\n•\n24 reviews\n\nThis course is all about data and how it is critical to the success of your applied machine learning model. Completing this course will give learners the skills to:\n\nUnderstand the critical elements of data in the learning, training and operation phases\nUnderstand biases and sources of data\nImplement techniques to improve the generality of your model\nExplain the consequences of overfitting and identify mitigation measures\nImplement appropriate test and validation measures.\nDemonstrate how the accuracy of your model can be improved with thoughtful feature engineering.\nExplore the impact of the algorithm parameters on model strength\n\nTo be successful in this course, you should have at least beginner-level background in Python programming (e.g., be able to read and code trace existing code, be comfortable with conditionals, loops, variables, lists, dictionaries and arrays). You should have a basic understanding of linear algebra (vector notation) and statistics (probability distributions and mean/median/mode).\n\nThis is the third course of the Applied Machine Learning Specialization brought to you by Coursera and the Alberta Machine Intelligence Institute.\n\nSHOW ALL ABOUT DATA FOR MACHINE LEARNING\nSHOW ALL"
    },
    {
       "Url":"/learn/optimize-machine-learning-model-performance?specialization=machine-learning-algorithms-real-world",
       "name":"Optimizing Machine Learning Performance",
       "Rating":"Optimizing Machine Learning Performance\n4.6\nstars\n38 ratings\n•\n8 reviews\n\nThis course synthesizes everything your have learned in the applied machine learning specialization. You will now walk through a complete machine learning project to prepare a machine learning maintenance roadmap. You will understand and analyze how to deal with changing data. You will also be able to identify and interpret potential unintended effects in your project. You will understand and define procedures to operationalize and maintain your applied machine learning model. By the end of this course you will have all the tools and understanding you need to confidently roll out a machine learning project and prepare to optimize it in your business context. \n\nTo be successful, you should have at least beginner-level background in Python programming (e.g., be able to read and code trace existing code, be comfortable with conditionals, loops, variables, lists, dictionaries and arrays). You should have a basic understanding of linear algebra (vector notation) and statistics (probability distributions and mean/median/mode).\n\nThis is the final course of the Applied Machine Learning Specialization brought to you by Coursera and the Alberta Machine Intelligence Institute (Amii).\n\nSHOW ALL ABOUT OPTIMIZING MACHINE LEARNING PERFORMANCE\nSHOW ALL"
    },
    "/specializations/strategic-analytics",
    {
       "Url":"/learn/strategic-business-analytics?specialization=strategic-analytics",
       "name":"Foundations of strategic business analytics",
       "Rating":"Foundations of strategic business analytics\n4.4\nstars\n604 ratings\n•\n141 reviews\n\nWho is this course for?  \n\nThis course is designed for students, business analysts, and data scientists who want to apply statistical knowledge and techniques to business contexts. For example, it may be suited to experienced statisticians, analysts, engineers who want to move more into a business role. \n\nYou will find this course exciting and rewarding if you already have a background in statistics, can use R or another programming language and are familiar with databases and data analysis techniques such as regression, classification, and clustering.\nHowever, it contains a number of recitals and R Studio tutorials which will consolidate your competences, enable you to play more freely with data and explore new features and statistical functions in R.\n\nWith this course, you’ll have a first overview on Strategic Business Analytics topics. We’ll discuss a wide variety of applications of Business Analytics. From Marketing to Supply Chain or Credit Scoring and HR Analytics, etc. We’ll cover many different data analytics techniques, each time explaining how to be relevant for your business.\n\nWe’ll pay special attention to how you can produce convincing, actionable, and efficient insights. We'll also present you with different data analytics tools to be applied to different types of issues.\nBy doing so, we’ll help you develop four sets of skills needed to leverage value from data: Analytics, IT, Business and Communication. \n\nBy the end of this MOOC, you should be able to approach a business issue using Analytics by (1) qualifying the issue at hand in quantitative terms, (2) conducting relevant data analyses, and (3) presenting your conclusions and recommendations in a business-oriented, actionable and efficient way.\n\nPrerequisites : 1/ Be able to use R or to program 2/ To know the fundamentals of databases, data analysis (regression, classification, clustering)\n\nWe give credit to Pauline Glikman, Albane Gaubert, Elias Abou Khalil-Lanvin (Students at ESSEC BUSINESS SCHOOL) for their contribution to this course design.\n\nSHOW ALL ABOUT FOUNDATIONS OF STRATEGIC BUSINESS ANALYTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/foundations-marketing-analytics?specialization=strategic-analytics",
       "name":"Foundations of marketing analytics",
       "Rating":"Foundations of marketing analytics\n4.6\nstars\n694 ratings\n•\n181 reviews\n\nWho is this course for?  \n\nThis course is designed for students, business analysts, and data scientists who want to apply statistical knowledge and techniques to business contexts. For example, it may be suited to experienced statisticians, analysts, engineers who want to move more into a business role, in particular in marketing.\n\nYou will find this course exciting and rewarding if you already have a background in statistics, can use R or another programming language and are familiar with databases and data analysis techniques such as regression, classification, and clustering.\nHowever, it contains a number of recitals and R Studio tutorials which will consolidate your competences, enable you to play more freely with data and explore new features and statistical functions in R.\n\nBusiness Analytics, Big Data and Data Science are very hot topics today, and for good reasons. Companies are sitting on a treasure trove of data, but usually lack the skills and people to analyze and exploit that data efficiently. Those companies who develop the skills and hire the right people to analyze and exploit that data will have a clear competitive advantage.\n\nIt's especially true in one domain: marketing. About 90% of the data collected by companies today are related to customer actions and marketing activities.The domain of Marketing Analytics is absolutely huge, and may cover fancy topics such as text mining, social network analysis, sentiment analysis, real-time bidding, online campaign optimization, and so on.\n\nBut at the heart of marketing lie a few basic questions that often remain unanswered: (1) who are my customers, (2) which customers should I target and spend most of my marketing budget on, and (3) what's the future value of my customers so I can concentrate on those who will be worth the most to the company in the future.\n\nThat's exactly what this course will cover: segmentation is all about understanding your customers, scorings models are about targeting the right ones, and customer lifetime value is about anticipating their future value. These are the foundations of Marketing Analytics. And that's what you'll learn to do in this course.\n\nSHOW ALL ABOUT FOUNDATIONS OF MARKETING ANALYTICS\nSHOW ALL"
    },
    {
       "Url":"/learn/case-studies-business-analytics-accenture?specialization=strategic-analytics",
       "name":"Case studies in business analytics with ACCENTURE",
       "Rating":"Case studies in business analytics with ACCENTURE\n3.7\nstars\n196 ratings\n•\n63 reviews\n\nWho is this course for ?\n\nThis course is RESTRICTED TO LEARNERS ENROLLED IN  Strategic Business Analytics SPECIALIZATION as a preparation to the capstone project. During the first two MOOCs, we focused on specific techniques for specific applications. Instead, with this third MOOC, we provide you with different examples  to open your mind to different applications from different industries and sectors.\nThe objective is to give you an helicopter overview on what's happening in this field. You will see how the tools presented in the two previous courses of the Specialization are used in real life projects. \nWe want to ignite your reflection process. Hence, you will best make use of the Accenture cases by watching first the MOOC and then investigate by yourself on the different concepts, industries, or challenges that are introduced during the videos.\n\nAt the end of this course learners will be able to: \n- identify the possible applications of business analytics,\n- hence, reflect on the possible solutions and added-value applications that could be proposed for their capstone project.\n\nThe cases will be presented by senior practitioners from Accenture with different backgrounds in term of industry, function, and country.  Special attention will be paid to the \"value case\" of the issue raised to prepare you for the capstone project of the specialization.\n\nAbout Accenture\nAccenture is a leading global professional services company, providing a broad range of services and solutions in strategy, consulting, digital, technology and operations. Combining unmatched experience and specialized skills across more than 40 industries and all business functions—underpinned by the world’s largest delivery network—Accenture works at the intersection of business and technology to help clients improve their performance and create sustainable value for their stakeholders. With more than 358,000 people serving clients in more than 120 countries, Accenture drives innovation to improve the way the world works and lives. Visit us at www.accenture.com.\n\nSHOW ALL ABOUT CASE STUDIES IN BUSINESS ANALYTICS WITH ACCENTURE\nSHOW ALL"
    },
    {
       "Url":"/learn/strategic-business-analytics-capstone?specialization=strategic-analytics",
       "name":"Capstone: Create Value from Open Data",
       "Rating":"Capstone: Create Value from Open Data\n4.1\nstars\n43 ratings\n•\n10 reviews\n\nThe Capstone project is an individual assignment.\n\nParticipants decide the theme they want to explore and define the issue they want to solve. Their “playing field” should provide data from various sectors (such as farming and nutrition, culture, economy and employment, Education & Research, International & Europe, Housing, Sustainable, Development & Energies, Health & Social, Society, Territories & Transport). Participants are encouraged to mix the different fields and leverage the existing information with other (properly sourced) open data sets.\n\nDeliverable 1 is the preliminary preparation and problem qualification step. The objectives is to define the what, why & how. What issue do we want to solve? Why does it promise value for public authorities, companies, citizens? How do we want to explore the provided data? \n\nFor Deliverable 2, the participant needs to present the intermediary outputs and adjustments to the analysis framework. The objectives is to confirm the how and the relevancy of the first results. \n\nFinally, with Deliverable 3, the participant needs to present the final outputs and the value case. The objective is to confirm the why. Why will it create value for public authorities, companies, and citizens.\n\nAssessment and grading: the participants will present their results to their peers on a regular basis. An evaluation framework will be provided for the participants to assess the quality of each other’s deliverables.\n\nSHOW ALL ABOUT CAPSTONE:  CREATE VALUE FROM OPEN DATA\nSHOW ALL"
    },
    "/specializations/digital-business",
    {
       "Url":"/learn/understanding-digital-world?specialization=digital-business",
       "name":"Digital Business - Understand the digital world",
       "Rating":"Digital Business - Understand the digital world\n\nFacebook, AirBnB, Tesla, Amazon, Uber. In just a few years, companies like these have changed the face of the global economy. Meanwhile, hundreds of thousands of start-ups are disrupting old business models, taking on centennial industrial groups – and winning. It’s clear that the rules of business have changed forever.\n\nThis MOOC provides a knowledge toolkit for the ongoing digital revolution. You’ll discover 10 concepts that are essential for understanding the new mechanisms of digital business and innovation. \n\nEach concept is explained in its own beautifully designed, content-rich instructional video, along with additional resources for you to explore. The ideas are illustrated with up-to-the-minute case studies and examples from a wide range of industries.\n\nWeek 1 : Why Digital Changes Everything\nWeek 2 : Creating Value in a Digital World \nWeek 3 : Thinking and Acting Differently\n\n\nThis MOOC is ideal for learners from a wide range of backgrounds. It is brought to you by three expert professors and researchers from IMT - Telecom Paris, a leading European graduate school in the field of digital technology and social science.\n\nThis MOOC is supported by the Patrick and Lina Drahi Foundation.\n\nSHOW ALL ABOUT DIGITAL BUSINESS - UNDERSTAND THE DIGITAL WORLD\nSHOW ALL"
    },
    {
       "Url":"/learn/act-on-digital-world?specialization=digital-business",
       "name":"Digital business - Act on the digital world",
       "Rating":"Digital business - Act on the digital world\n\nThe idea that digital technology triggers profound change in companies is largely accepted. There is indeed no question that the digital world is profoundly changing business life. Everyone is now on the same page. But with the digital world come a lot of misconceptions and buzzwords. You can no longer get by with these commonplaces or general ideas. You need to gain a detailed understanding of the main new management paradigms: new marketing approaches, the role of data in data-driven management, large businesses’ struggle to innovate, etc. This will give you precise insight into changes at work. Without precision, it is difficult to understand. Without understanding, it is impossible to act.\n\nThis module will tell you how.\n\nWeek 1 : Big Picture\nWeek 2 : Operational Area\nWeek 3 : Focus Area\n\nSHOW ALL ABOUT DIGITAL BUSINESS - ACT ON THE DIGITAL WORLD\nSHOW ALL"
    },
    {
       "Url":"/learn/grow-on-digital-world?specialization=digital-business",
       "name":"Digital business - Grow on digital world",
       "Rating":"Digital business - Grow on digital world\n\nDigital-driven changes are both generic and specific. Most transformations apply to all industries, equally and without exception. But in some industries or places, digital transformations are singular and atypical. To be a player in the digital world, you will need to master both the transformations common to all industries and the transformations at work on certain verticals. Retail and the sharing economy are emblematic of markets where specific transformations are unfolding. This module will tell you how.\n\nWeek 1 : New business models, new perimeters\nWeek 2 : Regulating the digital innovation\nWeek 3 : The value of digital innovation\n\nSHOW ALL ABOUT DIGITAL BUSINESS - GROW ON DIGITAL WORLD\nSHOW ALL"
    },
    {
       "Url":"/learn/digital-business?specialization=digital-business",
       "name":"Digital Business - Capstone project",
       "Rating":"Digital Business - Capstone project\n\nLVMH! Huawei! Energysquare! Three companies in very different industries: luxury goods, telecommunications, energy. Three companies with very different sizes, histories and DNA. And yet, they all share the same objective: to innovate and change, and so to remain or become leaders in their respective markets. The multiple questions that this raises for them warrant your close attention. In this capstone module, you will study each of these three companies and will in turn be an analyst, a consultant and a manager, depending on the assignment. You will use the knowledge acquired in the three MOOCs of this specialization to complete your assignments: analyse a digital business process, define and formulate a strategic shift, apply the principles of growth hacking, and more.\n\nSHOW ALL ABOUT DIGITAL BUSINESS - CAPSTONE PROJECT\nSHOW ALL"
    },
    "/specializations/value-creation-innovation",
    {
       "Url":"/learn/impact-of-technology?specialization=value-creation-innovation",
       "name":"The Impact of Technology",
       "Rating":"The Impact of Technology\n4.5\nstars\n103 ratings\n•\n50 reviews\n\nIn this course you will learn how to use theories and methods to make predictions of the potential impact of new technology – in general, as well as for a specific application. This will prepare you for the changes that we are facing in society, and also help you take advantage of transformations which are driven by technology. \n\nThe course takes a broad approach, including social and economic factors. You will study historical examples and learn to recognize recurring patterns and cycles. The curriculum includes general innovation theories, foresight methodology, value chain disruption and strategy.\n\nThe general process is as follows. First you to learn how to draw a map of the potential future business landscape. After that, you get to identify interesting future business roles in emerging value networks. Finally, we find a path from where we are today to a desired end state. You will analyze how an industry or market may change if the technology which is available today is fully implemented in a 10 to 20 year perspective. In addition, you will identify barriers to such a development and make estimates regarding the timing. \n\nThe course includes a number of assignments to facilitate your learning – some of them compulsory.  The largest assignment is about the introduction of self-driving cars (hence the course icon; source and credit to Google). \n\nWe all know that the future can’t be fully predicted in detail. However, the methods presented in this course will help you identify potential consequences. In this way, you will get a toolbox for decision making in the areas of technology, investments, career path, research & development or portfolio management.\n\nSHOW ALL ABOUT THE IMPACT OF TECHNOLOGY\nSHOW ALL"
    },
    {
       "Url":"/learn/open-innovation-entrepreneurship?specialization=value-creation-innovation",
       "name":"Innovation & Entrepreneurship - From Basics to Open Innovation",
       "Rating":"Innovation & Entrepreneurship - From Basics to Open Innovation\n4.6\nstars\n276 ratings\n•\n63 reviews\n\nThis Innovation and Entrepreneurship course focuses on the interconnection between entrepreneurial thinking and innovation.  Specifically, we look at models used in Silicon Valley to grow both start-up companies as well as innovation inside large organizations.  Bringing together top Haas School of Business, UC Berkeley faculty, this course addresses critical areas for successful growth, including design thinking, open innovation, business models, product-market fit, and financing.  This course will teach you how to think like an entrepreneur and provides the models, tools and frameworks to further develop your business or idea.  An emphasis will be placed on the IT space.\n\nIn this first part, From Basics to Open Innovation, the following areas are included: innovation and entrepreneurship basics; the Silicon Valley entrepreneurship model; the importance of failure; market analysis: how to engage with customers; and open innovation.\n\nSHOW ALL ABOUT INNOVATION & ENTREPRENEURSHIP - FROM BASICS TO OPEN INNOVATION\nSHOW ALL"
    },
    {
       "Url":"/learn/design-thinking-entrepreneurship?specialization=value-creation-innovation",
       "name":"Innovation & Entrepreneurship - From Design Thinking to Funding",
       "Rating":"Innovation & Entrepreneurship - From Design Thinking to Funding\n4.7\nstars\n76 ratings\n•\n18 reviews\n\nThis Innovation and Entrepreneurship course focuses on the interconnection between entrepreneurial thinking and innovation.  Specifically, we look at models used in Silicon Valley to grow both start-up companies as well as innovation inside large organizations.  Bringing together top Haas School of Business, UC Berkeley faculty, this course addresses critical areas for successful growth, including design thinking, open innovation, business models, product-market fit, and financing.  This course will teach you how to think like an entrepreneur and provides the models, tools and frameworks to further develop your business or idea.  An emphasis will be placed on the IT space.\n\nIn this second part, From Design Thinking to Funding, the following areas are included: design thinking; innovation cycle process; business modeling; and funding.\n\nSHOW ALL ABOUT INNOVATION & ENTREPRENEURSHIP - FROM DESIGN THINKING TO FUNDING\nSHOW ALL"
    },
    {
       "Url":"/learn/marketing-strategy-entrepreneurs?specialization=value-creation-innovation",
       "name":"Marketing Strategy for Entrepreneurs",
       "Rating":"Marketing Strategy for Entrepreneurs\n4.4\nstars\n144 ratings\n•\n48 reviews\n\nYou live a hands-on-life, and you intend continuing doing so! That is why I guess you already have checked where the QR-code (the logo) for this course lead to, right?\n\nAnd it is in such kind of setting you prefer hands-on-learning. Things you can do, already today, is something you value. \n\nYou actually did not start this course when enrolling it. You started it long ago, Either as a customer somewhere, or just maybe thinking about marketing for some time. Or maybe you are already working on marketing, of you yourself or maybe your own company. Or as employed somewhere of course. In all these situations what matter is action. Action that contribute to your marketing-journey.\n\nThis is the reason why we will start of with a situation “as if” you were starting up the sales process in a company where no previous customers existed (and maybe you are, if so...use it during the course). Gradually your sales efforts give result, you get customers and handling the market expansion becomes important. If somewhat lucky, in practice that is the way it goes.\n\nThe course begins with the art of cold calling (attacking the ones that did not know you did exist. The most tricky ones) and analyzing the potential customers, then gradually moves over to segmentation, positioning, closing the deal, competition, marketing strategy and market expansion. It is normally in that order it develops in practice. \n\nThe curriculum includes general basic marketing theories as well modern digital marketing issues like onboarding, conversion, and retention, experimental marketing and pivoting. The course includes a number of assignments to facilitate your learning – some of them compulsory. All of them hopefully practically useful for you already today.\n\nOn one hand this is a basics course. There is far more in this than we are able to cover here. But I still think this course will prepare you for some of the most common marketing and sales efforts needed for technology based companies. Later on I guess you will learn more. Maybe here or somewhere else.\n\nHope you enjoy it. Good learning have to be fun. So if the course is not fun enough for you: Please let me know!\n\nSHOW ALL ABOUT MARKETING STRATEGY FOR ENTREPRENEURS\nSHOW ALL"
    },
    {
       "Url":"/learn/capstone-value-creation-innovation?specialization=value-creation-innovation",
       "name":"Capstone Value Creation through Innovation",
       "Rating":"Capstone Value Creation through Innovation\n\nThis capstone course is the final course of the Value Creation Through Innovation Specialization. The specialization covers technology bases innovation and transformation and how to spot and to capitalize on emerging opportunities. UC Berkeley Haas School of Business and KTH Royal Institute of Technology are the academic partners in the Value Creation Through Innovation Specialization. \n\nIn this capstone project you will utilized the methods introduced in the courses The Impact of Technology, Innovation & Entrepreneurship, and Marketing Strategy for Entrepreneurs, and show that you master them. You should be able to show knowledge and judgment regarding when and how to utilize what method and approach. You will throughout the capstone project work on one project that you select yourself. Each week you will be given one major assignment to complete, and later to review.\n\nSHOW ALL ABOUT CAPSTONE VALUE CREATION THROUGH INNOVATION\nSHOW ALL"
    },
    "/specializations/tidyverse-data-science-r",
    {
       "Url":"/learn/tidyverse?specialization=tidyverse-data-science-r",
       "name":"Introduction to the Tidyverse",
       "Rating":"Introduction to the Tidyverse\n3.9\nstars\n19 ratings\n•\n7 reviews\n\nThis course introduces a powerful set of data science tools known as the Tidyverse. The Tidyverse has revolutionized the way in which data scientists do almost every aspect of their job. We will cover the simple idea of \"tidy data\" and how this idea serves to organize data for analysis and modeling. We will also cover how non-tidy can be transformed to tidy data, the data science project life cycle, and the ecosystem of Tidyverse R packages that can be used to execute a data science project. \n\nIf you are new to data science, the Tidyverse ecosystem of R packages is an excellent way to learn the different aspects of the data science pipeline, from importing the data, tidying the data into a format that is easy to work with, exploring and visualizing the data, and fitting machine learning models. If you are already experienced in data science, the Tidyverse provides a power system for streamlining your workflow in a coherent manner that can easily connect with other data science tools. \n\nIn this course it is important that you be familiar with the R programming language. If you are not yet familiar with R, we suggest you first complete R Programming before returning to complete this course.\n\nSHOW ALL ABOUT INTRODUCTION TO THE TIDYVERSE\nSHOW ALL"
    },
    {
       "Url":"/learn/tidyverse-importing-data?specialization=tidyverse-data-science-r",
       "name":"Importing Data in the Tidyverse",
       "Rating":"Importing Data in the Tidyverse\n4.6\nstars\n20 ratings\n•\n3 reviews\n\nGetting data into your statistical analysis system can be one of the most challenging parts of any data science project. Data must be imported and harmonized into a coherent format before any insights can be obtained. You will learn how to get data into R from commonly used formats and harmonizing different kinds of datasets from different sources. If you work in an organization where different departments collect data using different systems and different storage formats, then this course will provide essential tools for bringing those datasets together and making sense of the wealth of information in your organization.\n\nThis course introduces the Tidyverse tools for importing data into R so that it can be prepared for analysis, visualization, and modeling. Common data formats are introduced, including delimited files, spreadsheets and relational databases, and techniques for obtaining data from the web are demonstrated, such as web scraping and web APIs.\n\nIn this specialization we assume familiarity with the R programming language. If you are not yet familiar with R, we suggest you first complete R Programming before returning to complete this course.\n\nSHOW ALL ABOUT IMPORTING DATA IN THE TIDYVERSE\nSHOW ALL"
    },
    {
       "Url":"/learn/tidyverse-data-wrangling?specialization=tidyverse-data-science-r",
       "name":"Wrangling Data in the Tidyverse",
       "Rating":"Wrangling Data in the Tidyverse\n4.8\nstars\n13 ratings\n•\n4 reviews\n\nData never arrive in the condition that you need them in order to do effective data analysis. Data need to be re-shaped, re-arranged, and re-formatted, so that they can be visualized or be inputted into a machine learning algorithm. This course addresses the problem of wrangling your data so that you can bring them under control and analyze them effectively. The key goal in data wrangling is transforming non-tidy data into tidy data.\n\nThis course covers many of the critical details about handling tidy and non-tidy data in R such as converting from wide to long formats, manipulating tables with the dplyr package, understanding different R data types, processing text data with regular expressions, and conducting basic exploratory data analyses. Investing the time to learn these data wrangling techniques will make your analyses more efficient, more reproducible, and more understandable to your data science team.\n\nIn this specialization we assume familiarity with the R programming language. If you are not yet familiar with R, we suggest you first complete R Programming before returning to complete this course.\n\nSHOW ALL ABOUT WRANGLING DATA IN THE TIDYVERSE\nSHOW ALL"
    },
    {
       "Url":"/learn/tidyverse-visualize-data?specialization=tidyverse-data-science-r",
       "name":"Visualizing Data in the Tidyverse",
       "Rating":"Visualizing Data in the Tidyverse\n\nData visualization is a critical part of any data science project. Once data have been imported and wrangled into place, visualizing your data can help you get a handle on what’s going on in the data set. Similarly, once you’ve completed your analysis and are ready to present your findings, data visualizations are a highly effective way to communicate your results to others. In this course we will cover what data visualization is and define some of the basic types of data visualizations.\n\nIn this course you will learn about the ggplot2 R package, a powerful set of tools for making stunning data graphics that has become the industry standard. You will learn about different types of plots, how to construct effect plots, and what makes for a successful or unsuccessful visualization.\n\nIn this specialization we assume familiarity with the R programming language. If you are not yet familiar with R, we suggest you first complete R Programming before returning to complete this course.\n\nSHOW ALL ABOUT VISUALIZING DATA IN THE TIDYVERSE\nSHOW ALL"
    },
    {
       "Url":"/learn/tidyverse-modelling-data?specialization=tidyverse-data-science-r",
       "name":"Modeling Data in the Tidyverse",
       "Rating":"Modeling Data in the Tidyverse\n\nDeveloping insights about your organization, business, or research project depends on effective modeling and analysis of the data you collect. Building effective models requires understanding the different types of questions you can ask and how to map those questions to your data. Different modeling approaches can be chosen to detect interesting patterns in the data and identify hidden relationships.\n\nThis course covers the types of questions you can ask of data and the various modeling approaches that you can apply. Topics covered include hypothesis testing, linear regression, nonlinear modeling, and machine learning. With this collection of tools at your disposal, as well as the techniques learned in the other courses in this specialization, you will be able to make key discoveries from your data for improving decision-making throughout your organization.\n\nIn this specialization we assume familiarity with the R programming language. If you are not yet familiar with R, we suggest you first complete R Programming before returning to complete this course.\n\nSHOW ALL ABOUT MODELING DATA IN THE TIDYVERSE\nSHOW ALL"
    },
    "/specializations/data-science-fundamentals",
    {
       "Url":"/learn/intro-analyticthinking-datascience-datamining?specialization=data-science-fundamentals",
       "name":"Intro to Analytic Thinking, Data Science, and Data Mining",
       "Rating":"Intro to Analytic Thinking, Data Science, and Data Mining\n4.0\nstars\n50 ratings\n•\n11 reviews\n\nWelcome to Introduction to Analytic Thinking, Data Science, and Data Mining. In this course, we will begin with an exploration of the field and profession of data science with a focus on the skills and ethical considerations required when working with data. We will review the types of business problems data science can solve and discuss the application of the CRISP-DM process to data mining efforts. A brief overview of Descriptive, Predictive, and Prescriptive Analytics will be provided, and we will conclude the course with an exploratory activity to learn more about the tools and resources you might find in a data science toolkit.\n\nSHOW ALL ABOUT INTRO TO ANALYTIC THINKING, DATA SCIENCE, AND DATA MINING\nSHOW ALL"
    },
    {
       "Url":"/learn/predictive-modeling-model-fitting-regression-analysis?specialization=data-science-fundamentals",
       "name":"Predictive Modeling, Model Fitting, and Regression Analysis",
       "Rating":"Predictive Modeling, Model Fitting, and Regression Analysis\n4.5\nstars\n24 ratings\n•\n2 reviews\n\nWelcome to Predictive Modeling, Model Fitting, and Regression Analysis. In this course, we will explore different approaches in predictive modeling, and discuss how a model can be either supervised or unsupervised. We will review how a model can be fitted, trained and scored to apply to both historical and future data in an effort to address business objectives. Finally, this course includes a hands-on activity to develop a linear regression model.\n\nSHOW ALL ABOUT PREDICTIVE MODELING, MODEL FITTING, AND REGRESSION ANALYSIS\nSHOW ALL"
    },
    {
       "Url":"/learn/cluster-analysis-association-mining-and-model-evaluation?specialization=data-science-fundamentals",
       "name":"Cluster Analysis, Association Mining, and Model Evaluation",
       "Rating":"Cluster Analysis, Association Mining, and Model Evaluation\n4.6\nstars\n22 ratings\n•\n1 reviews\n\nWelcome to Cluster Analysis, Association Mining, and Model Evaluation. In this course we will begin with an exploration of cluster analysis and segmentation, and discuss how techniques such as collaborative filtering and association rules mining can be applied. We will also explain how a model can be evaluated for performance, and review the differences in analysis types and when to apply them.\n\nSHOW ALL ABOUT CLUSTER ANALYSIS, ASSOCIATION MINING, AND MODEL EVALUATION\nSHOW ALL"
    },
    {
       "Url":"/learn/natural-language-processing-captsone-assignment?specialization=data-science-fundamentals",
       "name":"Natural Language Processing and Capstone Assignment",
       "Rating":"Natural Language Processing and Capstone Assignment\n4.4\nstars\n14 ratings\n•\n2 reviews\n\nWelcome to Natural Language Processing and Capstone Assignment. In this course we will begin with an Recognize how technical and business techniques can be used to deliver business insight, competitive intelligence, and consumer sentiment. The course concludes with a capstone assignment in which you will apply a wide range of what has been covered in this specialization.\n\nSHOW ALL ABOUT  NATURAL LANGUAGE PROCESSING AND CAPSTONE ASSIGNMENT\nSHOW ALL"
    }
 ]